{"posts":[{"title":"醉月追忆","text":"序隐岐之国，自古为大和国放歧之人之地。受歧之人，多会于此。其位于蓬莱之岛之南，出云国之北。今夜远望，念隐岐国故人。新朝自有雅政，大和国维新，尝有奇人异士自隐岐之地而来。越明年，奸臣进谗言于天皇，天皇将隐岐之民与罪人遣回隐岐之国。令人唏嘘不已啊，好不容易，有一个新的势力，一群正要走出黑暗的被歧视的人们终于可以在新时代站起来，来一场轰轰烈烈的革命了，但是他们却什么也没有得到，他们几乎就看到了光明，然后就又一次成为了罪人的代词。异哉，异哉。 正文 寄思于云月一轮，空度此生不羁魂。星虚月幻空眺望，归来以障自叹息。千秋隐岐万载忆，四时化尘作星光。怒莫如后羿射月，长相思久久难忘。醉莫如银树之恋，瞬一梦破生死相。秋雪飘飘掩月面，别时圆聚时不现。莫怨我不解秋意，只缘身为蓬莱人。玉枝化作不死烟，随风飘零散人间。月恒存来去自如，人无常生死无间。望月者悲秋伤春，登高者宠辱偕忘。变生喜悲苦生死，不变有常作轮回。若非深知此生苦，谁愿孤寂尽一生？天宫铜月冷几分？人间四月烟火存。怀故但愿人不久，将此不公人世变。 后记我把自己看作挑战权威的人，我真的有这个能力吗？还是说？ 「话说为什么要在今天纪念那些没能争取一次轰轰烈烈的革命就又一次被流放的隐岐之人们？」 「怎么说呢？过去，湖南教员……算了大家别多想就是了（笑）。」","link":"/01/46years.html"},{"title":"寂白之间 第二章 水晶之夜 Crystallized Night","text":"回忆本质上来说，是蒸发溶剂得到晶体的过程，慢慢地让记忆重新分离重组体现事实的过程，看清那过往自己谬误的过程，最为痛苦，最为透彻，最为清晰。在此之前，要先让它稳定下来，然后再慢慢品味这智慧与痛苦。 “军特高中部的优秀师资力量，可以保证师生比完全大于1，这将会对你们的高中生涯学业有巨大帮助，此外我们的高考数据也年年走高，一本率到达了90%的水平，余杭区第一。“王老师说到这顿了一下，看向正低头打嗑睡的小泽，向他丢去一个黑板擦，正中他的同桌。 “你们这些打嗑睡、不好好听的人啊。我倒问你们，你们若是丧失了这次机会，你们倒去哪儿？我平心静气和你们说，就凭你们现在的学习水平，去和其它学校的学生比中考，你们就是—” “炮灰中的炮灰，他说我们这些想参加中考的人会成为“炮灰中的炮灰。”我苦笑着说。后视镜里现出我父亲的身影，金色的路灯给车里的一切染成金黑色，除了那幽蓝色的烟，从主驾驶座的窗户飘出，他对我笑着，将香丢进烟灰缸。 “他认真的？”父亲笑着问道。 “大概吧，我说不好。”车开到一座桥上，清蓝色的江水倒映着洁净的月光，冷色调将纯重的豪奢的金色光芒一扫而空，仿佛我不现实的虚拟的假象，曾让我自满骄傲的幻境，唯余七分钢筋水泥结构的残留物，二分古坟野冢，一分从远方照映而来的冷冰的透析的光。 “柏林，你要知道，我们一开始送你去军特只是为了作为一个跳板，去杭外。但我们发现你逐渐与这个学校产生奇异的共鸣，它对你的意义也随之而变。也许影响不全是坏的，而你始终都在这个学校有一个巨大的优势:你始终都有选择。无论他们怎么说，无论你做什么事，你始终都有选择，千万莫要在别人的谎言中丧失自己的选择权。” 下桥之后，两天拐至一个偏僻的小道，周围几近一片漆黑，那车灯如同光明的利剑扎入交影深幽的黑里，但黑夜的朦胧又好像要把这利剑给吞噬了似的。”左转，然后拐回天目山西路。”他开了许久未开的导航，我们都是人，都有一刻会迷路，都有一刻会迷惘。左转之后，我们扎入在路灯下雾气稀薄的大道之中。车不断加速，开得越来越快，我看不清父亲的脸，而一切都变成金色粉墨组成的画景。刹那间，我在这梦魇的加速中坠回现实，我醒来却发现，周围仍是烟雾缭绕，完全无法看穿。 桌子上的粉笔灰在冬日的阳光下显示着色彩，有时浮到空中，将我迷住。阳光被它挡住，在青灰色的校服上，映出几个黑色的点。 “你醒着吗？”我摇了摇小泽的身体，他微微一笑，作为问题的回答。 小泽伸了伸懒腰，捡起不知被谁撞到地上的《自然哲学的数学原理》。他将书翻回29页，放回桌上:“你知道我为什么完全放弃了留在军特的念头吗？”他辛酸的表情越看越像自嘲。 “我完全知道，没有人比我更明白。”我脱不藏青色的外套，“好子爵进了麻风村，他让麻风病人们不要寻欢作乐，要他们尊从道德准则，却将他们留在病痛与虚无之中。我不禁要问一句，这样做到底是好还是不好？将假的欢乐带走，却让我们承受这莫大的痛……” “你不是鲁迅，我也不是钱玄同，何故在这里做无谓的铁窗之辩？你走吧，我再睡会。”小泽趴下了，众人都早已离开，奔向食堂。军特不知为何，将墙涂上了一层天蓝色的漆，但眺看外间，却是惨白的天。高挺的乌黑的树与发亮的黑色塔顶，将这寂白切割开来，而我只是看着，我在这冰蓝的房间向外望去。我透过冷冰的铁窗向外望去，仿佛我是它的一个囚徒。我想，坐在笼子里被牛车拉走的愁容骑士，想必也是我当下的心情。 “啊！”我叫了一声，声控灯打开了，我在金黄色的灯光下又走进漆黑里，打开门，却显出冷白的光。我怎么又走回冷色调了？难道这一切，都在催促我做出选择？ “我回来了。”我默默地坐到桌旁开始吃晚饭，他们也都知道我因此而心事重重，所有人都没说话。 饭后我走进一片漆黑的房间，Retina屏幕幽蓝色的光过于微弱，不足以照亮我的身躯。 打开“钉钉”，打开表单，我看见那抉择，我看见那选项。我最后一次分析，在我选择之前：创新班独立上课，作为实验班必须留在军特高中就读;英高班，独立上课，作为军特高中预备班；还有最后一个，中考班，必将离开军特，凭中考成绩参加普通高中，最自然又困难的方式，最令人害怕的方式。我怕什么呢？我想，我害怕真相，我害怕知道自己不适合应试教育，我害怕自己失败，然后一无所有。 直到那时刻迫近你有可能意识到作出选择前的紧张与准备是无意义的，因为做出让自己不后悔的决定是不可能的，无论做什么事都注定要放弃一些可能得到的东西。 “第一志愿:中考班。第二志愿:无，确认提交？是。否。”我将鼠标挪向“是”的选项，仿佛看见我坐在军特创新班的教室里，有一瞬间，我看见从窗中，屏幕中、门中，射来蓝色的丝影，那是我本能拥有的人生。“是“与”否”，简化为0与1，模糊为真与假，二元对立，是对未知的天堂与地狱的选择。我想要享乐与轻松，还是真正地“成全”自我，到达更高的境界？或者说，其实都一样，并没有什么区别？ “所以你为什么选择不来军特创新班，而是要去尝试中考呢？”王老师面色铁青地发问了。 “和任何人做出选择的原因一样，我觉得我能搞定它。”我掩盖着笑意，但王老师明显不满意。 “有自信是好的，我回头再找你聊，我先和其他同学聊，你先走吧。”我迅速走出了办公室。我走过天蓝色的回廊，走回教室。小泽是下一个，他问我我们聊了些什么，我说没聊什么。我走在白光充盈的房间里，过于寂静，过于肃暮，过于单调。坐到座位上，沉默着无事可做。窗外的白玉兰枯萎了，再也无法激起我的一点哲思，曾属于诗人的灵感在蓝色的监牢里枯竭了，我一次次用笔尝试描述些什么东西。但又屡屡失败，笔墨散尽，纸张破碎，我还是无法表述自己，哪怕是最小的一部分情感。此时我又想起我当初为什么开始写作，于是我含着泪写下下一个注定不会长久的诗篇的开端。 我再一次感受到那种撕裂的空虚感，在每一件物品中，在每一个人中，我不能不注意到那深藏的空洞和裂缝。我开始问自己一个问题，我的选择是否真的有意义。 而当我日后注目这幻想的回忆。我只看见朦胧的影像，是深蓝的江面上，倒映着洁净的月光。","link":"/01/CrystallizedNight.html"},{"title":"寂白之间 第一章 死亡之舞 Danse Macabre","text":"红色的帷幕下有许多奇装异服的异人，屏幕上空调多彩的背景前，有着对我来说唯一的实际表意物，即字幕。毕竟演员自己不一定理解台词，理解了也不一定能表达出来，表达了我也不一定能看懂。为免除前两者的表意误差，我还是决定看字幕。《罗密欧与朱莉叶》，音乐剧，嘈杂的人群，一个试图从抽象符号中看见一些实际之物的人，还有一个注定的不眠夜。 这场表演是经历选拔之后全校精心编排的演出，出于我们的演出除了些小意外，我们班没有入选。做了检讨之后，我的声名日益狼藉(据我所知，是一个叫董高的在带动)，大家觉得我不肯承认错误，更该批判。我在这戏剧节剩下的几日，注定不好过。 事实上，我当时不算好过：小泽郁郁终日，小王尚未恢复心态，郭导也见不太着，班长不久就要走人，转学到别的学校去“重新开始”。我沉默寡言，大家又觉得我犯了返错误，还会已然排挤到了班级的底层。于是我平日的午休都到图书馆去，与尼采和王小波倾诉我的愁恕。我那时的幽怨并不让他人知道，大抵是件好事。 总之那几天要是算有什么新奇的事的话，那便是某个周三的下午，我与小和去语文办公室拿作业。出我意料，是赏析一些范文，我粗看了一看，有一篇叫《咖啡与自由意志》的，论证清异灵奇，可以一看。我正打算上楼时，班长把我叫住了。 “你过来，我问你。你愿意保护我吗？”我身旁无一个人，走廊不大亮堂。此时发秋风，枯叶飞过我身旁，远方的天空是灰白色的，云彩层叠为景……我为何想这么多，正是因为我不想更不会回答，我正在痛苦地找一个转移话题的方式，但什么都不是。我只能冷冷地看着她，她难道不知道问这么一个问题会让我多么痛苦？ 她不会不知道我当下的处境，我甚至有一瞬间小有怀疑，她要在离开之前将对班草用过的招法如法炮制。我根本不知道该怎么用语言来与她沟通了，破碎与伤痛将我击溃了，我没有说一句话。这让我感受到一种侥幸和懦弱。 于是我抱着那一叠纸飞快地跑上楼，放好之后，尽力忘掉这一句话。可我忘不掉，我不理解，这总令我感觉介于被要与辜负她之间，笔尖闪出青色的光，我提起笔开始写，我写不出来！我不能表达什么，对于此事，我无以描述，我唯能在寝室躺下，我唯能再陷入睡眠。但我辗转却不得入睡，痛觉不曾消减，我就这样在床上畏缩了数个小时。而我回去时，小和的座位上已经没有东西了，什么也没有了，人也不见了，她就这么消失了。 可悲的是，这也是我与她最后一次见面，而这一切，竟然都不明不白的结束了，我不能知道她有无恶意，对于当时与之后的她，我什么都不知道。我很抱歉以这种带有恶意的方式去揣测她，我也不知道那些日子里发生了什么，在昏暗灯光下的想象中，我又浪费了不知多少时间。直到现在，我还是认为，在她消失之前我与她还是朋友。 “那便让这混乱开始吧！”台上的家长身穿红衫，走至台前厉声而歌。字幕的滚动如同流水不断地敲击琴键，输出无数的音符，无数的信息，无数的问题，无数的答案，时间在我痛苦的悲鸣中消失不见。失去并不是最大的痛苦，失去价值才是，她的行为与消失告诉我，无论我们二人之间的友谊是真是假，都已经没有了，没有什么撕心裂肺的结局，没有什么苦痛和伤怀的告别，只是永远不可能再度存在，再度具有价值的虚无。 麻痹了我疲软的神经的，是什么？我时刻想起那种在未曾预期的分别是悲痛与哀伤，那是只属于我的情感基调，是永远无法改变的悲凉色彩。 在漫长的痛苦中，我走向另一层台阶，往上与往下已不重要，重点是行走的过程，所有演员开始舞蹈，这意味着什么？唯有欢乐与死亡，但究其本质，不过是一场舞会。 “王天明同学是吗？”我拿回递给他的纸笔，刚从台上的明星状态回到正常状态的王天明非常淡定地给我签了个名，显然这对他很平常。 “是给班里的女生的吗？”王天明笑了笑。 “我是想自己留着，我确实很像要《咖啡与自由意志》作者的亲笔签名。” “这样啊，”他不禁笑了笑，“那你觉得写得如何呢？” “文章非常的优美绚烂啊，只不过呢，我有些小疑惑，你在作品中提到的美式拿铁是什么？我不太喝咖啡，不太懂。” 他瞬间变了脸色，不过瞬间又变得轻松起来，“话说陈伯林同学，你平时写东西吗？” “略写一点。”我笑了笑，我与他看着彼此，走向操场的深处。 如同马可·奥勒留所说，在这场戏中，有多少人演不到三幕？既然要在舞会中舞蹈，就功莫草草离开，而要以胜者的身态旋转。这机会不可多得。 “所以你觉得军特创新班如何？”王老师的一句话把我拉回了现实。与我过往来时不一样，这个办公室还是崭新的时候，我还能在王老师面前冷嘲热讽，嬉笑怒骂。可是现在我突然感受到了一种严肃，我仿佛在冥冥中意识到了某种事情将要来临，将会改变很多。实际上，在这么一段极短的时间里，我与她的聊天方式已经改变了很多了，从愈发诡异的眼神交流中，我看向一个空白的墙角落，那里竟然从无而有长出一条裂缝来。 “是非常好的项目，可是……并不适合我。”我轻描淡写答道，他注意到了我的心不在焉。如同很多东西一样，我会赞美它，可我并不认同它。原来那里一直有条裂缝，我想起来了，只是我忘了而已，但是我为什么会忘却它呢？况且我怎么会有，看见那条裂缝在影子里生长的幻觉？ “你这么优秀，我们的创新班怎么会不适合你呢？”他的语言步步紧逼，我自知走为上策。 “我下节课快上课了，王老师，我们下次再见吧。”我向后退去，走时带上了办公室大门。我没有去看她的眼睛，我不知道她是什么心情，什么想法。我也不知道我在干什么，是在逃避还是做出实际意义上的抉择。 她的廉价赞誉让这件事变得更加无趣，事实上，我对军特创新班并不曾有何期待，我初中几年最大的一个目标便是从这死地里爬出去。无论开什么条件，我也不会爬回去。 我经这么一提醒，终于想起来那时候要近了，中考当前，我终究还是要做出选择。","link":"/01/DanseMacabre.html"},{"title":"施洗者的预言","text":"Act 1 Days of Future Past登上萧瑟荒茫的山坡，眺望不断跳脱在远方的天际线，犹太沙漠从未显得如此辽阔。他已经忘却了故土的模样，现在自己只是捕风捉影的游子，尝试抓住幸福的影子，而且确实成功了几次。远远地，他望见一个灰点出现在远方，好象一座荒废的石堡，那是希律王的城堡吗？大抵那鲜花洋溢的道路都已化作尘土了，那富丽堂皇的厅堂也已经覆上一层厚厚的沙了。曾囚禁过他的监牢，此时不过是锈迹与石堆了。想到此时，奈拉比斯驻足停步，想要为他叹息，仔细一看，却发现那只不过是海市蜃楼。 他确实死了，他最后的预言没有实现。或许命运在预言者最自信的时候，对他也开了个玩笑吧。不错，死亡即是命运无可避免的终结。在这一方面，命运对所有人都一视同仁，这是他唯一的宽慰了。而从远方吹来的风中，他仿佛又一次听见，那平静声音中缓缓道来的预言。 “队长，你方才所说的希律王的皇宫还有多远？”奈拉比斯睁开双眼，一条鲜花绽放的道路展现在他眼前，一支马队正在这条路上走，只有两个人在马上，二十年前的自己，还有那个戴着镣铐的预言家。 “不远，再走几步就到了。” “那就无必用预言与幻想对之多加描绘了，我将看见它，或者它将抵达我身旁。” 两人又一次陷入沉默，约翰盯着镣铐上的血迹和泥尘，而队长望向远端几乎被飞沙染黄的天空。 “有的时候，有一个问题一直使我迷惑，约翰。你们是怎么得知一个人的精确命运的？上天不可能主动告示你们一个平凡人的命运，毕竟普通人的命运，在时间的长河中是微不足道的；而我猜你们又没有特权去询问上天，不然就不会时灵时不灵。” “队长啊，我不想说太多，探寻天机是我的‘命运’，命运这东西，怪异灵奇，几百万年后的预言者们要用比我所用的远远更加伟大的方式探测，但最终对于未来，还是只有几个飘渺不定的影子，若是放眼宇宙，一切都只不过是一瞬间。一切不过是命运的棋子，可能主在与自己下一场在永恒之前落幕，在永恒之后开始的死局。”约翰长叹了一声，缓缓地说道。 “我曾听一些异教徒说过，世界只不过是由一堆原子组成的，是在漫长时间的无序中诞生的有序，而上帝只是那第一个推动的力，在一切静止的时候，挪动了一个点，虽然不需要意识，不需要多大的力量，不需要生命或智慧来做到这一点，但是那是最重要的一件事件，因为自此就有了决定一切发生的‘命运’。” ”命运是什么？或许只是由那一原始的推动力，与原子错乱的排列所促成事件的集合。我们的祖先食禁果，获得了智慧，学会了恐惧，他们畏惧着什么？不过是自己时刻是命运的奴隶这一事实而已，智慧之果先让你理解何为真正的自由，再让你得知是奴隶的现实。也是因此，人类在世上所有的生灵中，所受的苦难也是最大的。” “不过纵使我有计算命运的能力，也绝不会想到，有人会在沙漠的行道上种这样的花。”约翰冷哼了一声，亚当花正盛放在路边，现在正是它色泽鲜艳的季节。 “这些花都是从罗马移植来的，是凯撒的一位大臣送给他的，为了取悦皇后希罗底，但希罗底不会赏花，就像她从不欣赏皇上给她的任何东西一样。”卫队长捡起马蹄下残破的长着棘刺的花枝。 “那为什么希律爱她？”施洗者约翰坐在马上，经过片刻的沉默后开口了。 “他爱她吗？他爱她的女儿。他爱莎乐美，只不过希罗底不愿意把莎乐美嫁给他而已，希律是一位贤明的君主，并不喜好美色，但你若是见到莎乐美，你也会爱上她的。”奈拉比斯提起她，语调都有些异样了，像脱谱的曲调。 ”你去过罗马吗？”约翰扬起大理石雕刻一般的头，飘逸的卷发在阳光下闪出赤金色的光芒。二人骑在马上，其他卫兵步行，懒散得并不列队，披着厚重的盔甲随意而漫无目的地走。 “没有。”队长是一个长相二十多岁的年轻人，看起来并不像个犹太人，更像来自异国的贵族，那他为什么要年纪轻轻，就背井离乡，来到犹太王国呢？约翰感到费解。 “我现在向你预言：你不能够在这个国家久留，也不应当回到你的故乡去。在一个月圆之夜，你将顺着一个商队到罗马定居，久久不得回国，只有在那里，你才能够找到幸福。”预言者闭上双目，缓缓地说出预言。奈拉比斯轻哼了一声，作为回应，但那也有可能是风，他不在意。 当他睁开双眼时，他发现自己置身于一个巨大的园子；在无垠的沙漠中唯一的一块绿洲，长着美丽的果树，开着异乡的花。灌木丛刻意做成了迷宫式的排列，孔雀们纷纷展开屏，在视觉难察的地方蚕食着，已经失去知觉的奴隶脊梁上的腐肉。 “一位国王将自己困在一个充盈着草木与怪兽的迷宫里，这又寓示着什么呢？”约翰与队长下马，登上长阶。 “我不知道。正如当年一样。”灰黑色的云聚集在一起，远端传来雷鸣。雨？已经有些时间没有下过了，甚至在自己的记忆里，在这片大地上，连乌云都很少见，下些也好，奈拉比斯想道。 “当年？”约翰用他那冰蓝色的目光看向眼前的年轻人。 “我曾是叙利亚的王储，每日月优哉游哉过着贵人的生活。有一日，我在皇宫外玩耍时，用弹弓打死了一只黑色的怪鸟，我的哥哥大惊失色，让我赶快将怪鸟埋在土中。但我在埋那只鸟的时候，我看见一个东方人和一个戴着面具的男人正躲在巷角讲着价，隐隐地我看见一块刻着方形文字的石碑，我正看着，那怪鸟的尸体却化成了血水，仿佛溶在了土地里一样。”二人走进巨大空寂的石堡，队长拿起一支立在石架上的血色火把，带着约翰继续向上走。 “戴着面具的男人怀揣着石碑，慢慢靠近我的身后，他对我说:‘无须畏惧，你所预见的，都只会是你的命运。’他摘下面具，让我看向它他血丝密布但又异常美丽的眼睛。在他浑浊与分层的眼睛中，我看见大地在干裂中流出鲜血，犹太王国的军队冲破我们竖不可摧的黄铜大门。我回过神的时候，那个男人已经不见了。”远方传来回声，各种语言混杂的奇妙声音。 “我找到父王，说我在路上遇见一个神秘的男人，他诡异的眼睛让我看见一个导致帝国毁灭的可怕幻觉，父王从未如此害怕过，但他还是说不能进入战备状态，否则叙利亚将无法与周边国家贸易，国家将再度陷入贫穷之中。父王说血流成河的惨象不会发生，因为他会在敌军来之前投降。我和我的兄长十分惊讶，但谁也不敢在他面前反对。”队长推开白玉的大门，“请允许我先来拜见一下公主殿下，咦，不在吗？” “午安，二位。”二人的后面，一个衣着华美的女子出现在阶梯上。 “贵安，殿下，金枝玉叶可安好？”队长止不住要看她的眼睛，不知觉地单膝下跪。 “好，很好。”公主轻轻伸出手，卫兵队长止不住地吻，而她向着施洗者好奇地望去，“这位客人是？” 约翰并不看眼前的女子，他沉浸于这个空幽宵暗的石堡的几何结构之间，不自禁地喃喃道：“什么样的人会住在这样的一个扭曲的地方呢？” “这位是约翰，一位预言家，来自王国中部的撒玛利亚，他在信众间传道，说世界的拯救者弥赛亚快要降临到这世上了，王上觉得他的言论有些奇趣，使召他进宫来，邀他‘进言’。”队长终于放下她的手，开始显得理智一些起来。 “进言？希律王可不是一个愿意听从他人意见的人，而且除了罗马的贵人以外，此地已经许久没有能见到希律的客人了。我说得自然不包括那些一无所知的可笑的乱踱步着等待的外邦人，他们的样子倒真是野蛮。二位，我们过会再见。”莎乐美嫣然一笑，退进了白玉的门。 约翰看着三角形中杂乱地漫步的几位安息的使者，戴着头巾的沙漠行商，像几个相互排斥的原子，还有几个颜色各异的小三角形，拼拼凑凑成了一个不大一致的六芒星，他们并不在意，甚至有意回避彼此，因为他们只在乎一个目标，那就是与希律王谈事，再无什么别的。因此他们只为了消磨时间，在希律王的高堂下等候，焦急着从这令人不安的木石迷宫里离开，像未来的人们一样在结构化的几何空间中游动着避开相交的可能性，未来不过更熙攘罢了。他叹着，脑海中闪过水晶与涂上漆的钢筋的图像，跟着队长一起走上楼梯，走入一座明亮的厅堂。房间中依旧是彩绘的怪异图案，一个不断缩小的三角形，一个画中的女人捧着一张画像中的画像之类的。 “这位就是——”队长的话被一个男声打断。 “你就是约翰，那个自封的先知？”一个中年粗壮的男人，身披一件像是皇袍但怎么看都不合身的袍子。在火光下，约翰看清了他的脸，那是一张忧郁多疑的脸，带着一丝玩味神情的诡异笑容的脸，更重要的是，那并非一张犹太人的脸，而是一张阿拉伯人的脸。约翰竟产生了短暂的迷惑，但在看见未来的图景后又释怀了。 “我是。”希律冷冷地看了他一眼，似乎对“先知”的言语有些夫望。 “真有‘命运’吗？先知先生？”希律从王位上站了起来，面目又一次进入阴影。 “您还不如问上帝是否存在，这个问题我已经对我旅途上对我纠缠不休的阿拉伯人们解释过许多遍了。”约翰也将面容隐入阴影中，绕着沉默的卫队长走。 “那就假设它存在，你们这些人又是怎么知道它的呢？”国王不紧不慢地问。 “有时从虚无中被文字点醒而得到，有时则通过预兆和神迹。”约翰略颤抖着回答。 “比如？” “一只怪鸟从天上掉下来，或是沙漠下起雷雨，也可以是大海被撕裂。” 队长略微起了些冷汗，看向坐在角落的王后希罗底，他估计她很快就要开口。 “那你又从什么样的预兆中，看见你所说的弥赛亚的即将到来呢？”国王又开口了。 “伯利恒之星，导星，一颗诡异的星辰，在我在沙漠中为一位神圣的人洗礼之后，异常闪烁。”施洗者回忆起许多年前他认为自己永远不会忘记的，第一次见到圣子的日子。 “为什么要来这里，约翰先生？”一个年轻的男人，拉着蒙着双眼的约翰，在荒野中行走。二人的双脚早已被芒刺扎穿，但约仍然热意让男人带着自己向着荒野的东方走。 “寻找一些丢失的东西。”施洗者的双眼前缠着一团烂布，衣袋里的罗马金币沙沙作响。 “可是，凭我说，能落到这份境地的东西可实在是不多啊，会腐烂的，都已在此腐烂了；不烂的，都已被拎著者们抢去了。话说先生，您是个施洗的吧，但你的钱怎么这么多？”男人问。 “我可是同时给帝国与王国缴税的，从不昧着良心赚钱。你知道沙漠里，离此不远，有一座古井吗？”约翰问向那个男人，“把我带到那儿就行了。”就足够了，他这样想，如果仍不成功… “知道了，若是你告诉我目的地，而非随意地报着令人不知所云的方向与路径，我们早就到了。”男人的语气平谈中透着一丝抱怨，“不用送你回去，对吧。” “不用。留我在原地吧。我已经从风中的沙粒粗细，辨认出它的位置了。正在前方，不偏不倚，你走吧。”他听见脚步声，金币撞击的声音，男人为这一桩美差感叹的声音。 “看来，命运这次也不会因为我的到来被激起一丝连漪。”他去了一块石头进入水井，没有哪怕一点声音，与他之前每次来这井边的时候都一样。于是，他又一次转身。 “朋友，朋友！请等一下，不要走。请告诉我，这是否就是那传说中所罗门王在沙漠开出的井？”一个年轻的犹太男人的声音从远方传来，像穿过云雾吹来的清风。 “啊，这正是。可是这已经枯竭许多年了，而我失去光亮的双眼，却需要它的救治。我恐怕还要等无数年的时间，使井水复生，神迹出现。”约翰哀伤地说。 但男人将手杖插入沙地中，施洗者听见一种落叶沙沙的声音，紧接着是令他渴盼已久的泉水的声音，他不敢相信地解开双眼前的绑带，仿佛已经恢复了视觉。 “你无须再等待了。”男人平静地说，“我是拿撒勒人耶稣。”这宛如沉默的声音，在沙漠中留不了多久，但是将在未来的数千年内，在施洗者约翰的耳边永恒地回荡。 约翰用清水洗着久闭的双眼，仿佛看见眼前有一道朦胧的光，以一种怪异的纹路带着他在意识中游历于星海之间，最终到达一颗最美丽的星辰的身旁，那是无数个光圈环绕着一个金色十字形在旋转，从光圈中，他看见人们的过去、现在和将来，而自己的光圈，是与十字架最近的那一个。 他将意识从星辰中挪移出来，复归原身，才发现自己刚刚魂魄离开身体时看到的星辰，在空中闪烁着，直指着星天下的耶稣的身体。他正在用不知哪里来的木头烤着火，约翰慢慢地走近他，在他面前跪倒在地：“来自拿撒勒的耶稣啊，我应该怎么答谢你？” “你是唯一一个可以为我做这件事的人，唯一一位在人间行走，灵魂却在天国的人。约翰啊，我要你为我施洗，为你我所信奉的上帝的儿子，也就是我，施以洗礼。” “在这里？”风声戛然而止，约翰看向耶稣，但耶稣并没有看向他。 “在所罗门的泉水旁，是的。”耶稣望向了天空，“再无什么别的人可以为我做这件事，哪怕是我的父亲也不行。恐怕我已预知这一切都不过是一种预演，用水洗净人的身躯，用血洗刷人的罪孽。” Act 2 Moving in a Mysterious Way“真是荒唐啊，神迹？竟然真的有人相信这种骗人的鬼话吗？”希罗底突然尖声细气地叫起来，希律王骤然变了神色，但是却并不敢说话。 “我无需说服你们相信事实，因为事实是不言自明的。”约翰平静地说道。 “你这么说的话，我觉得你妖言惑众，也不需要证明，因为这就是‘事实’。你篡改教义，欺骗民众，破坏王国的秩序。”希罗底露出了笑容，像一朵凋谢的花，瘆人到仿佛要将空间撕开一般。 “你是所有人中离真相最远的人，耶洗别啊，你欺骗自己，你明明知道很多关于命运的事情，却要逃避它。我想，那是因为你那不干不净的权力的来源腐蚀了你。你看，你的丈夫在命运的另一头等着你，我想你很快就要见到他了。” “命运的另一头？我的丈夫？你难道是在我们神圣的厅堂里诅咒希律王吗？你难道觉得我的丈夫作为我权力的来源不干不净？”希罗底的叫声开始歇斯底里起来。 “你看，预言其实很有趣，奈拉比斯。语言可以是模棱两可的，但无论如何解释，它一定是对的，无论以什么方式解读都很正确。这个女人曾经有过两位丈夫，而这两位丈夫都很快会在命运的另一头等着她，只是其过程不明而已。恐怕，结果是一定会到来的。”约翰并不搭理希罗底，转过头对王子说。王子略有一丝惊讶，他并不记得自己何时告诉过约翰他的名字。 “你娶这荡妇是不合理的，这乱伦会招致你自己的灭亡。你会在你自己的疯狂中死，在众叛亲离之后。”约翰对希律王发出最后的警告。希律站起身，指向约翰，“我问你，——” “把他押到监狱！”希罗底怒目而起，打断了她的丈夫。 队长不知所措，看向约翰，约翰说：“那我便去监狱，或许命运早已注定，你们永远无法听到完整的预言。”约翰昂首阔步走出厅堂，奈拉比斯只好带着他走向城堡之下的监狱。 “你真是个疯子，希罗底，你怎么敢在外人的面前打断我要说的话？而且这个约翰不简单，一般人是讲不出这种话的，我现在确信是神将这些可怕的话塞进他的口中的。把他关起来，剥去他的自由，肯定是与神意相悖的。”在队长带着约翰离开之后，希律王摇着头，弹着指尖，将身子浸没在阴影里。 “我还觉得你是疯了呢。他说我们二人的婚姻是乱伦，说我是耶洗别，说你注定会因为娶了我这个‘荡妇’而疯狂至死。还胡扯什么神迹，他分明就是一个这片土地上盛产的骗子，你还想与他说什么？”希罗底还是非常愤怒，质问着希律王。 “我当时在想，直到现在也在想，万一那预言是真的呢？”希律王用冰冷的眼睛看向希罗底。 “是真的又怎样？人终有一死，他就算真的会预言，不还是进了我们的监狱？我们如果要他死，他千方百计也逃不掉。这难道不又是一个他什么也算不出来的证明？对了，我刚留意到，奈拉比斯看这个假先知的眼神有些异样，就莫要让他做监狱的守卫了。” “奈拉比斯？我觉得他作为我培养多年的卫队长，是最适合的守卫，你无须多言，他陪在我身边服侍我的时间比你和你的女儿还久。他刚才的异样，也许只是因为这个先知对他说了一些让他恐惧的话吧；我能体会那种感受，因为我现在也感到了一种无力，或许正因为畏惧遥远或切近的未来，人会犯错或是说走入命运的陷阱，让本来可能的行动失去意义，但或许如果这一切都是早已注定发生的事情的话，一切都没有意义也说不准。你走吧，希罗底，我想你有事要做。”王后缄默着离开了厅堂，国王点燃一盏烛火，双眼像刀剑一般刺入墙上不断运动着缩小的诡异的三角形里。 约翰和队长走下螺旋的石楼梯，卫队队员们和犯人们都向队长行礼，似乎队长很受这些他监管的囚徒欢迎，约翰留意到，当队长走过后，他们又很快变得颓废或懒散，像冰块在一瞬间内熔化成水一样。或许只有威严和谦卑的慈爱，才能够做到这一点。 “我曾在约旦河为很多人施过洗，讲过道。在一次讲道之后，我在荒野上睡去，却发现突然没有了视觉，并不是单纯的黑或者暗，而是没有感觉，一点也没有。但我坚信祂会来拯救我，有一天，我遇到了一个预言者，他预言我将在一口甘泉中找回自己的视力。后来我打听了很久，然后有一个给我传道的异乡人与我说，在他的故乡有个传说，所罗门曾经开出了一方泉，那泉水可以医治人的残缺。我第一次去那井口时，花光了我所有的积蓄。我站在古井的旁边，却得不到甘泉，我让原先引着我走路的人来帮我，那人说泉水已经枯竭了。”约翰讲述着自己的故事，叹息着走进牢房的门。 “我只能相信预言，但每一次去，我都只能感受到不甘和不公。为什么那些恶的人可以拥有健全的身体，不可计量的财富，甚至高不可攀的王位？我并不觊觎它们，我只是很好奇，为什么应当得到的得不到，而不应得到的人却占据着所有。”他席地而坐，奈拉比斯静静地在他的身旁坐下聆听。 “我开始发现自己对祂的信仰发生了动摇，于是我对我自己讲道，神行事有自己的法则。我依旧每一年都去那泉水旁看看，久而久之，我快要忘了视觉是什么了，但在我的脑海里，它是一块墓碑的形状，将来我将要带着一切的希望和失望葬在那里。” “直到我最后一次来到那泉水旁，祂让祂的孩子现身，用泉水洗净我的双眼。我看见指向伯利恒的明星，从它的光耀中看见无数人的命运。奈拉比斯啊，要相信祂是善的，因为祂从来只给予，不掠夺。”约翰的双眼散发出光芒，仿佛他的双眼能够透过石堡和时空的屏障，看见数十年前明亮的伯利恒之星。“孩子，你终将摆脱你的过去，渡过这条河川。” “我不知道，或许你是对的，但又或许我是对的，我一直活在悲惨的境地中。”队长淡淡地说道，“希律·安提帕即位那年，我父亲告诉已经年长的我，我父亲本打算在战争开始时开城投降，以此减少伤亡。但是我敬爱的兄长在得知战争即将来临的时候，瞒着我们带着一支军队到了国境。” “希律的军队被他击溃，我的哥哥恢复了理性，带着凯旋归来的军队回到了国都。人们都欢迎他，将他当作英雄，庆祝他的胜利。但是罗马的军团没过多久就到了，希律带着他们将城市付之一炬，并将许多男女带到他的王国做奴隶。我的兄长自杀了，我的父亲被驱逐到了遥远的东方。而我，希律看中了我，他让我认他为父亲。” “为什么？”约翰的语气中并不展现困惑与不解，但这句疑问几乎是在队长话音刚落时就说出了。 “因为他知道自己不可能有儿子，他年轻时候的荒淫无度让他在青春散尽之后失去了能力。那天，他站在曾是我的国民的奴隶的背脊上，让我做他的儿子。但我拒绝了，我知道我可能会死，但是我做不到改易我的姓名，做完全的另一个人。我的父亲和我的兄长离开了我，我是这家族最后的延伸，尽管如此，我仍然做不到苟活。” “但希律并没有展现出我预想中的愤怒，也没有让我死，他让我跟他到他的王国，做他卫队的队长。我便在卫队中和那些比我年长一倍的我的下属们一起过着平静的生活，我试图忘掉过去。直到有一天，希律让我到厅堂来，让我拜见他的新王后希罗底和公主殿下。”他并没有停下，而是继续讲了下去。 “那次是我人生中，第一次看见莎乐美殿下，我用言语无法描述她有多么雍容华贵，有多么倾国倾城，我相信无论是在过往的叙利亚王国还是在当下的犹太王国，都不会有比她更美丽或可爱的女人。应该说，我那时沉浸在过往太多了，我忘却我其实已经成年了，忘却了我这样流离失所的人还有爱的可能。但我突然又想起来了，是她提醒了我，我已经渴盼成熟了。” “于是我趁希律和希罗底离开去罗马时，在一天的夜里便来到她的房间里，向她求爱，不顾一切，言辞非常的露骨，因为我完全不知道爱是什么，我也相信，或者说我也愿意去相信这个久居深闺的美丽女孩也不知道爱是什么。并且她可以教会我，我也可以教会她。于是我怯懦地对她说，我爱她。我没有说原因，我没有说其他任何东西。她并没有像我预想一样的害怕，相反，她笑了起来。” 他能回忆起那是一个寂静的夜晚，宾客们都离开了，希律王与王后也离开了，卫队的队员们都已经入睡。他推开白玉的房门，公主正坐在床上，一丝不挂。 “奈拉比斯，奈拉比斯。”在听完卫队长的告白后，公主仍然止不住地笑，“在这一块，你还是太单纯了些。要我说，你为你自己选的情敌有点可怕，为了你的小命，你还是不要与他争抢我。” “情敌？他是谁？”奈拉比斯跪倒在地，用叙利亚人深情的双眼看向在月光下如同被冰霜覆盖的高洁的公主，仿佛白玉大门内的房间与尘世绝缘，她美的仿佛上天派来拯救他的天使。 “希律·安提帕，我的父亲，你的王上。”莎乐美微微一笑，说了出口。 “怎么会？怎么可能？他可是你的父亲啊！就算……无论如何，他作为一国之君，干不出这种事吧。”奈拉比斯难以置信，他仍旧看着她的眼睛，却感觉有些迷离，总感觉自己丢失了什么东西，仿佛一切事物都无比清晰，但自己却看不透。有一层看不见的雾，挡住了自己看见显而易见的真相。 “我的母亲，希罗底，是原先他兄弟——也就是我生父的妻子。你还以为他干不出来这种事情吗？照我说，他可真是个乱伦的惯犯呢。”奈拉比斯依旧大惊失色，不知该做什么，在公主的大笑中跑出了房间。后来他还是没有放弃与她的单方面恋情，二人逐渐熟悉，但离生情还差很远。 “奈拉比斯？你以后真该少来些，母亲已经……”莎乐美打开房门，却是母亲希罗底从父亲的厅堂走了下来。莎乐美怔了一下，走向了窗畔，希罗底让周围的守卫退散，关上了房门。 “现在你的母亲遇上一个难题了。”希罗底轻轻地说，像对死人说话一样，“那个施洗者约翰，他说我与你父亲的婚姻是乱伦，还诅咒我必定与丈夫早死，我想要让他先去死。但希律这个废物太软弱了，他不敢杀了这个约翰。” “我明白了，母亲。我会帮你的，请告诉我该怎么做。”听到“杀”这个字眼，莎乐美的心微微振颤了一下；尽管如此，她嘴尖的词句犹能跳脱出来，如同一个经过排练的演员。 “你只需要做一件很简单的事情。你的父亲今晚会在宫内宴请罗马的贵客，他们必定会点名看你跳舞，毕竟希律吹嘘过你的舞蹈很多次了。而你要向他要求一个礼物，他自然会答应你，舞毕再告诉他，你要施洗者约翰的头颅。这样他在宾客的见证下，他就不得不兑现承诺。这样的话，羞辱你母亲的伪先知就会为他的言论付出代价。”希罗底将计划全盘托出。 “好的，我明白了。母亲。”莎乐美望向远方的天空，思考着自己为何总是在被操纵中，干着不情不愿的事情。仿佛从出生起，她就时刻是父亲与母亲的谈资、笑料和棋子。而他们如果想要，也可以随时背叛她，就像她的母亲背叛她的生父一样，就像她的父亲背叛他的兄长一样。仿佛她那傲人的美貌也不是她的，而是属于父亲和母亲口中的，而是属于王国的，甚至是属于来自遥远的罗马的贵人们的，但不会是被锁在闺阁中的自己的。她究竟是谁？她忽然想起约翰，想起他那冰清玉洁的皮肤，想起他那可以预言事物的双眼——不，她从未见到过那双眼，所以与其说是“想起”，不如说是“想象”，少女幻想着他从荒野走来，沾染着荒草和野花的气息，论述着不为庸俗者们接受的出世的学说，在清澈的约旦河边给人们施洗。 不知不觉在思考中，她仿佛爱上了约翰，她和队长一样，都对爱没有哪怕一点的认知。过早的成熟和宫廷的约束让她失去了学会真正的爱的机会。她爱约翰，但她实际上爱的是约翰代表的自由。是啊，约翰可以看穿命运，不会被任何人利用，不像自己，被丢到各种环境中，对于未来一无所知。事实上，在这个世界上，每个人都是与他人彼此掣肘着的社会的一部分，国王也一样，王女也一样，并没有什么差别。但像约翰这样的人则不同，他可以完全的脱离这个令她作呕的社会孤立生存，只做自己认为正确的事情。想到这里时，她决定在那一刻到来之前，要见一见约翰。 “你觉得他的预言是准确的，奈拉比斯？”希律王用自己那涣散的眼神看向跪在厅堂门前的奈拉比斯，在面临真相的时刻，他其实很平静，“那你觉得我应该做什么呢？” “我想到一种可能，或许能够帮陛下逃避死亡。陛下可以让约翰帮你预言死亡的方式，通过这个信息来规避死亡。虽然不一定能避过很久，但值得一试。”奈拉比斯还是跪着，他的头颅沉入厅堂内深邃的阴影之中。 “你可真是替我着想啊，我的队长。能向我提出这样的建议，也很有勇气。我会接见他，然后将他释放，但今天不行，他已经沾染了牢狱的气味，不能让晚上将至的罗马的贵客们在我的厅堂内闻到这种气味。这是待客的基本礼节，奈拉比斯，作为我的……，反正你迟早要学到。”希律王淡淡地说道，抚摸着墙壁的细节与纹路，突然仿佛想到了什么，仿佛听到了死神召唤他的声音，他的灵魂和身体开始震颤起来，“对了，奈拉比斯。” “王上有什么话要对我说？”奈拉比斯正要走，去见狱中的约翰，他便回过头去看，看见了那挣扎着的君王，“陛下这是怎么了？” “我在想，如果有一个人，他很年轻，不分善恶，在那时候掌握了莫大的权力，干了一些荒谬罪恶的事情。但在后来意识到是错的时候，忏悔与禁欲，几乎过着苦修者的生活，也用痛苦的无意义的思考来惩罚自己。这样的人可以被原谅吗？或者说，这样的人可以得到拯救吗？”希律王用长长的指甲刻着墙上的纹路，疯狂地画着三角形，他想要进去，好像一个无限小的空间可以让他暂时摆脱他自己对自己道德的审判。 “王上啊，我并不知道。我只知道，当一个人想要祈求他人的原谅之时，所祈求的那个人，若是活着，事情会好办一些。”奈拉比斯看着希律王那焦虑不安的样子，不禁也流出汗来。 “你走吧，奈拉比斯。谢谢你的答复，谢谢你的建议……”希律王走回一旁的椅子旁，重新坐上。奈拉比斯带上了门，挡住了从外界渗透过来的即将落下的夕阳的最后一丝余晖。 “你来这里做什么，耶洗别的女儿？”莎乐美打开了约翰牢狱的门，而约翰并不看她和她身后射来的阳光。他在想他唯一困惑的一件事情，一个他命中注定但又不可能达到的事情。 “我来看你，因为我害怕以后再也见不到了。”莎乐美尝试用手触碰约翰的脸，但约翰迅速地避开，“我的母亲要借我和我父亲的手杀你，只因你的话语，在她眼里是最大的侮辱。” “杀我？但这又与你有什么关系？你若只是想与我说这个，就请走，就不要用你的手触碰我，你所追求的，我这里并没有；我所想要的，你也不能赐予我。我与你们许多人就像走在天宇十字路上的两颗繁星，唯有短暂的交错，不得有太多因果。你若是想要有人恕了你的罪，你就到加利利去，那有一位在我以后来的，能力比我更大，我就是弯腰为他解鞋带也不配。你就祈求他的宽恕。”约翰突然站起来，将莎乐美逼向门口，从黑暗中的模糊到靠近牢门时的清晰，约翰的面孔逐渐从幻想和影子的混合变为现实，莎乐美目不转睛地看着这个形销骨立的男人，越来越沉浸于其中，他的眼睛闪着光芒，仿佛里面有一颗星星一样。 忽然约翰的身子疲软了下来，就好像一个猎人，终结了数日的围猎。他不理解为何命运的安排如此诡异，他不敢再看未来，他将双眼闭上，将莎乐美推出了牢狱，关上了牢门。刚刚约翰看着伯利恒之星，看见了一个关于死去世界的梦，他很想要告诉她，命运决定她去不了任何地方，她很快就会死。但冥冥之中，有着什么东西，在阻止他开口。 “我会拥有你的，约翰。只因为这世界上只有你配的上我，所以我一定要将你占有。”莎乐美说着，走离了牢狱。她几乎刚走，奈拉比斯就走进了门。 “她没有注意到我，我听到了你们俩刚在说什么。希律王会保你周全的，我与他说过话了，你很快就会被释放，只要你为他做死状的预言。”奈拉比斯向约翰说，语气中隐隐的含着一丝落寞，约翰听到有羽翼拍打的声音从四面八方传来。 “他们要来了，在此之前，我做了两个对自己的预言，奈拉比斯。我这一生从来没有遇到过这样的预言，靠近点，让我讲给你听。”约翰仿佛在莎乐美离开后的某一瞬间变得尤其虚弱了一般，他让奈拉比斯靠近他。奈拉比斯见过很多将死之人，他的直觉告诉他，约翰非常虚弱。 “这么说吧，一个告诉我，我将会千年不死；还有一个告诉我，我将会在今天晚上被希罗底的刽子手杀害。”约翰摊开手，虚弱地指向门口，“我也觉得不可思议，两次占卜的结果竟然会如此冲突，看来是命运有意让我无法看穿这一切了。真相快要到来了，你千万不要为之辗转难眠。你的命运已经注定，而我的命运快要迎来终结，最终我们都会因此得到幸福，这是你过往以为你永远得不到的东西。所以你……释怀吧，不必为了我的性命奔走了，等到命运到来的时刻，你自然会懂得。宴会要开始了，你上去吧。我不知在我生命的最后该说什么才好，除了这些以外，就只剩下沉默吧。” 在施洗者的注视下，奈拉比斯推开狱门，走向即将落下的太阳的余晖。约翰蜷缩在没有光的角落里，他感到前所未有的清醒，他没有听错，刚刚是死亡天使在外面拍打着翅膀，他是来带走自己的。那看来，果然第二个预言是对的，自己在死前意识到的最后一件事，或许是自己技艺不精。他突然觉得他的命运有一种诡异的幽默感，于是开始从容地笑了起来。 在这象征着犹太王国权利的宫殿里，希律王还是身穿不合身的王袍，希罗底还是扮演着王后的角色，莎乐美也身穿着节日的盛装，他们与卫队欢迎来自罗马的姗姗来迟的客人们，尽管客人们注意到了，几乎在这宫中所有人的脸色都很苍白，仿佛被某种疾病缠身。宴会很快就开始了，莎乐美坐在她的父亲旁边，坐在高台上，对于食物、饮料、宾客和他们带来的奇珍异宝几乎没有什么兴趣。 她在想她究竟是爱他的肉体，还是爱他的灵魂？如果将他杀了，自己还能够拥有什么？自己还能够拥有他吗？她所不知道的是，她的母亲已经下令让刽子手们提前杀死约翰，她的选择无关紧要。 坐在下方的奈拉比斯仰起头看向她的眼睛，他多么希望她能够看他一眼，哪怕只是蕴含着那少女千丝万缕温柔的一眼，都足以让他放下约翰的预言中，他前去罗马所能够得到的幸福。哪怕这份爱有多么危险，他都敢于去尝试，或许他一直知道公主不爱自己，或许这是事实。可是她的心中只有约翰，她眼中唯一与她一样冰清玉洁的约翰。此时奈拉比斯落下了眼泪，他不知道还要多久才能完全释怀，但或许开端就是现在。只有早些放弃不属于自己的，才有可能到达命中注定的幸福。 “希律陛下经常提起的莎乐美小姐，今晚在吗？”一位凯撒的大臣在宴会进行到一半时打破了良久的沉默。 “当然在，当然。”希律拿起金杯，喝了不知多少杯酒，几近要连自己究竟是醉是醒也不知道了。 “久仰大名了，公主的美名在整个大陆都已经无人不知无人不晓了，我们听说公主殿下会跳一种七层面纱之舞，”大臣对莎乐美说着话，却看向希罗底，希罗底微微点头，打着手势，他便接着说下去，“不如今晚为大家助助兴，不知殿下意下如何？” “好，我替她答应了。莎乐美，你尽管跳吧。按照惯例，你可以向我讨一个你自己喜欢的礼物，只要是我所能给你的，我都给你，就算你要我国土的一半我都给你。”红酒数杯已尽，希律王的面色也变得红润了，站起身来，走到莎乐美背后。 “好的，我明白了，父亲。”莎乐美走到月光之下，跳起了七层面纱之舞，她还在想约翰的生死，所以她那宵暗的眼神显得相当空洞，如果仔细看，你能发现，在七层面纱下，她的身体在月光下有时仿佛游散着一样，有时又像是希腊的女神雕像一般充满线条。她是一种天生的诱惑。奈拉比斯看向酒杯，却发现酒杯里也仿佛倒映着她的影子，或许她已经顺着月光映入了每个人的杯中，给美酒赋予甘醇。 行刑人来了右手执着斧子，左手执着银盘，约翰从容笔直地站着，此刻他听不见死亡天使的声音，他在想他去哪儿了，难道他并不是来把自己带走的？ “跳得真不错啊！那么，我亲爱的女儿啊，你想要什么呢？我现在就兑现承诺，将礼物送给你。”全场为她喝彩，希律王非常得意地看向莎乐美那空洞无神的眼睛。 “我要约翰的头！”希罗底几乎快要替自己的女儿说出来，她已经提前告诉了她女儿一定要这么做，不可能会有错的，她比任何一个时刻都要愉悦，因为她即将品尝到复仇的滋味。 “我不知道我要什么，我不知道，我什么都不知道！”莎乐美几乎要哭出来，痛苦地说道。 “希罗底，这就是你的女儿啊，希罗底！你们听听，在这厅堂之上，还能有比这更富有哲理和智慧的答案吗？我亲爱的宾客们啊，恐怕是你们，也恐怕给不出更好的答案了吧。”希律王哈哈大笑，其他人都感到惊恐，他们面面相觑，不知道该说什么。希罗底悄悄唤来侍卫，让他们将莎乐美带回阁。 “给不出了，给不出了，我亲爱的陛下。”大臣害怕地看向希罗底，而希罗底的眼神却出乎他意料的平静，甚至带有一丝玩味和高兴。 “我曾经是个瞎子，我给人们讲道，在约旦河边。有一天有个人问我，真的有天堂吗？然后我说自然有，然后他就花钱找了一位不信教的屠夫，把他杀死了。那段时间，我一直很热爱做梦，因为我可以在梦里幻想我还有视觉的日子，直到那天，我意识到，梦也可以是很可怕的。我梦到他死了，他的灵魂不说话，只是不停地哭，我闻见那眼泪里有铁锈味，简直不知道是血液还是眼泪。我请人把我送到他家，却发现府里正在给他办葬礼。人们都在为他流泪，在那时，我突然想到——” 或许追求生时的幸福，要比追逐死后的极乐，多多少少更善一些。 他没来得及说完，他的头颅便已经落地。行刑人走上台阶，将带血的头颅，用银盘呈上。希罗底露出了笑容，仿佛这颗头颅是一种祥兆。而希律王的面色，则变得煞白，又在辨认出那头颅的所有人的时刻变得铁青。美酒带来的短暂的青春的感受，如今已经逐渐散去，皱纹像标记着他死期的刻痕一样，逐渐地从看不见的角落又一次爬上来。 Act 3 Crusade for the Promised Land“所以后来又发生了什么？王子先生？你又是如何到达罗马的呢？”德鲁苏斯的语气略为轻佻，当然那份轻佻也已经受了抑制，毕竟他的内心也有对这个异乡人饮酒本领的敬重在。这位在酒后自称来自叙利亚的王储的人的衣着并不光鲜，话多的也不像罗马人，而且他甚至不知道什么是农神节。但他的故事，确实比不少吟游诗人讲过的史诗还有意思，他想再继续听听。毕竟他知道，听起来越耸人听闻的事情，越可信，因为人类是无法编造出完全处于自己认知之外的东西的。 “希律王陷入了前所未有的暴怒和绝望，仿佛他逃脱死亡的希望在一瞬间出现又迅速破灭了，像被蛇含在嘴里，还能勉强看见外面的景色的的青蛙一般无助。他将希罗底关在‘深洞’里，据说那房间有一些他用于冥想的图画，外人是不让进的。我在那之后也只进去过两次。第一次是去送饭，她第一次对我说了一声，‘谢谢’。” 墙上刻满了蛇，以自身的首咬着对方的尾，像是一个循环。和他数日后第二次进入时，希罗底尸体的姿势一样，他依稀还能想起，她似乎强行扭断了颈椎来达成一个看上去近乎完美的圆。在尸体的外围，用血重复描绘着墙上的符号和图像。 ”只有有所原因的事，才会发生。对于有些事情来说，开始就是终结，终结就是开始。“这是卫兵转告给他的，王后的遗言。转达了这些话之后，卫兵们什么也不说，只是摆出了一副最板正的架势，将枯萎的金枝玉叶置在铜棺中，搬向沙城之外，走向更加荒芜的墓园。 走在他和约翰来时的道上，奈拉比斯忽然回神，看向那鲜花，好像它枯萎了一样。但它仍然还是开放着，绚烂地开放着，并不随晴雨而变，更不随人而变。人们只是想当然的，用自己的思维，去以为很多事物罢了，与其说是以为，倒不如说是希望。希望花能共情人，为逝者凋落；希望天能不下雨，少一点麻烦……这些事都不会发生。 “好了。”奈拉比斯看着卫兵们将铜棺埋在沙中，隐隐的望见远方的城堡，结构和线条都不甚明晰。本可以百般不同的灰色，被夕阳垂来的光映衬为相同的黑。 在约翰的眼里，这座富丽堂皇的城堡是不是也像视线尽头的几个黑点呢？在他的眼中，是否一切华美绚丽的宫殿都只不过是历史上无足轻重的小小的石头堆呢？他知晓很多未来的事物，知晓“命运”，是否因此，对他来说，一切的行为都是无意义的，哪怕是他自己的预言，哪怕是王后为了杀死他而作的如此多阴谋？ 他突然生出一丝希望来，既然他对于自己死亡的预言是准确的，那会不会，他也能像预言里所说的那样活上千年？他想起约翰的头颅被装在银盘里端上来时，他的眼睛仿佛看着所有人，仿佛带着一种威严在审判，但这并不是属于约翰的威严，而是属于逝者的威严，他后来才明白那种宽泛也只不过是尸身上瞳孔的涣散而已。当他将施洗者的双眼合上时，那种威严融在了风里，那种被注视的感觉仿佛在一瞬间消逝了，他只感到孤独。石堆横塞于黄沙之上，如果没有人来的话，很快就被湮没在荒茫中了；自己的父母可能正是如此地被掩埋了，整座城市的人也被杀尽了。自己被带走的那天，罗马人的马蹄将道路染成了血河，大地的裂缝中，还传来哀鸣，他现在仿佛还能听到。 奈拉比斯一行人待在冢前，快要看见月亮升起来，他幻想着沙漠的样子，想着沙漠将要像湖面一样在风拂过之后无限次回归水平，又将要再无限次回归为起伏的波形，他想着湖面上，倒映着皎洁的月光的样子，想象着自己漂浮在水上，在光之中舞动。说到那光，月光其实不亮，其实一切在那时都是暗的，有种他想象中，创世前万事万物都还是朦胧不定那时候的样子，他看到女神的样子。为何总是女神呢？ 他不动不倚，任由波纹将自己推向不同的方向，他感到一切都还是灰色与青的混合，故乡的大海是青灰色的，故乡的天空是青灰色的，溺于影中的森林也是青灰色的，记忆和现在融合成了一种那个时代的人没有见过的，无论如何他也描述不了的青灰色。他感到那约翰身上曾经有过的涣散。 他们一行人走向希律的宫殿，到宫殿的时分世界已经没入宵暗。他感受到女神在抚摸他，这是他过去未曾感受过的，仿佛在提醒着他，他的行动已经并非完全意义上是他的思维所能够控制和理解的。确实，他并不能够理解，为什么眼前的石棺已然空空如也。 他离开了？是仪式提前举行了，他们将棺中的身躯挪走了？难不成是他复活了？奈拉比斯忽然兴奋起来，他不知道为什么，他总感觉既然约翰的最后的预言有可能是同时正确的，那自己未来的幸福，好像也有了保障一般，他感受到一种焦灼感，自己仿佛在蜕皮重生，他感到脱离了过去三向的引力，正在走向自己本应得到的应许之地。 “奈拉比斯！奈拉比斯！奈拉比斯！”希律王跪在台阶上喊着，打破了宫中的寂静，他的声音被风带到三角的每一个角落，奈拉比斯看向希律王，他从未见过希律如此憔悴的样子，已经与他在战场上见到的那些尸体不再有什么区别。 “我的陛下，你要我为你干什么？”他本可以对灭国仇人置之不理，但他还是将心中的善意说出了口。他究竟是在干什么？这究竟是不是属于自己命运的一部分，为什么他会这么心痛，为了一个毁了自己一切的可憎男人。 “我的女儿，我那侄女，我那情人，无论她对我来说是谁，她与她母亲一样背叛了我。她与约翰私奔了。我求你，若是你心中曾有一刻想要认我为你的父亲，就为了我去从莎乐美的手中，把约翰的遗体从她的手中夺回，延缓我命运的审判。我这空洞荒凉的一生中，伤害过许多人，但唯独对你，我是问心无愧的。我驱逐了你的父亲，但我愿意作为你的父亲；我率军夷平了你故乡的王国，但我也同样愿意继承给你一个更大更好的犹太王国。我请求你帮助我……帮帮我吧，在这种危难时刻，请不要放下你的怜悯之心，或许这就是结局，而迎来结局就是君王犯错的代价。”犹太人的国王跪了下来，皇冠掉在了地上。然后他听见奈拉比斯唤来卫队的武士，马蹄声向远方蔓延而去。 大漠苦涩的风间，卫兵们向着西方追赶着，奈拉比斯又一次在月光下看见那个充满线条的美丽胴体，只不过在他的眼中，更加像是一具尸体。美人带着注定不会属于她的那具遗体以一种美丽柔软而细弱的姿势逃离，在月光下像一个黑色的影子，又在无限地向冉冉升起的圆月靠近，她的行迹像一根黑色的线一样在牵引着月球向她靠近，赐予她更多的疯狂。 “若是仍心存迷惘，就不要掷出长枪。”奈拉比斯看着，右手摸向背后的长枪，但左手又将右手摁住，他还想多看她一眼，就只需要一眼就够了，此时他右眼突然瞟见一个诡异的身影，与其说是瞟见，不如说是一听到这声音，就想到了一个身影——一个他不熟悉、不认识但却知道的身影，他在某一瞬间出现在他身后，嘴里还念念有词。 “你……你又是谁？”奈拉比斯一边向着莎乐美逃离的方向加速，一边问道。不知不觉中，他把自己的坐骑加速到最快，将身后的卫兵们甩得更远。他想要与这个身影说话，但是它消失了，在消失前，奈拉比斯看见他的眼里闪烁着青白色的星光。 “约翰，约翰……于我而言，你究竟是什么呢？你是我对于自由的最后的想象，是我对于这污秽的人间的最后留念。我曾经在梦里无数次对你说过，我在这个世界上只爱你一人，我只爱你一个人……我渴慕着你的美；我饥求着你的肉；酒也好，果子也好，这个世界上的一切，除了你，不能满足我这种欲望。我现在如何是好呢，约翰？河水也好，海水也好，不能浇灭这种情热。我本是一个公主，你拒绝了我，将我推向远方。我本是一个处女，你把我心里的贞操夺去了。我本是很贞洁的，你把我的血脉里满点着情火。就连死亡也不能把我和你分开，因为爱情的神秘远远高于死亡的神秘，约翰。”莎乐美赤身裸体，一边亲吻着约翰的双唇一边说道。她疯了，几乎要将他的嘴唇咬下来，要将他吃掉，彻彻底底地占有已经不足以形容她的爱欲了，她想要将他吸收，想要他成为她的一部分。 奈拉比斯已经不知道自己在想什么，在最后的瞬间，他心烦意乱，在恍惚间松开左手，长枪从右手中飞出。他看见两具尸体倒在血泊里，头咬着尾，与她母亲去世的时候的不同之处在于她没有扭断自己的颈椎，而只不过以最舒畅的姿势弯曲着自己的肉身，和约翰形成一个完美的圆形，如同天上的圆月一般。他听见死亡天使拍打着羽翼，带走了公主污浊不堪的灵魂。他记得自己的父亲曾经在观月的时候告诉过自己，月亮的圆缺代表着疯狂的程度，而此刻它无比圆盈，血色满溢。 当卫士们赶来时，他们只看见奈拉比斯捧着莎乐美血肉模糊，已经看不清面孔的尸体，其上还插着一把淌着鲜血的长枪，而他将约翰的头颅和身躯置入了棕黄色的麻袋里，明月仍高悬着，苍茫的大漠处于明与暗之间，被大风扬起的沙尘，此刻像一层朦胧的白纱，像少女丧服上的点缀。奈拉比斯骑上自己的马，走上归程，马蹄将其下的大地沾染上血液，宛如一条干枯的血河，通向希律王的城堡，他想，他无必用预言与幻想对之多加描绘了，他将看见它，或者它将抵达他身旁。 于是在他再次睁开双眼之时，他看见宫殿地上血淋淋的十字和六角星，连结上自己血色的脚印，他感觉周围的一切似乎都有些过于不清，仿佛空间成了一块黏糊糊的液体，飘忽不定。他看见从空气中扭曲出几个红色的字，它们飘过眼前，都是Zagan，Vapula，Bathin，Zepar之类；他看见神婆们在绘着孔雀尾羽的马，被一只长着美女脸庞的公羊头咬着的蛇尾，猫头鹰翅膀，并且将他们用鲜血画出的几何图形合在一起，整个宫殿中充满着铁锈味。卫士们与仆从们都不敢说话，就连罗马的贵人们都选择保持沉默。 “陛下，”他将袋子中的遗体拿了出来，斑斑血痕犹注目，众人都吓得不敢吱声，他将它递给神婆们，他的声音带着颤抖，“我带着他的遗体回来了。” “奈拉比斯！我的好奈拉比斯！”老国王的声音也带着颤抖，他走下台阶，和奈拉比斯在月光下相拥在一起。但是奈拉比斯感受到的并不是他欲图带给自己的父爱，而是一种空洞虚无的感受，但他越是意识到希律欲求补偿，他的罪孽就显得越深刻。他无法同情希律寻求救赎的感情，他知道希律想要在自己身上找到一个更加圆满的家庭，一个更爱他的家人，但是自己并不是他所寻求的人，这点他究竟知不知道？不重要了。 “夜已经晚了。这几日的重负使我们无法同过往一样平静地活着，我现在只想要休息，只想要睡眠，哪怕我不会再次醒来……”奈拉比斯放开国王，走下台阶，将战马牵向马厩。 “那么，通灵者们，开始吧，让死去的圣人说话，让他回答君王的问题吧。”一个没有双眼，长着胡子的，看似是这群通灵者间的领导者的角色，从袋中拿出头颅，将其抛向宫殿的中央，仪式开始了。随着他们的吟唱，宫中的三角形的中央被割出一个个圆，一个为首的男子拿出一本黑色的厚书，纸页几近崭新，恶魔刚刚在上面写下了她的指示。 “我究竟会怎么死？何时？何地？又是何人要将我杀死？”他在心中想着，却还没有发出声来，因为他不敢。 神婆们的呼喊声盖过了远方的马蹄声，她们长着胡子，却发出女人的声音；在仪式中一个接一个倒下，用手握住上一个倒下的人的脚，同时血的符号和文字开始发光。恶魔们从血肉的绘图中的肉体间显现，头颅飞起来，接上他们虚假的肉体。逐渐地，头颅上生出了三具面孔，一具是被抹去的形形色色的人的面孔，另一具是二度降临时分圣子的面孔，还有一张是属于恶魔的面孔，但都是女性的面孔；恶魔看向希律王，正尖声笑着。 “我的父亲！我的情人！我的叔父！被称作希律王的那个，你究竟是谁？你让奈拉比斯杀了我，又在这里用我的头颅召唤我，你究竟想问我什么呢？我的体内并不流着你的血，但我是你女儿；我的母亲是你那乱伦的妻子，而你是我的情人；我是你王国的公主，却被你的卫士杀害。你不觉得这命运的安排很有趣吗，特别是让我与你，在现在对话？你用三具面孔戕害我，而我现在也用三具面孔面对你。” “停下！都停下！那不是我们要找的那个……那个约翰！奈拉比斯背叛了我们，他用莎乐美的头调包了！”从彷徨与不知所措中苏醒，希律王发出了怒吼，但没有人能听得见，其他人看到的，都是他在与头颅无声地沟通，而谁也不敢上去阻拦。 “对你的原谅将会来自于神，但祂不会到来；对你的救赎将来自于他人，他们却被你杀害。但我来到此地，就是为了给你带来我想要带给你的复仇。我在想，为什么我总是你的困兽，现在答案明显多了，你自己也被困于囚笼之中，你困在过去里，困在内心的挣扎里，困在罪恶的循环里。直到死亡，你的罪恶与苦难才会画上一个休止符。”莎乐美的身躯正在缓缓消散，希律以为这就是解脱的信号，仪式就要结束了。 就在希律王即将踏出仪式的结界之时，莎乐美消散的血肉却如同针一样扎进希律王的灵魂里，但另外的人，却什么也看不见。他们只能听见不知为何，希律王在大笑。罗马的大臣认为他与约翰的灵魂交谈之后疯了，而神婆们也不敢将真相告诉他们，他们赶在月色还未消弭殆尽，逃出了石殿。 “在他人的眼中，你的哭泣将变成嘲笑，你的笑容将变成愤怒，你的灵魂将永远被穿刺折磨，即使到了地狱也一样。晚安，我亲爱的父亲，做个好梦。”莎乐美在完全消散之前如此说道。 “唔~嗯，呵，呵呵，我明白了！奈拉比斯，我感谢你，直到永恒的尽头。”从喉咙中吐出一口浓稠的血，他蜷缩在宫殿的角落；他用手试图拔下插在自己头上的肉刺，又摊开双手，看自己的手血肉模糊，在自己的影子里开怀大笑着，直到黎明女神缓步赶到，驱散黑夜，而死亡天使紧随她的步伐。很快，他的生命伴大漠的晨雾消弭在了风中。 罗马的话，或许一路向西就能够到达。他看见远方的一队人马到来，说不准是追兵。但他仔细一看，领头的那位戴着阿拉伯头巾，他于是放下了长枪，调转马头走向那位领头的人，问他们要去哪儿。 领头的人非常的世故，显现出与年轻的外表不相符的老练，脸上堆满了笑容，说他们是一支商队，要将一批货物送去罗马城。奈拉比斯询问自己能否随他们一起去罗马，领头者说自然可以，但是他仍然建议将尸体袋中的遗体就地处理，否则腐烂之后，很难不被发现，到那时就不好办了。但当奈拉比斯拿出一袋金币时，领头者点点头默许了他加入行列中去。 “所以现在你把约翰的遗体埋葬了没有？”那个罗马人听完他的故事之后，情绪不知应当如何，他想要为他最终得到的幸福感到欢喜，但却又只能为了他命运的波折而叹息。 “没有。”奈拉比斯说，”我总感觉约翰某一日会活过来，因为他所有的预言都实现了。他对我来说究竟是什么样的存在呢？他是我的朋友吗？还是说一个导师呢？我与他只相处了一日，究竟存不存在真正的友情呢？”他再一次变回了他故事里那个忧郁的王子，与罗马的狂欢节格格不入。 “我想到了一个地方，可以永久存放这具遗体。” “请说吧。” 那延绵不断的线如同没有尽头，仿佛永远不会消亡的哈德良长城。走出罗马城墙上那唯一看不见的房间，回到现实世界中无尽的湿涩中去，在他关上门的那一刻，他猛地想起德鲁苏斯曾说过，若是不记得这扇门的位置，这扇门是永远不会被任何人找到的。他回过头去看，门已经不见了，彻底地不见了。 在瓢泼大雨中，他意识到，在最终，命运对所有人都是平等的，这可能是他唯一的宽慰了。但从远方吹来的风中，他仿佛又一次听见施洗者约翰缓缓道来的预言。那是破碎的影子，在战争中毫无意义的废墟中飘荡，而他从冥界走来，用千年的生命和不朽的语言治愈万物的创伤，正如他治愈自己的苦痛，给予了自己一个崭新的未来一样。 在彻底忘却那扇门的位置前，他还是想伫立在城墙前，最后再问一句，预言的结果如何。紧接着，那天自己在马背上看见的那星光中，跳脱出的那一个个影子，又一次在自己的眼前浮现。但只有剪影，没有声音，不，还是有的。然后他合上双眼，听见落雨，听见风声。 Original Soundtrack サーカスレヴァリエ - ZUN The Furious for Mike - JUSF周存 牛に引かれて善光寺参り - ZUN Afterwords 被牛引到善光寺对于这个故事的构思，在我第一次阅读王尔德的《莎乐美》时就开始了。我非常喜欢那个故事，读完之后我就开始想能不能将它写成小说。我看到了奈拉比斯这个角色的一些潜质，他在剧中表现不多的潜质；不过主要的原因可能还是因为《莎乐美》的主角是莎乐美，而我的主角是约翰和奈拉比斯。我其实想对王老说一句道歉：毕竟作为后来居下的同人写手，我对于莎乐美的人物塑造其实非常单薄，主要是因为我塑造女性角色的能力很弱（说实在的，我塑造男性也很弱）。 这篇文其实后来看，有不少弱点，第一就是前面说过的人物扁平，第二就是托福作文一般的长难句。后者其实可以规避，只是当时写上头了，然后自己读了一遍发现读都读不通顺的句子都不少。其实也挺丢人的，不敢相信它能得到身边人的较高评价。大概这些恭维都应归给我剽窃自《圣经》和《莎乐美》的经典故事线，建议所有喜欢这篇文的人都去读读《莎乐美》。 关于“原声带”的话，一周年后我改了一些，第一首是ZUN的“马戏团回忆”（Circus Reverie），出自我最喜欢的专辑之一《蓬莱人形》。选用的主要原因是“未来往昔”的大部分内容都在阐释二人黯淡的过去，情感在其中不断叠加。很快，到了“天行秘道”，所有角色的矛盾都出现了，约翰好像死了，而死亡天使也到来了，莎乐美崩溃了，而希律王的疯狂也到达了它的极点，将他引向了灭亡。此时“The Furious for Mike”的激化感就非常地有效，可惜我的文笔写不出来。而在第三部分，“驶向应许之地”（有一个版本是“风中消散”）中，虽然冲突更加激烈了，但一切都早已悄然归于平静了。所以“被牛引到善光寺”作为第三部分的背景音，其似叹似喜的曲调符合奈拉比斯为自己的新生感到的喜悦，夹杂着约翰死去给她带来的悲伤。而善光寺是死者灵魂聚集之地（与第三幕的结尾吻合），我想起小泉八云曾在《陌生日本的一瞥》中写到过： “据说所有死去的人，在踏上冥途之前，先要去长野县信浓国的佛教寺庙–善光寺参拜。有人说，每当那座寺庙的和尚开始念经，总能够看见众多灵魂，聚集在正殿聆听和尚讲道，他们头上都缠着一块白布。昏厥的人临死前所见到的，或许正是那座善光寺，但我不敢确定。” 除此之外，“被牛引到善光寺”本身就是一个典故，相传观音菩萨曾经化为牛身，将毫无信仰心的老妇人引导到善光寺（日本最早的秘佛所在地），并传授给她信仰心的故事。谚语有云「他人的劝诱与意想不到的偶然，能引导到善缘」。这其实与约翰对奈拉比斯的引导是类似的。很有趣的是，约翰这个名字和牛有非常强的相关性，不过我对约翰牛可没有什么好感；说实在的，我的祖国除外，我对国家这个概念都没有好感。 第二卷《正直者之死》已经坑了一年多了，不是吗？我能不能把它写出来，我自己心里都还没个底。在《明治十七》里我找到了我的相对舒适区——小品式的短篇小说，不超过一万字，通俗易懂，主要看个乐子。但是我和一些笔友认为创作《妄谈》这样的作品更有价值，我可以通过足够绵延的文字展现我的世界观，至于我的世界观究竟有没有足够的必要用这么大力气展示，那就见仁见智了。《正直者之死》已经写了四千多字了，而我目前还没有想好怎么把它写得稍微能看那么一点，我的目标是，它既然顶着这个名头，就起码要和这部作品差不多。这无疑是一个挑战。 值得一试，不是吗？ Revisited on 2024/11/20","link":"/01/AnswerInTheWind.html"},{"title":"阿卡迪亚的牧羊人","text":"“列车到站了，先生，欢迎来到阿卡迪亚。”乘务员走进包厢，向詹森·汉弗莱鞠了一躬。 汉弗莱转向乘务员，她注意到他的眼角微微湿润，便掏出了一块手帕递给他。 “发生了什么事吗，先生？” “没什么，我有时庸人自扰，徒增伤感而已。” “这于我们都是常有的事。先生，那我便不打扰了。” “等等，你的手帕还在……” “那不必还我了，先生。” 汉弗莱搬下箱子，走出列车，稍稍看了眼手帕，纯白色的布上纹着时兴的一种粉色花体字，有“大道”之类的字样，大抵是姑娘的住址。若是在五年前，这姑娘的成功率还大些，对于现在的自己，这套招术已经不管用了。不过他仍将手帕收进了衣兜中，奔向探出头来的少女友好地招了招手，然后缓缓地走向出站口。 今天是十一月七日，伦敦在下雨，东京都在下雨，阿卡迪亚也在下雨，对于出身科罗拉多的汉弗莱来说，被十一月的冷雨击打的经验并不多，他可能也并不因此有什么感受。他行走在这个快要空掉的小镇，这个在街上看不见行人的小镇，远远地，他看见远方犹有几家店，灯颤着亮着。他便什么也不想径直走过去。圆木，电线杆，黑色的怪鸟，青红色混杂的草地，长着灰黑色枯死藤蔓的风车，脱漆变形结有小水珠的门把手，透过触感，他意识到那是铜制的，然后他打开门。 他本想将湿透的黑色礼帽挂在门口的衣帽架上，但当他发现其上全是积灰时，最终还是未摘下。湿到发软的帽子甚至显得有些可笑，像门口的把手一样变形。屋里倒却是开着灯，这里有人吗？他立刻开口问道，一个老人立刻走了出来。穿得有些松松垮垮，端着个油光发亮的餐盘，衣服上是蓝色与白色的条纹，蓝色的眼睛印着枯黄的灯光，端详着远道而来，风尘仆仆的客人。 “咖啡还是黑麦威士忌？”老人将餐盘摆到一张较近的桌子上。 “咖啡吧。”他不太想喝酒，特别是在这种时候。“对了，你知道那个‘牧羊人’吗？” 几瞬间，那蓝色的双眼仿佛短暂地变得年轻了起来，嘴唇翻来覆去好像要说什么，但老人还是冷却了自己的激情：“你是为了这事而来的？怪不得你会在这个时候到这里。” “这个时候？难道今天发生了什么事？”汉弗莱看向老人，低头闻了闻咖啡的味道，他能闻出它价格不菲。但这与这家店简陋破旧的风格完全不搭，浮在表面的泡沫在灯光的忽闪下也射出光。 “一年前的十一月七日，阿卡迪亚的牧羊人卧轨自杀了，人们发现他的尸体时是中午，那天孩子们都回来了，从上海，从米兰，从巴黎…他们都为他哭了，哪怕他是自杀的，甚至身上连件衣服都没有——老样子。死的那天还下着雨。他们都穿着像影子一样的黑色西装，像你一样。自那以后他们就回来得少了，信也少了，就算有也是劝我们和他们一起县城里过日子，他们的孩子都很想我之类。先生大概是个记者吧，不然这样的故事也不会有人好奇，要专门来一趟搞明白。不过这趟旅程恐怕住定是个赔本买卖，现在大家不爱看这种东西了，先生大抵是赚不了多少稿费的。”汉弗莱的表情却僵住了，他不知道该如何为此表达悲伤，或许他来到此地就是为了学会。 死了？所以那天他所想表达的原来是死亡的宣言吗？汉弗莱盯着眼前的玻璃杯，忽然发现帽檐上的水珠落入杯中时，一点点波纹散开；而当波纹回到圆心之时，唯余完全的平静，原先的痕迹，是无论如何也寻不见了。这个谜团可能自己一生也解不开了，但或许一切在列车上都已经明了，只是自己还没有揭开那早已显现的谜底而已，于是他看着金色的飞沫，想象它们是一个个车厢，雕刻出一个个包间，自己坐在其中的一个里面。自己在干什么来着？对了，在读报纸，是《泰晤士报》，然后那个年轻人差不多走走了进来，问我：“先生，十分抱歉，座位被抢完了。我可以与您一起坐吗？” “自然…可以。”汉弗莱放下了报纸，打量了一眼眼前的年轻人。他的皮肤很白，又高又瘦。黑发蓝眼，戴着副眼镜，穿着一身蹩脚的米色西装，袖子与裤腿明显地短了。他还背着个包，拎着个箱子，像是个学生。他不知有带雨伞没有，因为下着大雨，他的衣服却不算太湿，但又似乎没有带，毕竟没有拿着，也无处置放。他似乎有口音，但无从判断，毕竟只说了一句话。 二人看着彼此，汉弗莱不知为何有些想与这个年轻人说话，但又寻不着话茬，于是他缓缓开口：“今天天气……”他才意识到自己的愚蠢，若是开口便是“今日天气不佳”，比沉默更加令人尴尬。 “不佳吗？我们阿卡迪亚是这样的。”年轻人平淡地接上了话。他松了口气，于是继续说。 “所以这么说来，你是本地人咯？”汉弗莱的表情也逐渐陷入轻松，望向窗外，却看见已然枯黄湿透的草地上，有一个赤身裸体的男子，正在向列车走来，他的脚步忽快忽慢，也可能是雨水阻碍了他的判断。汉弗莱又转头看向白面的青年，他想与那个青年说很多，关于礼节、行头，城里的习惯。他担心这个青年很有可能会在这些方面栽跟头，像自己当年首次去伦敦一样。 “当然了。”“那窗外那位也是吗？”汉弗莱指向了左边，那青年显得一点也不惊讶。 “他吗？他可是个名人，在阿卡迪亚没有人比他更有名了。但他不是当地人。” “他叫什么？” “牧羊人，阿卡迪亚的牧羊人。” “那是他的名字吗？”汉弗莱有点疑惑。 “那不重要，那人的名字不重要，因为人们不那么称呼他。人们都叫他‘牧羊人’。” “阿卡迪亚依我看可不像什么牧场，我也并不看见他的身边有绵羊或山羊。”汉弗莱更迷惑了。 “他的名字是老人们取的，因为他们说，只有书上的牧羊人才同他一样‘放荡’。”年轻人将手支在大腿上。 “他放荡吗？”牧羊人的身影越来越近了，越来越靠近窗边，他好像是向他们走来，但年轻人并不转过头去看他一眼。 “一点也不。他是最洁身自好的，镇上的老人们都自愧不如他。”年轻人仍旧镇定自若。 “那说他放荡就因为他裸体？”汉弗莱不禁觉得有些匪夷所思，“那你是没来过巴黎，在巴黎·……” “人人都像他那样？” “那倒也不是，不过在那里，这种行为会被称作‘为艺术献身’。”汉弗莱轻飘飘地说。 “他倒不是为了艺术而献身。” “那是为了什么呢？” “裸体抗议，他亲口说的。”牧羊人伏到了窗子上。 裸体抗议？在这里？在这平静如水的村落阿卡迪亚？他是在想什么呢？汉弗莱望向窗外，他首先看见牧羊人弯曲湿润的金色长发，他白净轻红的面孔，他紧张地张开嘴大声喊叫，要对二人说什么，神情好像被雅典娜的海蛇缠身的拉奥孔。他年纪大抵只有三十，大概率要更小一点。汉弗莱多么想听清他费了九牛二虎之力从远方走来要说些什么，但是列车发动了，引擎的轰鸣掩盖了一切人类的声音。 牧羊人奔跑着，追赶着火车，直到一脚踩空，落入了雨与草之间。汉弗莱远远看着他，直到他消失于视线。 年轻人开口了:“他本是伦敦人，名叫乔尼·巴克斯特。父亲是一位工厂主，他过着一个少爷的生活。直到他有一日从伊顿回家，看见两个人将一个人的焦炭一般的尸体搬出工厂。然后他看到了很多被他自己一直忘却的东西，彩色的充盈重金属的天空离子的天空，似乎终日不停释放毒气的烟囱，从工厂被抬出去的工人们，于是，他去找他父亲，寄希望于他的父亲有能力改变这一切。当然，作为英格兰最大的工厂主之一，他的父亲有能力，只不过他不愿意。” “然后他的父亲在他16岁的时候死于肺癌，死前二人还在家里为了环保观念的不同打冷战。他被迫从伊顿辍学管理工厂，但他改造工厂的想法被董事们迅速否决，然后他们请来了他叔父，取代他管理工厂，但他不想回学校，他想做些什么，于是他决定去游行。”年轻人接着说下去。 “游行？”前面的故事已经令汉弗莱震惊了，但决定去游行，倒是更难以想象，“什么游行？” “什么游行他都去，为女性，为工人，为环境，为社会公益，每次工人罢工，他就全身赤裸，站在人潮的前头。他很快活，但他的叔叔认为他的行为是工厂盈利的阻碍。于是他们将阿卡迪亚的一块荒地买下，命名为阿卡迪亚疯人院，宣称他得了精神病，要送到法国的‘专业机构’治疗，同时在他得到‘医生’的证明前，不能回到英格兰继承工厂。但那里没有人，只有一片荒地，开始时他身无分文，食不果腹，他像羊一样，赤身裸体，在雨中生活，只能够吃草。” “我的家乡，乔尼的放逐地，阿卡迪亚是个什么样的地方呢？那是一个没有青年的地方，没有污染的地方，人们对工业的唯一认知是带走年轻人，不再回来的列车。但年轻人们又不得不走，毕竟阿卡迪亚，即使在老人们的眼中，也是个没有未来的地方。老人们与小孩们愿意放下成见与他说话，他们这么做并不是因为听得懂或想听，他们只是想从他身上看见他们身处远方的孩子们和父亲们，仅此而已。” “我说我要离开镇子了，要去巴黎读大学，他却没有给我和他人一样的指点，他给了我一块石头，上面刻着拉下文， ‘Et in Arcadia, is.’ 说等我搞明白这是什么意思时，我会回到这个小镇，再一次见到他的。之后我将石头放在父亲那里，毕竟带着石头出行究竟不便。”汉弗莱听到这句话时，心头一震。 “关于他的境况，其实我感觉我在学校里听过一个笑话很贴切，虽然很冷，太空中有些地方也有物质之所在，因此太空有的地方也能传声，但为什么‘太空不能传声’呢？因为星球之外，没有人在听。”年轻人直起背来，摊开双手，“他的处境也一样，老人们听不懂他的主张，我们长大了也离开他，最后他的语言，没有人会听。” “话说这句拉丁文，先生你听得懂吗？” “不懂。”牧羊人为什么要写这个？汉弗莱不解。但无论如何，他不想告诉这个年轻人，他不想让年轻人对此有过多的思虑。 “那再见吧，先生，我片刻便下车了。” “下车？你才刚到摩纳哥。” “我有亲戚在摩纳哥，我10号才到校，能在他们家里玩一天再在九号到巴黎去。“年轻人搬下箱子，走出包厢，汉弗莱想说些什么，但依旧缄默了。 最后一个泡沫也破裂了，汉弗莱回到现实，突然看向眼前的橱柜上，摆着一块石头，在灯光下隐隐约约现出金色的字样，像是课本上的黑体字样，在提示他什么。Et In Arcadia, is. 他注意到那老人的眼睛与那年轻人的眼睛一模一样，而在酒馆的深处，好像确实可以看见那件自己无比熟悉的米色的西服外套。但“他”是谁？那牧羊人究竟为什么要写这个呢？年轻人为什么非得要等离开牧羊人和小镇，才开始讲述牧羊人的故事？而年轻人又是从哪里得知牧羊人的生平的呢？他将咖啡一饮而尽，苦涩和香醇将他的身体唤醒，将他的灵魂从久梦中带回现实。 他戴上帽子，结了账，走出房门，还是进了雨里，十一月的冷雨里，他看着这座小镇的景色，从那映出清光的水流与那给勾上线条的雨水，他听不到老人与孩子的声音，听不见任何人的声音，被大雨覆盖住了，只有他自己，在变形湿透的帽檐下行走，带着悲伤。走向车站，他只听见二人在交谈。月光在云层的遮蔽下还可以看到，就像真相曾经对自己的诱惑。他曾千百次，在失眠的夜里听到德彪西的《月光》的旋律一般的莫测的回响，他以为只要这个谜还在，自己就永远不会安稳，自己将永远被它触动，为之而踏上旅途。他意识到了，有时他只能放下一些无解的事物，去继续生活下去，永远困窘于遥远的思索并无益处。 “他们说，这一站很快会被取缔。”他走到车站了，坐在候车处的木椅上，他听见一个女声在说话，汉弗莱感觉自己仿佛听到过这个声音。 “真的假的？”一个男声回应。 “于我们又有什么关系呢，不过换个地方上班而已。”女声说。 “倒也是。”男声又说。 他已经对搞清谜团不抱任何希望了，在下午七时的班车驶去后，他已经不在这个小镇了，想到此，他又把自己沉寂在悲伤之中，但十一月的冷雨，却不像他所想的那样，从窗中再吹进来。但就在他离开阿卡迪亚的雨后，离开灯光，离开人群之后，他仿佛看见了“他”的身影。 即使在阿卡迪亚，也有他的身影。Et in Arcadia, is. 2024.3.14 氿月 (收录于《明治十七》)","link":"/01/ArcadianShepherd.html"},{"title":"寂白之间 第零章 在天堂和地狱间沉浮 Down &amp; Out In Heaven &amp; Hell","text":"三途川的河水很凉，上方是滴下的石油，但是汇入河中却成了血红的河水。天之色乃黑色，地之色乃赤红，红色的不朽的曼珠沙华生长着。河上浮着船夫的小舟，是纯白的，船头与他也是白的。大部分时候，船夫不需要摇桨摆撸，由于水会自动将船引向应当到达之地。 “你怎么死的？”在经历了大概几小时的航行后，船夫卸下兜帽，他这才发现她是位苍白的少女。血红的双眼衬得白皙到毫无血色的皮肤单薄至极，乌黑的长发随意地散着，双唇也是血红色的，整体上来说，非常讽刺的是，尽管她的五官和肤色略微有些诡异，但总体上来说她很美，也远远比他更像个活人。 “我……我不知道。”他仿佛笑了笑，说，“好像是被‘考死’的，这种死法在我来的地方可还挺常见。”他试着幽默一些，他不大想给她留下一个坏印象，但仔细一想，他似乎不会与她再见了，这种做法是无关紧要的，毕竟想到可能只是萍水相逢一时，一切的努力就好像失去了意义。 “烤死？那地狱可能会让你感觉不太舒服，这里可是永恒不变的‘极热’。”少女笑着说，他发现她理解了他的幽默，甚至用同样的方式来回应他。于是他放下了戒备，打开了话匣子。 “那可真是太可怕了。”他的手伸向河岸，拔起一朵彼岸花。他将红石蒜一点一点剥开，撕碎，看见里面的金黄色花蕊。他的脑中突然想到一个同样怪异的面孔，却无法回忆起那面孔主人的名字，在天堂游荡太久，自己生前的记忆似乎已经快要不剩多少了，那个人究竟是谁？ “我看你不像坏人，为什么选择来这儿？”少女摇着船桨，血红的河水溅起来，湿了她的手，那手并不变色，反而是碰到她手的水滴被染白了。 “我本来要去天堂，但天堂人太多了，于是他们就开始随机抽取天堂之门外的未知灵魂进入天堂。能入天堂之门完全只能碰运气，没有什么固定的条件，是完全不可预测的随机，但也或许只是生前的命运在死后的无效延伸。” 船夫怔了一下，轻轻一笑：“那这样的话，最近像你这样来地狱的人理应很多吧，怎么我最近还是这么闲？” “有许多人等着要进天堂，他们都觉得自己理应进入天堂，他们停留在队伍中、台阶上、门口，期待自己能撞好运进去。” “你为什么不和他们一样待在那儿？听你这么一说在那里的你的同人不少啊。” “因为停留在那里什么也不会有，什么也不会发生。意志被磨折，无望的等待，我本也想这么干，但我依旧选择下了地狱，这里，起码会发生什么。” “我们地狱也没有你之前想象中这么坏吧，你看这山，这水，怪多姿多彩的。” “你们这儿……对我来说，不算真的地狱。你读过萨德吗？” “我载了他几趟，算读过吧。”船夫与整艘船为河水吞没，但很快就出水了。 “我不太喜欢他的学说，但有一句‘他人即地狱’我很觉得对。” “此话怎说？”桨停下了。小舟似秋日被微风的吹拂远离水中，到达岸上的一片红叶。少女扶着他一步步走上河岸。古老的编钟响起，那船上忽然出现又一个黑影，红叶被水裹挟，向着另一方离去，或许正要去迎另一个在天堂和地狱间沉浮的人。 “人们顾忌彼此，在平时的生活中，交流与人与人之间的联系存在。不可避免地，人们就要寻求优越感。而人们追求名不副实，追求身份地位，我在这人流中愈发感到行为的空虚，但又不敢也不能停下来，所以我觉得我举步维艰。”周围的景色如同几千种颜色落入了一个大调色盘一般，飘灵着，飞舞着，终于变得浑浊起来，影幽一片。线条似有若无，彷徨流落着似一个个千形万象的魅影，或者说更像是空间的一条条裂缝。少女牵着他的手，即将引他走过一道归桥。 他试图凭借灵觉去尝试理解走过的一条条路：“这是哪儿？我要去往哪里？” 周围的黑天鹅绒一般的浑浊的灵明，使他感受到一种令人窒息的温暖，仿佛回到了一个都更简单的时候，仿佛回到了自己更年轻的时候，仿佛回到了自己还活着的时候，或者说，他还没有死，生命的活力逐渐从灵魂里重新迸发出来。但那个怪异的面孔，那个在自己眼前浮现出来，露出诡谲微笑的面孔，不再能够回忆起来属于谁了。 “你要去下一次，下一站。下一段人生，你要走了。话说你觉得你还会回来吗？” “‘我觉得’重要吗？对于这些事情，我从来没有任何的决定权。”他淡淡地说，“我只知道我不会再去天堂的台阶上浪费时间。” “别处在下雨。”她的语气有一丝淡然的悲伤，赤色的双眼望向远方，她背对着他。气氛略有些凝重起来，他便没有再往下问。 无色的云彩伴着阿加尔塔之风，使黑金色的那苦痛的雨水停下了，一个矩形的强光源在远方显现出来，是此世与彼世的境界。二人穿过一片紫色的竹林，此时便到了那境界的下方了。 “最后的一站到了，你自己走上去还是我带你？”他似乎预感到要与她分手，但是他的内心突然有了一丝依恋。 “我在依恋什么呢？是这地狱还是她？还是那个陌生而又熟悉的面孔？”他这样想道。 “你带我吧。”他下意识地说出口。 “好。”她一步一步台阶向上走，他挽着手，步步紧跟，他感到一种回归。 “该是告别还是怎说，唉，你下一次再见到我，可并非穿过这一道门了。” “你这是什么意思？你怎么知道我们还会再见？”他的话还未说完，一道金红色的光就遮蔽了他的双眼。 “再见。”暂时失去了视觉的他只感觉到一只纤细的手将他向后推，穿过云彩，穿过帷幔，穿过光芒的另一边……说实在的，这一边是什么，另一边又是什么？他不知道，或许说，我不知道。 从刚欲之海之下行至人世，从彼岸归航，从死而复生，从梦中醒来，窗外风雨飘摇，42°C的大脑从死亡之梦中醒来，方才知晓那并非转世的一条归桥。但实际上，也很有可能是，我永远不能够知道是真是假。不过…… 若是不追求死后的美好与他人的关爱，那死后如何又不能奈我何。我望着我自己的心，意识在那里承载着，连三途川也无法洗涤的，重金属的灵魂。我戴上耳机，却听到“你的天堂阶梯就位于这细语低吟的风中”，原来里面正放着《Stairway to Heaven》。 “斯人已逝，生者如斯。或许忘了他也是件好事吧，我确实要往人生的下一步走了。”听了我讲述的怪异的梦和怜月的故事，天连、吴山、小王都不知道该说什么，过了好久，才打了声哈哈，开玩笑似的把这件事情说过去了。 说到底，我在回忆这回忆的时候才发现，我还是没有彻底从那场梦中醒来，我还是在天堂之门外祈求成为那位幸运儿，我总是会后悔着走回去，只是对着并不存在的机会默默地看。甚至在我第二次见到她之后，在实现我的梦之后。她的那句话究竟是什么意思？我还是不明白着，在现实与梦境中寻求着一个个言之无物的答案，走向一个和过去相同又不同的死胡同。","link":"/01/DownAndOutInHeavenAndHell.html"},{"title":"利用Requests和网易云音乐的API制作简单的网易云音乐下载器","text":"一、前言与废话这是个挺老的玩意了，我第一次尝试做这玩意的时候是在2018年我去千岛湖旅游的时候。 2022宅在温州乡下（想不宅也没办法，压根出不了家门），翻硬盘，翻到了这玩意，决定重写一遍 感觉这几年自己就没什么进步，估计退步了不少。 感觉天空的湛蓝也在为我的忧郁而忧郁。果然这个时候最想要飞翔在空中。但是在这种需要感情共鸣的时候，还不如听一首《魔法使的忧郁》。 果然是在想念谁，不然周围那么多人走过，自己怎么会感到孤单呢？ 二、代码（Python部分）123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180from curses.ascii import isdigitfrom sre_compile import isstringimport requests, json, sys, time, osfrom you_get import commonfrom bs4 import BeautifulSoupheaders = {'User-Agent': &quot;Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; .NET4.0C; .NET4.0E; rv:11.0) like Gecko&quot;}class TemplateError(Exception): #花里胡哨的一坨错误，自己当初怎么想的 def __init__(self, err): print(&quot;程序出现了错误: &quot;+err) Exception().__init__(self, err) class FanMangError(TemplateError): def __init__(self, code): err = '网易云音乐出现了系统繁忙，请在几分钟之后重启程序。错误码: %s' % code super().__init__(self, err)class NotExist404(TemplateError): def __init__(self): err = '您输入的ID指向不存在的音乐。' super().__init__(self, err)class VIPMusicError(TemplateError): def __init__(self): err = '请使用网易云音乐APP下载VIP音乐。' super().__init__(err)class IDError(TemplateError): def __init__(self): err = '错误的ID' super().__init__(self, err)def IDTester(ID, ignorance=True): try: if isdigit(ID) == False and ignorance == False: print(f'ID:{ID}出现错误，请检查是否正确。') logWriter('出现了错误ID: '+ID+&quot;，程序自动退出。&quot;, error=True) sys.exit(0) if isdigit(ID) == False and ignorance == True: logWriter('出现了错误ID: '+ID+&quot;，程序未退出&quot;,error=True) ID = str(ID) raise IDError if isstring(ID) == False: ID = str(ID) except: print(f'ID:{ID}出现错误，请检查是否正确。') return IDc = os.path.abspath('.')def wyydownloader(ID, ignorance=True, where='.'): ''' 利用官方API实现。 ID是一个字符串，是网易云音乐的歌曲ID， ignorance是一个是否被错误打断的boolean，若为True则忽视VIP歌曲无法下载错误并给予反馈。 ''' if os.getcwd() != c+where: os.chdir(where) ID = IDTester(ID) data = requests.get('http://music.163.com/api/song/detail/?id='+ID+'&amp;ids=%5B'+ID+'%5D', headers=headers) if data.content == r'{&quot;songs&quot;:[],&quot;equalizers&quot;:{},&quot;code&quot;:200}': raise NotExist404 n = json.loads(data.content) state = n['songs'][0]['fee'] if state == 1 and ignorance == False: raise VIPMusicError if state == 1 and ignorance == True: return 0 name = n['songs'][0]['name'] creator = n['songs'][0]['artists'][0]['name'] chunk_size = 1024 response = requests.get('http://music.163.com/song/media/outer/url?id=%s.mp3' % ID, headers=headers) file_size = response.headers.get('Content-Length') if file_size is not None: file_size = int(file_size) with open(f'{name} - {creator}.mp3', mode='wb') as f: for chunk in response.iter_content(chunk_size=chunk_size): f.write(chunk) logWriter(f'ID为{ID}的歌曲下载成功。',error=False)def searcher(name): f, c, d, k, _ = [], [], [], [], [] data = requests.get(r'http://music.163.com/api/search/get/web?csrf_token=hlpretag=&amp;hlposttag=&amp;s={'+name+r'}&amp;type=1&amp;offset=0&amp;total=true&amp;limit=20',headers=headers) n = json.loads(data.content)['result']['songs'][0:9] for x in range(len(n)): f.append(n[x]['name']) c.append(n[x]['artists'][0]['name']) d.append(n[x]['id']) for y in range(len(n)): k.append([f[y],c[y],str(d[y])]) for z in range(len(n)): _.append(('['+str(z)+']')+&quot; | &quot;.join(k[z])) for __ in range(len(n)): print(_[__]) a = input('请输入你选择下载的歌曲: ') wyydownloader(str(d[int(a)]))def album_web(ID): ID = IDTester(ID) url = &quot;https://music.163.com/album?id=&quot; + ID response = requests.get(url=url, headers=headers) html=response.content.decode(encoding=&quot;utf-8&quot;) soup = BeautifulSoup(html, 'lxml') results = soup.find('ul',{'class':'f-hide'}) results=results.find_all('a') download = wyydownloader(results[0]['href'].split(&quot;=&quot;)[1],where='./'+ID) for music in results: try: download = wyydownloader(music['href'].split(&quot;=&quot;)[1]) if download == 0: print('因VIP歌曲的版权原因，该歌曲无法下载。') logWriter('因VIP歌曲的原因无法下载ID为:{ID}的歌曲',error=True) except: print(f'第 {results.index(music)} 首歌曲的下载出现了问题') continuedef playlist_web(ID): ID = IDTester(ID) url = &quot;https://music.163.com/playlist?id=&quot; + ID response = requests.get(url=url, headers=headers) html=response.content.decode(encoding=&quot;utf-8&quot;) #print(html) soup = BeautifulSoup(html, 'lxml') results = soup.find('ul',{'class':'f-hide'}) results=results.find_all('a') if os.path.exists(f'./{ID}') == False: os.makedirs(f'./{ID}') for music in results: try: download = wyydownloader(music['href'].split(&quot;=&quot;)[1],where=f'./{ID}') if download == 0: print('因VIP歌曲的版权原因，该歌曲无法下载。') logWriter('因VIP歌曲的原因无法下载ID为:{ID}的歌曲',error=True) except Exception as e: print(f'第 {results.index(music)} 首歌曲的下载出现了问题') print(e) continuedef playlist_full(ID): #不建议使用，网易云音乐的服务器的这个API常常挂机。 ID = IDTester(ID) url = 'https://music.163.com/api/playlist/detail?id=' + ID response = requests.get(url=url, headers=headers) results = json.loads(response.content) if results['code'] == -447: raise FanMangError(results['code']) print(results)def lyrics(ID): ID = IDTester(ID) try: url = 'http://music.163.com/api/song/media?id=' + ID data = json.loads(requests.get(url=url,headers=headers).content) except: print('您输入的ID指向不存在的音乐。') if 'lyric' in data: with open(ID+'.lrc', 'w') as f: f.write(data['lyric'])# def getImg(ID):# data = requests.get('http://music.163.com/api/song/detail/?id='+ID+'&amp;ids=%5B'+ID+'%5D', headers=headers)# n = json.loads(data.content)# url = n['songs'][0]['album']['picurl']# img = requests.get(url=url,headers=headers).content# with open('./img/'+ID+'.jpg','wb') as f:# f.write(img)def logWriter(msg,error=True): #这个日志记录器也很失败 if error == True: state = 'ERROR' else: state = 'INFO' with open('日志.log','a') as f: f.write(f'[{time.localtime(time.time())}][{state}]:'+msg)# def addData(file, image): #这里本来想要写一个把专辑图片粘到mp3上去的函数的，想想算了，意义不大。# passif __name__ == '__main__': playlist_web('7266482854') 三、后语在我写着这个东西的时候，我突然想起来有个东西叫you-get。 真是一出西西弗斯式的悲剧。但是我感觉我写的这个测出来的效率好像要比这个you-get高那么一点，可能是网速的问题？","link":"/01/EMDLPART1.html"},{"title":"寻找深秘——《十三而立》完稿一周年纪念篇","text":"《十三而立》其实是我迄今为止写过的最长的小说类型文，如果硬要说在计划内的最长小说，那应该就是还在写的《白银树之恋》了。其实《十三而立》在原本的计划内是有上下篇的，并且上篇早在一年前就写完，下篇其实也写完了，但是由于不成熟没有发上来。对我来说，它的润色工作是很困难的，特别在文字原稿被撕破的情况下，连码字码上来也很困难。 在那件事情结束之后，我打算在我的有限的写作时间里写一部三部曲，灵感来自于马克思的那一句：“历史重复两次，一次悲剧，一次闹剧。”而我打算写”一次喜剧、一次悲剧、一次闹剧“，效仿王小波的《黄金时代》三部曲，我开始写《十三而立》，但一开始写作的过程几乎是体验式的对原小说内容的再描述，很显然并不合我意，于是，像许多棋手一样，我在陷入僵局的时候开始变招。我开始写我自己的东西，军特生活中的细节，破碎的回忆，我发现我的文字的破碎恰恰能够反映我思维的破碎，于是我写的愈发起劲。 其中一个主题就是人随着时间的变化被歪曲，被改变，人逐渐成为不同的人。角色慢慢地感受到自己的变化，失去一些过往引以为傲的东西。我认为用衰老来形容非常的合适，人们衰落，变得不再年轻，腐化，失去力量。而这些都是所谓衰老的一种副作用，而实际上，衰老的过程伴随人的一生。我的主角感受到了这种变化，因此只是迷茫；没有感受到变化的人只是被注视着的旁人指责着衰落下去，这才是痛苦之源。放弃了道德的达达主义者在一个毫无约束的地方，一个充斥着类似的人的地方释放着自己“真实的”一面（实际上只是过去在道德的约束下没有释放的一面，可以说一个现代人的人格在抛弃掉部分规则之后甚至较不完整）。 还有一个很重要的主题，那就是作为一个独立的人的孤独感，这主要是在我们的主角身上体现的。我们很难在今天拥有一种客观的物理意义上的孤独，人也不是一座孤岛，人是社会动物。现代的人无疑都是要在与他人的交流中生存的，然而这种孤独之外还有一种不被理解的孤独，甚至在这种不被理解的孤独之外还有另一种孤独感，那就是有理解者、与他人和谐共处，但是却只能独自面临只有自己需要面临的苦痛，这就是疏离感所带来的痛苦。对于我们的主角来说，它的周围是「寂静的」，是白色的「荒漠」，他无法与他人讲述他的痛苦，即便他讲出来了，那些虚无彷徨的人也无法理解，而他的理解者们与他承受的苦痛又不一样，本质上来说他还是没有理解者，他只能独自面临所谓的苦痛，这就是主角的三重痛苦。为了创造这种“三重痛苦环境”，我故意调配剧情不让一些本该出场的角色出场，以防止主角从痛苦中解脱。 最后一个，也是最重要的主题是寻找深秘。主角时时刻刻在接触无法理解的非自然现象。实际上大概只是因为主角没有学习社会科学，无法解释一些客观现象。但是这里主角采用了另外的方式来让自己理解这些无法理解的事物。那就是神秘主义，用对所谓超自然现象的研究来理解常人眼中小概率发生的非自然现象。主角由此走入了唯心主义，与此同时看见了许多人看不见的东西，打开了自己所谓的慧眼，却还是一个俗人，还是在痛苦，还是为了他人的苦难而痛苦。他敏捷的思维和眼观六路，耳听八方的本事，最终也只是加重了他的忧郁，并没有给他带来拈花一笑，妙悟真如的境界和虚无缥缈的极乐，本质上来说，我也不知道这是对于宗教作用的认可还是否定。 主角在离开了他一开始不完整的唯物主义理论无法解释的非自然现象的困惑之后，进入了唯心主义与神秘主义的深渊，在无极限的思维世界中寻找自我和存在主义的光辉。 我对于这种心态不置可否，因为这个主角走过的路，也就是我走过的路，我现在也还是一个神秘主义者，我现在也没有减轻自己的痛苦。小泽也在一开始走上了怀疑与寻找超自然解释的道路，他差一点就成为了和主角一样的神秘主义者，但是他仍然保持自己的信念，用自己虽然不够完整，甚至有些小错误的唯物主义和科学的方式去面对生活中的无限未知，在彷徨中追回了自己的道德，在抑郁中找到了自己的精神，一定程度上结束了自己的痛苦。我高度赞赏他的伟大，虽然在文章中他的篇幅并不很多。他的伟大在于认识到痛苦而不放弃，尝试去突破自己理解能力的极限。最终学会了理解，学会了与达达主义者和悲哀的人一同活在一个世界而不被他们沾染。他是《十三而立》中最优秀的一个角色。 我现在也在寻找深秘的造物。我对超自然的力量也有一种原始的膜拜，不同于主角，我的崇拜最早来自于中国佛教与道教在有机结合之后形成的宗教观念，后来又转向混沌魔法和达达主义。我对所谓超越人类的物种的形象充满了好奇，以及对不完整甚至容易被推翻的唯物主义哲学思想观念的质疑，最终导致了我成为一名神秘主义者。主角寻找的深秘无疑是在现实中难以想象，不可解释的现象，而他作为一名在唯物主义与资本主义世界难以找到精神价值的人（一个对资本主义的资本至上观念进行精神上的否定的人肯定没有办法融入资本主义社会中吧），又有绝对而不可想象的究极的孤独感，最终使他认为活着本身没有意义可言（我现在还是这么想，目的和意义都无法解释存在和生活本身）。最后让他说出这样的一段话： 然而所有人都沉默了，在白色的寂静中，只有我一个人在发声。我行走在这白色的沙漠，行走在那银白的绿洲，行走在那苍白乃至无色的城市，我只看到了无声的寂白。我继续远行，在这个被虚伪光芒覆盖的世界里存在。 他最终的想法是，这个利益至上、物质至上的世界对于自己这样的神秘主义者是虚伪的，他能看见的只有无声的寂静与苍白，在城市、沙漠、绿洲中，无论是人烟稀少还是人山人海他都感觉孤独，因为对他来说这些地方是无声的，没有与他类似的声音去回应他自己——「微斯人，吾谁与归？」。作为一部仅仅一万字的调侃小说，叙述这些主题本身超出了《十三而立》本身的叙述承载能力，我自己也很怀疑自己能不能写出这几点，我其实表达欲很旺盛，想要把自己内心的所有东西都写出来，但那样会太过枯燥，而且我理论上的错误会变得难以掩盖。后来我仔细想了想，看着自己这部写了几个月的不及格作品，觉得写都写完了发上去就完事了，于是我就把《十三而立》从头到尾改了一遍，发到了我自己的博客上。我觉得肯定还是不够好，确切的说，这篇文章糟透了，通篇思想反动，什么唯心主义，神秘主义，达达主义，胡扯乱编。寻找深秘对我来说是这篇文章最重要的主题，它含括了我对于这两年所见识和思考的一切。不论我究竟写的怎么样，希望看到的人可以写个更加包容的评论啊啥的，我会非常感激的。我便这样将这两年的思绪沉淀下来了。 吹神求杀 2022.8.27 在尝试多喝热水","link":"/01/FindingOccultism.html"},{"title":"利用 Flask 和 FFmpeg 制作简单的音乐转换器","text":"一、前言与废话我跟土土聊了一会天，然后我说：“要不我们俩写个音频转换器，用Python+Flask？” “没问题。” 下午，我写完了。 土土懵了（说好一起写的呢Q w Q）。 二、代码（python部分）123456789101112131415161718192021222324252627282930313233import osimport pathlibfrom pydub import AudioSegmentfrom flask import Flask, request, render_templateapp = Flask(__name__)def trans_any_audio_types(filepath, input_audio_type, output_audio_type): song = AudioSegment.from_file(filepath, input_audio_type) filename = filepath.split(&quot;.&quot;)[0] if os.getcwd() != &quot;/Users/zhengwanlun/Desktop/Python/音乐转换器/static&quot;: print(os.getcwd()) os.chdir('./static/') song.export(f&quot;{filename}.{output_audio_type}&quot;, format=f&quot;{output_audio_type}&quot;)@app.route('/conv/')def convert_page(): with open('index.html') as f: html = f.read() return html@app.route('/upload',methods=['POST'])def upload(): global file_extension f = request.files['file'] file_extension = pathlib.Path(f.filename).suffix EXT = file_extension.strip('.') f.save('temp'+file_extension) trans_any_audio_types('temp'+file_extension,EXT,'mp3') return render_template('page1.html')if __name__ == '__main__': app.run(host='0.0.0.0',port=5000) 顺便一提，trans_any_audio_types函数是我改变自某个之前看到过的知乎的帖子里的，但是帖子好像没了。知道出处的可以留个言来帮我找到出处。 三、HTML部分1234567891011&lt;html&gt;&lt;head&gt; &lt;title&gt;File Upload&lt;/title&gt;&lt;/head&gt;&lt;body&gt; &lt;form action=&quot;http://localhost:5000/upload&quot; method=&quot;POST&quot; enctype=&quot;multipart/form-data&quot;&gt; &lt;input type=&quot;file&quot; name=&quot;file&quot; /&gt; &lt;input type=&quot;submit&quot; value=&quot;提交&quot; /&gt; &lt;/form&gt;&lt;/body&gt;&lt;/html&gt; 其实这段没啥，也可以看出Python程序是在自娱自乐，HTML部分压根没参与一点动态的活。 四、末语土土：啊，这么快就写完了，写个“迅捷转换器”之类的东西吧。 根据“和土土说过要写啥就能很快的写出来”的原则，下一个好像要做视频转换+Flask？个人觉得不会有人会用线上的视频和音频转换吧。这个音频转换已经足够不实用了，我还能写出什么更加不实用的东西？ 还真能，社会课的老师说自己的U盘里原来的抽人软件里有病毒（你懂的，P2P下载器之类的），于是我要写一个班级抽人使用的带GUI的抽奖程序。这代码写着写着都出剧情了（笑）。这个时代已经充斥着许多同类型产品（对于这个项目来说，则是线上的随机数网站，它从各个方面上都可以碾压我的抽奖程序），但是有很多人就是看不到，我想要送给一些人这样一句话。 “带着会不会发现什么有用的东西的想法来看，这样是不会注意到真正有用的东西的。” ——ZUN","link":"/01/FlaskAudio.html"},{"title":"西海岸，东海道","text":"From California, To Kashima“您好，请问能占用您宝贵的时间，问您一些问题吗？”一个清脆的女声用英语说道，克里斯蒂安从朦胧中醒来，他忘了自己是何时睡着的，他下意识地看了一眼表，是六时三十分。 “嗯？”克里斯蒂安抬起头，望向眼不知何时坐到了自己旁边的少女。 “可以。” 女孩拿出本子和笔，克里斯蒂安勉强看懂了标题大意：《外国人对日本与日本文化的保护的看法》。柔美的金红色光束，从列车的车窗射进来，或许此时常陆国的后人们正同他一样从睡梦中醒来，看着太阳从太平洋的波涛中升起。 “您来到日本是为了？” “度假，旅游。”女孩快速地记下来。 “对于日本，你印象最深的东西是什么？” “……纳豆。”他笑了笑。 “最喜欢的景点是？” “青木原神海。”他几乎没有怎么犹豫。 “您最喜欢的日本文艺作品是？” “说不上来具体的，大概是村上春树的某一部小说吧。” 这女孩的英语有挺多语法错误的，自己勉强能听懂，希望没有答非所问吧，他想。 “您认为日本文化在保护方面还有哪些方面可以改进？”他怔了一下，然后很快地摇了摇头。 “没有，没有什么可以改进的了。首先，我也不是日本人，我没有资格来评判你们干得怎样，其次，你们的文化保护已经做到极致了，你们让很多即将消失的传统和习俗重新融入了生活之中，我想不到还能怎么做的更好了。”男孩看向女孩，她将笔和本子装进书包，甩了甩手，松了一口气。 “这就结束啦！话说你在哪一站下车？” “茨城。” “唉？那还真巧，我也在茨城站下。你叫什么名字？” “克里斯蒂安，你呢？” “雾枝莲子。叫我莲子就行。”“好的，莲子。” “你去茨城的话，肯定要去看鹿岛神宫喽。那是必然。” “这么说的话，我在那儿工作，可以给你的门票打个折。” “工作？” “我是那儿的巫女哦。” “哦，是吗？那可太好了。” “喂，话说你刚刚回答我的那些问题的时候，你是认真的吗？”少女眉角微挑，不紧不慢地发问。 “嗯哼，这你应该听得出来吧。”克里斯蒂安两手一摊，点点头，看向巫女那略显失望的表情。 “是吗？最后那个问题也一样吗？” “自然。” “那我可不敢苟同。”少女的声音愈发坚定。 “哦？你不妨把话说得更明白些。” 距离他上次乘坐这班列车已经过去了三年。克里斯蒂安走向当年自己与雾枝初遇的那个角落，第五车厢的末端，他触向已旧的金属座位，似乎想起了些话语。 “在加利福尼亚州，我的家乡，一切‘文化’都被装进了罐头制成了预制菜，你我可以在每一个沃尔玛超市买到，只不过那只是一个噱头。我们兴奋地把它们当作《圣经》捧回家，但最后总是失望地发现它尝起来像速溶咖啡。” “但即使是这样的东西，也并非全无价值，正如在‘文化保护区’里的文化，也满足了某些人的欲求一样，我们都是在这样的时代成长起来的，我们都一样，我们都能学会在这样的时代里如何生活。”女孩的身形，时时仍隐现于他眼前。 茨城县到了，最近大抵是旅游淡季，出站口几乎没有多少外国游客。他轻捷地走出去。想着约会的事。 鸟居在雨季仿佛受了潮，显出楠木色，一径花沿着入口，伸入神社的深处。微风拂过一丝青蓝色的海浪，带着一丝清澈席卷了神社。她究竟在哪呢？男子不安地张望，向花径深处行去。他看见如一块闪耀的碧玉的禅池，数座黄与黑的日式建筑，或许其中有一座是神灵栖息的地方。他双手合十开始祈祷，却不知道该对着哪个方向，于是他看向碧蓝色的天空，恰巧白色的云遮住太阳。 他看向前方，分明地看见红裙的一角露在松树之后。他跑过去，雾枝转过身来，向他微笑。 “你迟到啦，迟了一个小时。”少女的声音中倒没有一丝抱怨，日轮逐渐显现，金色的光穿过松针，影子映在二人的身上，树皮上的文字也因此显得更加深刻。 “抱歉，起得晚了些，神社在暑假这么冷清吗？”他才发现自己的时区调错了，该是东京，而不是上海。 “冷清吗？我反倒觉得清静些还好些。”少女拉着克里斯蒂安绕着树缓步行。 “这句俳句是什么意思？”鸟鸣与蝉声相和，城市中人们的笑语与悲歌融入了背景的白噪声 “你不是会日语吗？” “我知道每个词的意思，但我并不是你们的人，不能够真正地理解。” 女孩轻快地说：“原句来自松尾芭蕉的《奥州小道》，忘了哪一篇了，大意是‘仰望御神松，发芽生长自神代，金秋谒神宫。’” “原来如此，与我理解的差不多。话说这棵树在这有多久了？” “一千四百年。而我五天之后就要回到芝加哥大学，写‘无聊’的经济论文。” “五天吗？够长了，够我与你在东瀛列岛上相聚一场，也够我与你在太平洋的另一岸重聚。接下来去哪呢？莲台野？七夕坂？诹访湖？去哪都可以，有这时间，去哪儿都够。”男孩念叨着，望向仿佛水墨画一般苍蓝色的天空。女孩站在他的背后，静静地看着他。 “这几年，我一直都乘这班车往近于东京都与茨城之间，我看见一模一样的风景。一望无垠的原野和起伏蜿蜒的丘山，这与过往的日本景色一定很像，但肯定不是同一种。”女孩轻声说道。“我们和很多生活在‘文化保护区’中的人一样，被安排着过模仿古人的生活，就仿佛生活在一个巨大的模型中一般。但是在安排下，有时又要干与之相悖的事情。” “比如？”男孩十分诧异，不安地问道。 “比如穿着兔女郎装跳舞来招引香客，简直要和风俗店里的女子一样了，别误会，我可不歧视这些职业，只不过我觉得我的职业不是这样的。跳舞，COSPLAY和拍短视频，对神社的文化传承可是一点用也没有，追逐皮囊之美而来的，没有几个可以了解内在之深刻，在我看来他们不如不来。当然长辈有不同的看法，有时传统高过一切，有时香火钱又比传统重要。烦死了……文化保护就仿佛一个这样的幌子，它在我眼中，是一个有时高于一切，有时连金钱和流量这种俗物都不如的文字游戏产物。”女孩滔滔不绝地讲道，“话说你是哪里人？” “我来自加利福尼亚的圣何赛。你懂的，美国嘛，原住民都快死绝了，哪还有剩下什么‘文化’来保护。我从小就渴望去欧亚大陆看看有文化传承的文明是什么样子的，但我却发现你们的大多数人的生活方式，与我们并没有什么不同，惟有贫富差异触目惊心。我们都没有什么差别，都是不知道该往何处去的人，都是寻不到自己是从哪里来的人。”克里斯蒂安忧郁地说。 “是啊，现在好多日本人连汉字都认不明白了，就连常陆品牌的名字也改用假名了。”列车即将到站，女孩撕下本子上的一页纸。 “这是我的电子邮箱地址，若是有兴趣作我的笔友的话就收下吧。”莲子看了眼表，迅速地跑出了车厢。 男孩将纸收好，跑了出去。他在尝试跟上她，但追上之后呢？他想不出要对她说些什么但总之他就想追上她，但离开车站之后，她就消失在了人群之中。而他也被游客们推挤着向前进，没有停下或喘息的机会。 他在哪？在日本，在鹿岛神宫，在人群的中间，快门的咔嚓声，小孩的欢笑声和种种声音混杂在一起，橘红色的宫门，碧绿色的御池，白桦色的鸟居和人造的原始森林等诸多的影像在他眼前如池中的金鱼一般游动，仅留下色彩作为印象，身着鲜艳和服的女孩们与鹿以几乎一样的速度经过，几乎要叫人分不清。终于，在御神木前，他终于能够转过身，如他所愿地停下来。他慌张地看向眼前曾将他吞噬裹挟的人群，在内心深处呼喊着莲子的名字。 氿月 2024/6/3","link":"/01/FromCaliforniaToKashima.html"},{"title":"利用 Flask 和 Captcha 制作简单的验证码生成器","text":"一、前言与废话多年之前，我曾经给土土发过一个神奇的本地验证码生成器。当时我有一个习惯，写什么都要加个GUI，但是因为我想想觉得验证码生成器没必要有GUI，所以就没写。但是我写了一个叫BabyMode的函数，这个函数其实很简单，就是在Module无法导入的时候把所有模块全都下载安装一遍（用pip）。这个函数后来成为了我们俩之间的梗。 土土后来写了一个Flask实现的验证码生成器，我觉得自己很菜，连Flask都不会还学个啥Python，所以我当天就写出了验证码生成器（话说这样不算内卷吧），还学会了很多东西，果然竞争的存在是提高自己学习能力的必要条件。 二、代码12345678910111213141516171819202122232425262728293031323334353637383940414243from captcha.image import ImageCaptchafrom flask import Flask, render_template, requestimport stringimport randomapp = Flask(__name__)imgsrc = '&lt;img src=&quot;https://www.z4a.net/images/2022/05/03/%s.png&quot; loading=&quot;eager&quot; border=&quot;0&quot;&gt;'def generator(name=&quot;code.png&quot;):#ImageCaptcha库实现的验证码生成，之前和土土用的是我自己写的算法，回头看看不堪入目 token = string.digits + string.ascii_letters cap = random.sample(token,8) token_str = ''.join(cap) img = ImageCaptcha(width=400,height=150) image = img.generate_image(token_str) image.save(name) return token_str@app.route('/', methods=['GET','POST'])def index(): #index.html，分GET和POST，我把输入验证码和验证码正确错误的返回坐在一起了，debug的时候只需要重新进入网页就可以重新开始测试 global real_str if request.method == 'POST': result = request.form r = result.get('yanzheng').lower() == real_str.lower() if r: return imgsrc % '183127ad86d33bc4a.md' else: return imgsrc % '2731445bae82f42e5' else: with open(&quot;index.html&quot;) as f: content = f.read() return content@app.route('/code.png')def view():#显示code.png，其实这个函数写的很烂，会的都知道可以怎么写来提升代码整体质量 global real_str real_str = generator() with open('code.png', 'rb') as f: content = f.read() return contentif __name__ == '__main__': app.run(host='127.0.0.1',port='2333') #启动服务器 三、使用方法打开程序，打开浏览器，输入localhost:2333。 或者你是一个聪明人，你可以从代码或者注释中自己找到该干嘛。 如果是大佬的话，那我只能说，这篇文章对您几乎毫无营养，如果您不喜欢这种风格的代码分享，请慎重考虑要不要继续浏览本博客的其他内容。","link":"/01/FlaskCaptcha.html"},{"title":"利用PySide2和random模块制作简单的摇人机","text":"一、前言与废话这次是我在学校里写的，所以没有我和土土的废话。 我感觉我透过镜子看事物，仿佛一切都是那么的真实，但是却触摸不到事情的本质，因此，这镜子使我目盲。 直到我发现这镜子是我眼睛中的晶状体。 二、代码（主体部分）123456789101112131415161718192021222324252627import randomimport sysfrom PySide6.QtWidgets import QApplication, QMainWindowfrom PySide6 import QtCorefrom ui import Ui_MainWindowQtCore.QCoreApplication.setAttribute(QtCore.Qt.AA_EnableHighDpiScaling)class MainWindow(QMainWindow): def __init__(self): super(MainWindow, self).__init__() self.ui = Ui_MainWindow() self.ui.setupUi(self) self.ui.pushButton.clicked.connect(self.solve) def solve(self): num = int(self.ui.inputer.toPlainText()) with open('bonus.txt') as f: data = f.read().split('\\n') samples = random.sample(data, num) self.ui.outputer.setText(&quot;;&quot;.join(samples))if __name__ == &quot;__main__&quot;: app = QApplication(sys.argv) window = MainWindow() window.show() sys.exit(app.exec_()) 写这个的时候，在听的是“飞翔在空中的不可思议的巫女的每日”。真是美妙的曲子，让人感觉卸下了眼睛，只用耳朵感受天空的世界。 三、UI部分123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475# -*- coding: utf-8 -*-################################################################################## Form generated from reading UI file 'untitled.ui'#### Created by: Qt User Interface Compiler version 5.15.2#### WARNING! All changes made in this file will be lost when recompiling UI file!################################################################################from PySide6.QtCore import *from PySide6.QtGui import *from PySide6.QtWidgets import *class Ui_MainWindow(object): def setupUi(self, MainWindow): if not MainWindow.objectName(): MainWindow.setObjectName(u&quot;MainWindow&quot;) MainWindow.resize(500, 368) self.centralwidget = QWidget(MainWindow) self.centralwidget.setObjectName(u&quot;centralwidget&quot;) self.label = QLabel(self.centralwidget) self.label.setObjectName(u&quot;label&quot;) self.label.setGeometry(QRect(9, 9, 192, 72)) font = QFont() font.setFamily(u&quot;\\u54e5\\u7279\\u5f0f\\u5b57\\u4f53&quot;) font.setPointSize(48) self.label.setFont(font) self.pushButton = QPushButton(self.centralwidget) self.pushButton.setObjectName(u&quot;pushButton&quot;) self.pushButton.setGeometry(QRect(11, 308, 481, 34)) font1 = QFont() font1.setFamily(u&quot;\\u65b9\\u6b63\\u7c97\\u9ed1\\u5b8b\\u7b80\\u4f53&quot;) font1.setPointSize(16) self.pushButton.setFont(font1) self.outputer = QTextBrowser(self.centralwidget) self.outputer.setObjectName(u&quot;outputer&quot;) self.outputer.setGeometry(QRect(10, 201, 482, 101)) font2 = QFont() font2.setFamily(u&quot;8514oem&quot;) font2.setPointSize(28) self.outputer.setFont(font2) self.outputer.setCursorWidth(0) self.label_2 = QLabel(self.centralwidget) self.label_2.setObjectName(u&quot;label_2&quot;) self.label_2.setGeometry(QRect(9, 87, 120, 25)) font3 = QFont() font3.setFamily(u&quot;\\u65b9\\u6b63\\u7c97\\u9ed1\\u5b8b\\u7b80\\u4f53&quot;) font3.setPointSize(15) self.label_2.setFont(font3) self.inputer = QPlainTextEdit(self.centralwidget) self.inputer.setObjectName(u&quot;inputer&quot;) self.inputer.setGeometry(QRect(9, 118, 482, 41)) self.label_3 = QLabel(self.centralwidget) self.label_3.setObjectName(u&quot;label_3&quot;) self.label_3.setGeometry(QRect(10, 170, 120, 25)) self.label_3.setFont(font3) MainWindow.setCentralWidget(self.centralwidget) self.statusbar = QStatusBar(MainWindow) self.statusbar.setObjectName(u&quot;statusbar&quot;) MainWindow.setStatusBar(self.statusbar) self.retranslateUi(MainWindow) QMetaObject.connectSlotsByName(MainWindow) # setupUi def retranslateUi(self, MainWindow): MainWindow.setWindowTitle(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6447\\u4eba\\u673a&quot;, None)) self.label.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6447\\u4eba\\u673a&quot;, None)) self.pushButton.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6447\\u4eba\\u55bd&quot;, None)) self.label_2.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u8981\\u6447\\u51e0\\u4e2a\\u4eba\\uff1a&quot;, None)) self.label_3.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6447\\u51fa\\u6765\\u7684\\u4eba\\uff1a&quot;, None)) # retranslateUi 四、末语土土在帮我测试代码的时候，因为他使用的是装载M1芯片的MacBook Air，装不了PySide2，所以我把所有的PySide2改成了PySide6。 代码照常运行。（neta自《太阳照常升起》）","link":"/01/GUIedRandom.html"},{"title":"摇人机2007","text":"一、前言与废话书接上文。这个玩意被我们班的人玩烂了，我”突发奇想”打算加点功能。 上次可能没把这个bonus.txt的功能讲清楚，bonus.txt的每一行都会被读取然后被random.sample函数读取，然后生成随机数。其实本来想要用更加复杂的算法生成抽人动画的，想想觉得没意思。 然后这次写了一下初始化（防止bonus.txt不存在）和整数数列生成。 二、函数代码数列生成器12345678def generator(self): min = int(self.ui.min.toPlainText()) max = int(self.ui.max.toPlainText()) array = list(range(min,max+1)) strarr = [str(x) for x in array] sth = &quot;\\n&quot;.join(strarr) with open('bonus.txt',&quot;w&quot;) as f: f.write(sth) 比数列生成器更水的初始化，但是很有必要1234567def first(self): f = open('bonus.txt', 'x') f.close()# 没有这个初始化会出现chmod 777都拯救不了的BUG，# 如 [WinError 5]# 懂的大佬可以来说一下原因吗？# 很不理解为什么老是会出现文件的权限错误 三、末语这个项目的第二个版本的名字——摇人机2007其实是源于它的图标颇具Office 2007/Windows 7的风格。 PySide6的运行速度还是很慢……让人伤脑筋。难道要我去学C#吗…… 土土收到这个更新之后很快就开始了测试，不知道结果如何，目前来看，应该没有几个大bug。 话说为什么我要给这么垃圾的程序更新，而不是之前说过要写的视频转换器……恐怕是因为我很懒吧。","link":"/01/GUIedRandom2.html"},{"title":"寂白之间 第三章 自由意志 Free as Hell","text":"“文字是一面破碎的镜子，同时以个体与整体存在，折射光，让它显现出千万层不同的精神图像。在思维展开之时，不仅读者被剖析，读者也被剖析了。但看见结构森严的网络从立体的高维结构，总结归纳、消隐为一部简单、清晰又被层层剥离，沦为简单的图画式表达时，其巨大的损失是不可弥补的。在那线格之间，在那缺失的表达之间，人应当填补些东西。”我向坐在我隔壁的王天明如此说道。 我并不认识他很久，但他的大作《咖啡与自由意志》深深使我佩服他的思辩能力。我后来又遇上了他并递上了我狗屁不通的小说。他读后便常与我谈文章，但很少围绕他的作品，大部分时候在讲我的。 “说变在的，大可不必说得这么复杂。你的言辞像你的那部《御伽之国的鬼岛》一样，诡异离奇而晦涩难懂。”王天明摊开手，“整体来说，它其实并不需要那么复杂，破碎的结构和语言。你若想批判宗教与永恒，不妨更直接、简单一些。话说回来，我看了你的另一部作品，是叫《十三而立》吧。”他提到了它，但我不知道为何。 “是的。不过它不需要破碎复杂的结构与语言，而我需要。”我苦笑着说出这段话。 “我感受到一种介于极端荒诞欢愉与极端悲哀之间的东西，事物是荒诞的，但文字中却有种我看着最真切的萧瑟感，那是为什么？是有意的吗？”天明拿起保温杯大饮特饮，而我看着他，欲言又止。 ”我本来计划做一部三部曲，第一幕是喜剧，第二幕是悲剧，而第三幕是闹剧。《十三而立》是第一部，是喜剧。但我并不会写悲剧，所以我放弃了写第二幕与第三幕的想法。”我默默地答道。 “我倒是觉得这个点子不错，你可以接着往下写。不过我很好奇的是，那股萧瑟感究竟从何而来？你看起来不像是那样的人，确切的说，没有人像你所叙述的小说里的那样的人，没有故事像《十三而立》那样以一种怪异离奇的方式叙述。” 时间拨回到那个我开始写我第一部小说的下午，三足金乌的潇洒身影浅浅舞落，留下一帘青绿色的天，像一块墨染布，被晴光遗天一束滴下了灿烂的一点。处色的云中，射出一束青红色的光。而我只躺在操场上，躺在一片绵延的青绿中。在那时，我还勉强相信我的生命多姿多彩，偶尔失意、不满，也不过是短痛。乐是绵延的，而痛是短暂的，我便在这诡异的校园中随大流而醉生梦死。那一天，我还不知道发生了那件事。 两天之后，我回到家，打开QQ，向怜月发了自己小说的前三页，沾沾自喜。然后我就收到了他的死讯。 他是我人生中第一个教我写作的人，我的良师益友，我竟不知道他的死。但令我自己惊愕的是，我感受到的第一个情感，并不是悲伤而是恐惧。我害怕意识消失，但我更害怕与自己关系密切的人，可以如此突然如此快速地消失在我的生活之中。突然之间我就不敢去拥有，因为我意识到随时有可能失去。紧接着我就产生了一个可怕的念头：不要爱任何人，甚至自己。在这样的心态下，我开始重新审视自己的内心。我发现有一种空虚状态，正在我的内心中扩散，原有的世界观四分五裂。而我的语言也开始丧失其色彩，有一些颜色，从那一天开始，只在我的记忆与噩梦中出现。在内心原本最充盈的基底，出现了一个空洞。 “圣托马斯·阿奎那认为，上帝是自然状态，绝对的善;而恶是不自然的，是像空洞一样的缺失状态，是像裂缝一样的虚无状态。当我注视任何东西的时候，那空洞只是存在于其中，提醒着我有多么空虚。这就是为何我写了那部小说，我在向我剖析中，打算填补我的空虚。” 对于我来说，写作一开始是生理行为，是对于我支离破碎思想体系的重构机制，是给予虚无空洞的填充物。我一开始只是凭着想象、记忆与实际排列组合成语句，随意地写下来。但我意识到，这种无意识的产物比有意识的产物更能够代表我与我的精神状态。对于虚无，我不知是在填补还是逃避。 “你现在还是在这样地写作吗？”点点雨丝透过窗沁来，灰色的云终于要释放它自身。山雨已至，但我仍然不知要走向何处。 “我觉得完全不是。你我正身处于这环境中，过往繁多的奇人异事都消隐了，轻盈的新环境中的甘甜逐渐由此变为苦涩。在做出选择之后，人们或留下，或离开，但大家的生活都走上了正轨。人们习惯于习惯中，在形成后越来越感受到痛苦。但又无法摆脱，因为那是在灵魂上的雕刻。”我说着，突然感觉某根心弦被触动了，左胸部的肌肉莫名地出现了一种线性的痛感。 “行，那我先走了。你是去中考班，对吧。我也去了，你还没吃饭吧，快去食堂先把饭吃了。”他边说边上楼，我本想再说些什么，想想还是算了，我走下楼去。 当我踏下台阶时，我看见一滴水从天花板滴下来，滴到一滩映着灯的积水中。那摊积水的形状像一个眼窝，而惨白的灯像是时刻从虚无中看着我的眼珠。 我抬起头，看向水的源头。那是淡蓝色的墙面中的一个裂缝，像毒蛇的舌头一般从万物之中吐露出来。我走向右侧绕开，继续向下走去，长廊的影子在雨水中溶化，遁入许多事物，一片晦暗。 当雨水击中我的皮肤时，我感到一丝寒冷。我为什么要在雨中行走，而不是在长廊中走，如同往常一样。我从不惧怕长廊的黑暗，也并不至于埋怨它“道阻且长”。我可能害怕在长廊中只有我一个人，这会提醒我身边不曾有人伴。走在大道中，仿佛远方走来的人我熟识，仿佛我就不孤单了。 我吃过个饭，回到教室，看向桌上散乱的美术作业。我并不知道它们为何被放在这里，但我觉得我应当将它们发掉。我那天就干了这么些事情，没做什么别的了。”我这样向郭导说。 “你相信人有自由意志吗？”郭导突然这样问。金色的探照灯给我与她上色，我与她就这样立在钟楼下，她就这样突兀地发问了。 “为什么突然这样问？”我有些诧异。她从我的手中接过一个行李箱和一个手提袋，她接着说：“因为我觉得你所做的一切，让你苦恼的一切行为都是出于你自己的选择啊。你如果一直追求你所欲求的那种东西的话，迟早会把自己逼疯吧。即使你不填补空洞，接受它，又会怎样呢？” “好，我明白了。”我没明白，她也没懂，我与她分别走向钟楼后的男寝与操场后的女寝，看着我和她的影子越拉越长，我看着我的影子进入黑暗，走向冷色地带。","link":"/01/FreeAsHell.html"},{"title":"访谈（二）：天体物理与蔷薇十字","text":"简要来说，这个系列是我与本校同学们的访谈。这次访谈是在天体物理社建立之后，我与天体物理社社长 Jesse 的访谈。有轻微删改，发布前已征求对方同意。 Jesse，天体物理社的建立真是一个让人振奋的消息，你们社团的宗旨是什么呢？ 额，我觉得要说宗旨的话，可能是为了让更多同学爱上天体物理。并且我希望这能使各个年级的同学都能以相互交流的形式在相关领域取得进步，利于我们未来的申请和素质的提升。我还希望能创新一种新的社团形式，一改往日只有社长讲课，让所有同学都能参与进来。 关于天体物理，你认为你最感兴趣的子领域是什么？ 说起天体物理，我觉得还是说宏观高速物理更为确切，相信随着科学的进步，我们终有一天能脚踏星辰，遨游银河，这令我兴奋。在我看来，一个文明是否发展取决于速度是否提升，而研究宏观高速物理能提升我们的所谓的速度，进而提升生产效率，让人们有更美好的生活。要说子领域，其实没有特定的子领域，我更愿意用速度两个字去概括我真正感兴趣的东西。 你之前在课上提到过《三体》，刘慈欣的文学创作是否对你影响较大？ 我觉得对我是有挺大的影响的。我对物理的很多兴趣都来源于刘慈欣的小说，通常都是我先看书找到里面的知识点，然后去追加了解，从而拓宽我的知识面。而且他的小说让我了解到了物理的美，进而加深了对这门学科的兴趣。 你之前征求过天体物理社的“正式名称”，但貌似它现在还是称作“天体物理社”。 这个我后来想了想，基于我个人追求极简主义，所谓正式名称可能会有所冗余，还是纯粹一点好，这跟物理学本身一样。 针对你最近（2024.4）的部分争议，你个人有什么看法吗？ 主不在乎。 你认为你自己在物理学学习上展现出的最大的优势是什么？ 我认为是兴趣，我没有像【数据删除】一样的高智商，也并没有什么特殊的天赋。我一步一步走下来都是靠兴趣在支撑，它永远是我最坚实的后盾，能让我攻克我所遇到的一切难题。 作为一个学术社团，你们社团将会以什么形式创作和发布社内的学术成果？ 我们可能会把每个人授课的内容录下来，或者写摘要撰成文章，形成一个总汇发到社交平台上，使我们杭外剑高的天体物理社走进更多人的视野。至于一年后的社团展示(Club Fair)，我暂时还没有想好到底以什么样的形式去展现。 谈谈你社中的金牌讲师吧。 其实没有所谓真正的金牌讲师，所有人都可以是金牌讲师，因为相信，所以实现，任何一个人都是主角，都能站在演讲台的正中央——只要有兴趣并充满热情。 我要拿郭继承教授的话诘问你了，在你眼中，宇宙万法的源头，它是什么？ 在我看来呢，是奇点。 你是一个重度音游玩家，可以随便谈一些你在这一方面的偏好吗？ 这只是闲暇之余的一种解压方式吧，在享受音乐的同时又能感受节奏的律动，仿佛自己和音乐融为了一体，对于我这种并不是很正常，乐器的小白来说是一种不错的体验。 好的，非常感谢你接受这一次访谈。 2024.4.20","link":"/01/InvisibleInkTwo.html"},{"title":"访谈（一）：怀旧情结与梦核美学","text":"简要来说，这个系列是我与本校同学们的访谈。这次访谈是我在听了本校书籍影像社的公开课《梦核美学》后，为了对于这种美学有着更深入的了解，与社团成员 Branny 进行的一次线上交流。有轻微删改，发布前已征求对方同意。 好的，首先，你认为这种艺术（“核”）的形式是照片的处理还是画作？还有，你最近在制作梦核主题的作品吗？ 其实形式上来说是照片处理居多，但是如果把小时候的涂鸦处理一下我觉得也会很梦核。是的，我的作品集就是基于这个主题的。 那么，你觉得，中式梦核和一般我们提到的梦核的区别是什么呢？还有就是我们之前在社团讲课的时候看到的视频里，有过“中式核”的说法，这两者是同一种东西吗？ 中式梦核我感觉更像是旧核、梦核和回忆核的结合，梦核的话更笼统一些。我理解的话应该“中式梦核”和“中式核”是一种东西，UP 主应该只是略说了一下。但这也只不过是我的理解，我不知道 UP 主表示的是不是同一个意思。 归根结底，“核”这个概念是什么？ 核其实是一个很宽泛的概念，现在有很多很多种核，像池核、食物核、伤核等等，我可以等下给你找点图看一下。 既然以图片处理为主，这种艺术形式是不是更加趋向于二次创作而不是一次创作？ 对，我个人认为图片和音乐更能表达这种概念，文字的话我尝试写过，觉得不是很好表达。不过我觉得你写作还不错，可以试试。 所以这些作品可以被称为 Illustration (插画) 吗？ 你认为 Illustration 相当于文字的配图吗？【如果是的话那就比较难说】。我其实觉得它更属于独立的阐述，因为本身一大部分梦核图片的作品本身就嵌入了文字。 听上去像是一种定义更宽泛，形式更多样，主题更限定的创意写作？ 嗯，我觉得是这样的。那种比较简短的小诗也和梦核的感觉挺搭的。 那么你最近有什么大作可以分享一下吗？ 呃，我最近的作品都是平面设计，基本是练一些软件的技法，像设计海报、宣传手册之类的做的比较多。跟梦核相关的还在进行。对了，明年十月份我有线下展览，就是跟梦核有关，主题暂定叫“一次性朋友”。可以期待一下，哈哈。 就这次交谈来说，我感觉这个艺术形式挺有意思，或许我很快会写一些这种风格的东西。 好啊，我很乐意欣赏。我的想法可能比较片面，感谢你对我的认可。 也感谢你对我的。 2024.4.19","link":"/01/InvisibleInkOne.html"},{"title":"日记八集：琐事雨谈","text":"“下大雨啦！同学们记得打伞！”食堂的一个大伯卖力地喊着。 英特食堂门口未曾有一把伞，大雨却出乎所有人意料地下起了。我身上只一件单衣，不便过雨走路，学校的伞价格颇高，我买不大起，我便请求一旁与我同行的小王同我一起绕行一个通道。那通道人不少，但很黑很长。 “下雨实在是一件不便的事，人也变得不喜起来了。”我说。 “嗯，你说话其实可以更明白一点，没考上是吧。”小王比较直白。 “那位考上了清华，元气…我们也假设他可以轻易上C9的大学，他起码是天才。怎么就我一个如此落魄？”我这样地说着。 “莫要灰心丧气嘛。你实在不行也可以去考杭外剑高的啊！”小王拍了我一下。 “杭外剑高又不是杭高国际部，校考没这么简单。” “倒是。那杭高的卷子是简单。有道压轴计算题是，Expand (a-b)²，真是令人哭笑不得。” “是不是有位高人在考时还问(a-b)²不是已经因式分解过了吗？这笑话不是很久了吗？” “说到杭外，你试过去考吧。”小王突然插了一句。 “对，我摇号中了，可未进。”我说，“那时我可太蠢了，未曾把握这样的机会。” “老兄，这机会可不是你珍惜便能拥有的啊。话说你当初如何知道的？” “那时，我父亲见我有些赋，便让我去试试。我那时哪里晓得学校的优秀与否？有机会考，那便去考了。那之前，我已去过几次英特，了解了这两所学校。” “我头一周进英特是在五年级的一个假日，我记不得了，好像是在此操场上开着无人机在那里玩。我当时还看着许多人的露历表——那时我似乎在一场竞技中失败了，故很看重奖项之类华而不卖之物，现在想想，那可太肤浅了！——但我那时看着那些‘成功人士’一般的笑容与一个个大奖项，心中催生了恐惧与犹疑，我仿佛觉得我不配在这里，不配与他们在同一处（现在想想简直是笑话）。我郁问了一天，我的父母很忧虑我的心情，也将时间用在了安慰我上，玩的不大开心。” “自然也不是真来玩。不过那日我有一个意外的惊喜，我头次见到了我当年未曾见过的藤蔓。说真的，也见过，但如此大规模的生长，在我眼中，倒是一个奇观。那时我很惊奇，以为是常见的。那时的我看见的是代表着生气与生命的藤，现在我看着却像是崩坏的大楼的一道道伤痕，我不知道为什么我会对待事物有如此之大的不同，现在我知道了，我在这里度过了三五年。” “后面的事，太大抵都记在《十三而立》里了吧。” “却还有几件小事。我去参加了英特夏令营，得了一等奖。按老例，是可推荐免考入学的。” “这我清楚，可……”小王自己的脸色也阴沉起来，仿佛想起了什么。他也是英特夏令营的一等奖学员，和我一样，过去都曾幻想拥有过那种应许的权利。 “英特对于我小升初那年改革了，咱不用考试，摇号中了就能进。这倒不是最坏的消息，杭外的直升考试资格被撤销了。而我去英特，却只图一个这个条件。学费却是长了，生源与我想得大不一样。当年在夏令营的努力白费算不得什么大事，而这些才令我对它和自己失了信仰。” “我们需要在对未来无能为力，无所适从，一无所知的时候对重要的事情做出抉择。而这些抉择比人生中的一切都重要，仿佛它们决定了我们，实际上，这些抉择什么也不是，真的什么也不是，我们与它们打交道的时候甚至都不知道它们是什么。可是他就是能够影响你的未来，他就是一个拐角点，一个没有人熟悉，没有人看透，没有人理解的拐角点。你以为你有选择权，可是选择权真的在你手里吗？你以为努力过就够了，但是过后一定会有结果吗？拐角点之后是什么，等你穿过拐角之后再去看，真的已经来不及了。” “我几年前以为，好学校，好高中，好大学，这种词汇是很轻盈的，就和从嘴里吐出这几个词一样简单。我现今正为三个在我眼中更简单的词而奋斗，那便是’上普高’。你倒觉得我失了自信，但我的自信又在哪儿呢？我们几何时有过自信，来源于何方，成绩？排名？抑或是实力——你还要把它换成许多许多大奖，拿几十个省第一或第二。” “在这样的生活中，自信从何而来？”我走出通道，是青白的天。阵雨时来时去，我已习惯。 “雨停了，我们走大路吧。”小王走向积水与沥青的路。他没有回答。 我与他一言不发地从大路走回了教室。我与他都不知道该怎么回答。 但雨还在下，正如对话时那样，但我的心已然在犹豫要不要去买伞了。 (作于2023.4.15，发布于2023.7.29)","link":"/01/HopelessTalkWithFiends.html"},{"title":"天鸡文学社","text":"在2024年3月23日，我与阔别已久的王天明在微信上聊天，他提到了余高的文学社，我便很感兴趣，于是他便给我看了看文学社的网站。我要说，当时我看见的时候，是相当触动的，我终于见到了我很多年以来真正意义上想要的文学社团。于是我向天明兄要了网站管理员的联系方式，我便与他交谈起来，那天晚上很愉快。他给与我网站的管理员权限，我便在其上发表了两篇近日写的文章，一篇是《阿卡迪亚的牧羊人》，另一篇是《施洗者的预言》。 “来看这万千旧梦，在歌声中得到重生”。","link":"/01/JoiningLiterarySociety.html"},{"title":"人生思考者 Life Thinker","text":"闲着没事画了一个个性签名。","link":"/01/LifeThinker.html"},{"title":"寂白之间 第五章 夜黑风高 Midnightmare","text":"“所以今天又是什么？”我向押送我的人影说，“不会是101号房吧。” 他一言不发，将我推了进去。里面是一个巨大的，全是镜子的房间，入口和出口也成了平滑镜面的一部分。我看着自己，也看着镜子反射出的镜子。“人人都知道101号房里有什么，只有你对于它一无所知。” 那个得意的男声继续说道：“但我们最终还是在细枝末节中找到了你所害怕的东西。” “你自己。”我在毒气的作用下开始呕吐。在胃里什么也不剩时，我突然感到有什么东西，挣扎着要从我的嘴里爬出来。当我强行将它取出时，我看到它的形态，一只布满血丝并完好无损的眼睛。我不敢看它，只把它丢到远方的镜之墙。但那黑色的眼珠，竟附着在上面，成了一个黑色的洞，而那数不尽的血丝竟分裂扩散开，从镜子里穿过来，刺向我的双眼和喉管，我在这梦里最后的感觉，是双眼的破裂。 我咳出血来，但在午夜的月光下，我看不清一切东西，我以为那就是我梦中的眼睛。但若非小王的一句“你还好吗”，我将仍怀疑自己正身处梦境。我回到床上，也懒得再做梦，便思考起那件事情的缘由。我一想到昊天，我就想到，在比深黑色更黑的夜晚里，他疯狂地给每一扇门，每一个公告栏贴上万字旗的场景。 “所以你觉得，这件事是真的吗？”我向天明问：“昊天真这么干了吗？ 我那晚一宿未睡，到了午后仍惊魂未定，碰上天明，便与他将此事相问。他看着我神经兮兮的样子，倒是略微发笑。 “昊天我倒是不认识，但是我最近却是的确不曾见过蒋竹风。”天明摇着头，“我倒觉得只是别有用心的人在炮制谣言，想彻底搞臭昊天的名声。要知道，他在很多方面树敌无数，而他的那件事把所有人都惹火了，大家有充足的理由反对和造谣他。蒋竹风若是真出了事，想必你我会知道，对吧。” “但愿如此吧。”我看见蒋竹风从窗口快要走过，雨从窗户外打来，融下一个红色的黑板上的红字，滴在我的手上。 天明笑了笑，说：“你看，谣言不攻自破。喂，竹风！”我与他打着招呼走过去。竹风并不正眼看我，他看的时候，我总好奇他什么也没看见，因为他的左眼比我的还要空洞，而他的右眼不断地在旋转，像一个旋涡，好像要把我吸进去，然而终于在一个点安定下来了，在我的左手上。 我太熟悉那种眼神了，但我不知道破碎过的眼睛如何运作，所以在他攥紧双拳之前，我并不意识到他要冲我来了。在我夺门而逃的那一瞬间，我被猛推了一把，我摔向门口的时候，正想爬起的时候，却发现天明爆发出了从来没有在他身上见到过的力量，他将满脸通红、已然攥紧双拳的蒋竹风制住了，可能并不能够维持多久，我便跑向另外的教学楼，如同透过窗户击打我皮肤的雨点一般。 然而也恰恰如同打到我的雨点，我打到了另一个人身上。小泽头一回看着我这么惊慌失措地从楼上跑下来，还撞到他身上，幸亏他身材结实，不然高低得像他手里的《我的世界观》一样被我撞飞小几米。 ”谣言很有可能是真的。“我和小泽解释，”我寻思大概是，蒋竹风看见我手上的红色粉笔印记，他想起了那天他在篮球场和昊天争斗时留下的血，然后就失控了。我看的清清楚楚（也被打得清清楚楚），我看见了他的眼睛，有一只几乎不能动，还有一只空洞的像要把我吸进去一样——“ ”首先如果昊天干出了这样的事，学校必将对他采取强制措施。他之前在全校贴满万字旗的时候，就已经得到了一份校级警告处分；如果他再导致这么一起事件，就一定会得到第二份，这绝对会导致他被强制退学，甚至负刑事责任。总体来说，你我都知道他是一个如此无耻的人，但他也是一个最护着自己的利己主义者，这样的人，不会干出这样的事。“小泽冷静的逻辑分析，大理石雕刻一般的面庞究竟让我恢复了理智。但我还是放不下，我知道有很多原因可以否定我的这种假设。 我究竟是变了，我现在可以做到不吝以最大的恶意揣测别人了；但或许我又没变，我仍然无法在别人的苦难前转过头去。我不知道，当我走回教室的时候，我发现教室里又充满了熟悉或不愿与我熟悉的面孔，而天明和蒋竹风消失了。而恰好，班会课上课了，面色苍白的梁老师走进来，用白粉笔写了两个字”自习“。 ”你们的初中旅程已经快要走向完结了。有时我觉得事情变得不一样了，越来越严肃了。问题越来越大了，越来越难控制单纯在学校内、在我的帮助下解决了。有时一些小小的举措，能够造成永久的生理或心理的伤害。我作为你们的老师，你们在学校的、也许不那么合格的守护者，已经很难再帮助你们了，而且我们很快就要分别了，在下个学期，你们的班主任就不是我了。“梁老师尝试隐藏自己的感情，”我将成为中澳班的班主任，而你们都将在选择或分配后进入不同的方向，初中结束后，我们、你们都将各奔东西。这节班会课本没有内容，我只期望能与你们中的一些人和解，我们好聚好散。还有，最后一段时间，别给我再闹什么幺蛾子。“她说最后一句话的时候，眼角几乎带着一丝泪光，我不知道她的嘴唇微微张开，是想要挤出一个微笑还是说些什么话。 又过了两节语文课或是数学课，我的思考仍然未能平静。我要去上社团课了，我淋着雨走向机房，却看见一旁的小道里，有一个黑色、矮瘦的身影走过去。昊天？真是他吗？然而定睛一看，却好像是一个初一的小学弟，还带着红领巾。 机房的配置只能说勉强能在十几年前说的过去，但据说有人之前在这里玩谷歌浏览器内置的游戏竟然把这的电脑玩冒烟了。就在我刚拉开椅子落座时，那个黑色的身影走了进来，那是昊天，不知为何戴着红领巾。”我能坐你旁边吗？“他笑着，像个没事人一样。 我不敢说让他离开，也不敢真的让他坐下。于是，我耸了耸肩，表示随他便。他看着我笑，我不知道为什么。他坐在我旁边，看样子也什么也没干，短暂的恍惚间，我真的相信了他什么都没干，这一切全是巧合。 上课之后，我和他熟练地将学生端控制软件关掉。他和我都很长一段时间没说话，直到他突然开口了：“喂，柏林，我说你这么长时间也没主动提问，你不会真的对篮球场的那次事件不感兴趣吧。” “哦？什么篮球场事件？”我的背后瞬间有了冷汗，我自圆其说的又一个幻梦被轻易地打破。“篮球场事件”这五个字，彻底地让我对他那只在鼠标上的左手产生了恐惧。 “就是我在打篮球的时候，我与蒋竹风争球权，要打起来的时候，我说：‘打之前先把眼镜放下来，我可不想赔你的眼镜’。然后蒋竹风愣了一下，将眼睛摘了下来。我趁此机会，用两只手指戳进蒋竹风一只眼睛，像这样。”他左手微微抬起，以极快的速度将左手向远方伸去，直直的中指和食指几乎撕裂了空气。我的一只眼睛突然开始作痛起来，可我不敢捂。我强装镇静，只是平静地听，时不时说几个“嗯”。 “柏林，我之前可没注意到你这么脱俗，听这么口味重的故事都能像个石狮子一样坐在原地不动也没个响声。别的听这个故事的人可吓坏啦，我和蒋竹风当时也吓坏啦，但他捂着眼睛在原地动不了，我一开始也想要不先叫个救护车什么的，但我觉得还是先去厕所把手洗干净比较好。等我回到篮球场去的时候，蒋竹风已经不见了。”我忍耐着一千句”操你妈“和同情与悲愤的泪水，听着这个人在我面前打趣一般地讲述着。 “几天之后，我拿到了严重警告，我父亲出了巨额的医疗费，联系了全市最好的医生终于把他的那点视力救回来了一点，但也不多。我本来以为我要被勒令退学了，但你猜怎么着？我之前进入创新班的时候，签了一份合同，其中包括我必须在‘这个学校的创新班读完三年高中’，违背合同的一方将要付出巨额违约金。校方宁愿把我留在这个学校，也不愿意为了这件事支出天文数字。”好像一只蜥蜴在我的颈椎里爬，我仿佛有一种随时要倒下的冲动。或许就是在这一瞬间，我对这地方彻底地失望了。 ”你为什么要这么干？“我尝试用尽量冰冷的语气向这个对自己过去的恶行充满激情的疯子说话，但我忍耐不住了，我几乎要伤感地流出泪来，“难道一个球权就那么重要？比一个人的，或许两个人的人生，还要重要？” “对啊，有时候就是如此，这可比你所能想象的一切事物都要重要多啦。如果再给我一次机会，也许我还是会干一样的事情，我阻止不了这件事的发生，因为这就是我干的，不是什么双重人格，也不是突然的爆发，我已经有了那个念头，我就要让它实施下来。我确实很害怕做这件事，我之后想起来也有些后怕，但是总而言之，木已成舟，而我要想的是开一个造船厂还是开着这艘船出去浪。”昊天露出扭曲阴暗的笑容。 “哦对了，你知道为什么我能拿到那个创新班名额吗？因为在那次创新班考试的前三十人里，有一个人放弃了名额。我在顺位后延后，拿到了那个名额。你猜是谁放弃了这个名额？”他混沌的眼睛像毒蛇一样盯着我。铃声响了，其他人也都离开了，他也走开了，没有揭开谜底，但我猜到了答案。 我听着似有非有自己的这个故事，好似过了一个永恒，却在虚无的回望中只留下一个不成瞬间的须臾。但在那时，我唯一想做的事情，是去看看蒋竹风，我以最快的速度爬上楼梯，却只在一个灭了灯的幽暗的教室里，看见一个流着泪的天明。 “他走了。他今天是来办理休学的。你走吧。让我一个人静静。”短句连接着最令人感到怅然若失的几个字符，组成散落在夜半天空中的北斗七星，向无限空虚的空间的极远端飘去。","link":"/01/Midnightmare.html"},{"title":"Markdown转换器","text":"零、紧跟时事听说WPS塌房了，我的内心没有一丝波澜，毕竟一直在用Markdown写作，但是由于需要，还是要写一个方便的Markdown转换器。主要是为了方便手机阅读，其次则是方便给他人传阅。 一、代码下面是main.py的内容: 123456789101112131415161718192021222324252627282930313233343536373839404142import markdownimport pypandocfrom ui import Ui_MainWindowfrom PySide6.QtWidgets import QMainWindow, QApplication, QFileDialog, QMessageBoximport sysimport osdef BabyMode(): os.system(&quot;pip3 install pypandoc_binary&quot;) os.system(&quot;pip3 install PySide6&quot;) os.system(&quot;pip3 install markdown&quot;)class MainWindow(QMainWindow): def __init__(self): super().__init__() self.file = None self.ui = Ui_MainWindow() self.ui.setupUi(self) self.ui.mdopener.clicked.connect(self.opener) self.ui.transform.clicked.connect(self.trans) self.ui.trword.clicked.connect(self.tr2word) def opener(self): filePath, _ = QFileDialog.getOpenFileName(self, &quot;打开Markdown文件&quot;, &quot;.&quot;, &quot;*&quot;) self.file = filePath def trans(self): with open(self.file, 'r', encoding='utf-8') as f: html = markdown.markdown(f.read()) with open(self.file+&quot;.html&quot;,&quot;w&quot;) as f1: f1.write(html) QMessageBox.information(self, &quot;完成！&quot;, &quot;完成&quot;, QMessageBox.Ok) def tr2word(self): pypandoc.convert_file(self.file, 'docx', 'md', outputfile=self.file+'.docx') QMessageBox.information(self, &quot;完成！&quot;, &quot;完成&quot;, QMessageBox.Ok)if __name__ == &quot;__main__&quot;: app = QApplication(sys.argv) window = MainWindow() window.show() sys.exit(app.exec()) 下面是ui.py的内容: 1234567891011121314151617181920212223242526272829303132333435363738394041from PySide6.QtCore import QCoreApplication, QMetaObject, QRectfrom PySide6.QtWidgets import QPushButton, QSizePolicy, QWidgetclass Ui_MainWindow(object): def setupUi(self, MainWindow): if not MainWindow.objectName(): MainWindow.setObjectName(u&quot;MainWindow&quot;) MainWindow.resize(210, 168) sizePolicy = QSizePolicy(QSizePolicy.Fixed, QSizePolicy.Fixed) sizePolicy.setHorizontalStretch(0) sizePolicy.setVerticalStretch(0) sizePolicy.setHeightForWidth(MainWindow.sizePolicy().hasHeightForWidth()) MainWindow.setSizePolicy(sizePolicy) self.centralwidget = QWidget(MainWindow) self.centralwidget.setObjectName(u&quot;centralwidget&quot;) self.transform = QPushButton(self.centralwidget) self.transform.setObjectName(u&quot;transform&quot;) self.transform.setGeometry(QRect(10, 90, 191, 32)) self.mdopener = QPushButton(self.centralwidget) self.mdopener.setObjectName(u&quot;mdopener&quot;) self.mdopener.setGeometry(QRect(10, 10, 191, 32)) self.trword = QPushButton(self.centralwidget) self.trword.setObjectName(u&quot;trword&quot;) self.trword.setGeometry(QRect(10, 50, 191, 32)) self.trpdf = QPushButton(self.centralwidget) self.trpdf.setObjectName(u&quot;trpdf&quot;) self.trpdf.setGeometry(QRect(10, 130, 191, 32)) sizePolicy.setHeightForWidth(self.trpdf.sizePolicy().hasHeightForWidth()) self.trpdf.setSizePolicy(sizePolicy) MainWindow.setCentralWidget(self.centralwidget) self.retranslateUi(MainWindow) QMetaObject.connectSlotsByName(MainWindow) def retranslateUi(self, MainWindow): MainWindow.setWindowTitle(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;Markdown\\u8f6c\\u6362&quot;, None)) self.transform.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u8f6c\\u5316\\u4e3aHTML&quot;, None)) self.mdopener.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6253\\u5f00MD\\u6587\\u4ef6&quot;, None)) self.trword.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u8f6c\\u5316\\u4e3aWord&quot;, None)) self.trpdf.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u8f6c\\u5316\\u4e3aPDF&quot;, None)) 二、结语金山活该被骂，干的那点破事，大家众所周知。今天被拎出来骂一顿，是极好的事情，可以使它长长记性。WPS的服务本身就不好，加广告就算了，怎么能侵犯用户私人的数据呢？个人认为目前替代WPS的最好的解决方案应该是开源的软件，但这在商业与便民使用的领域又不现实。某种意义上来说，PDF应该是目前常规使用的最安全、最有效的办公易用格式了。","link":"/01/MarkdownConvertion.html"},{"title":"我最喜欢的 15 首歌曲","text":"1. Like a Rolling Stone by Bob Dylan我最爱的英文歌曲，无需用语言过多矫饰我对它的推崇。 When you ain’t got nothing, you got nothing to loose.当你一无所有，你就无所失去。 警世恒言。 2. Stairway to Heaven by Led Zeppelin这首曲子深深地震撼了我，以至于我听完之后写了一篇小说（即《施洗者的预言》）。曲子带着一股淡淡的忧伤，似乎是在为女士悲哀的一生哀叹。此外，吉米页的电吉他SOLO也是历史最佳。 In a tree by the brook, there’s a songbird who sings.溪边树上，夜莺正吟起曲。Sometimes all of our thoughts are misgiving.有时人们总是囧于思虑。……Dear lady, can you hear the wind blow?亲爱的女士，你能否听到那骤起的风声？And did you know? Your stairway lies on the whispering wind.你知道吗？你的天梯，就在那宛若耳语的风中。 3. Norwegian Wood by The Beatles我在高一的时候度过了相对比较悲伤的时光，当时我重读了村上春树的《挪威的森林》，读了之后更悲伤了（笑）。里面的两位女主角我怎么也忘不掉，我后来的很多小说中的女角色都是对她们俩的复刻。我突然想起我竟然还没听过那两首《挪威的森林》，于是我先听了伍佰的，然后听了披头士的。 And when I awoke, I was alone.This bird had flown.So I lit a fire.Isn’t it good, Norwegian wood? 4. 东方怪奇谈 by 上海爱丽丝幻乐团这首歌是我对于三味线音色的初体验，不断重复的同一段旋律令我联想起ZUN的一段乐评： “坦白说，13年感觉就像一瞬间的事。不能碌碌无为地虚度年华。转瞬间精力和体力都被夺去了，剩下的只是如铅一样沉重的梦。那是连三途川也不能渡过的重金属一样的灵魂。好像谁曾说过死亡会平等地访问每个人？我感觉至少人会因为他的生活方式而成为别的生命。” 我奔跑着，直到无法喘过气息。最胆怯的我，对这个乐园充满恐惧。虽然这都在我的预料当中，但无论跑到何地，我依然找不到归途。 我所想念的人都已消失，支撑我生存下去的理由也已丧失，所以我带着沮丧把绳子绕过粗枝，并引颈上吊。 ……为什么我还有意识？是绳子太脆弱了吗？…… (专辑附带文本) 5. 夢幻回廊 by ZUN我在听这首歌的时候，我在想什么呢？想我之前犯下的错误吗？我是否是在忏悔呢？这首曲子没有任何描述，没有任何附带文本，只有“梦幻回廊”四个字符，承载了文字的全部叙事职能。流动的钢琴音符，工整的背景鼓点，让人害怕，仿佛置身于幽闭的空间之中，沉沉睡去…… 6. The Good, the Bad, and the Ugly by California Guitar Trio《正直者之死》的灵感来源，听这首歌时，可以试着闭上双眼，感受子弹从耳边呼啸而过，你置身马上，祈祷自己不会在下一秒成为流弹之下的亡魂。这个版本的吉他音色比起原版的口哨音色对我来说更加耐听。Ennio Morricone 真不愧是电影配乐大师。 7. Comfortably Numb by Pink Floyd曲中包罗宇宙万象的电吉他SOLO，令人不禁思索，自己是否真的“舒服地寄了”。这也是我的前摇入门曲。 When I was a child I caught a fleeting glimpse,out of the corner of my eye.I turned to look but it was gone.I cannot put my finger on it now.The child is grown. The dream is gone.I have become comfortably numb. 8. (I Can’t Get No) Satisfaction by The Rolling Stones这是滚石的第一首美国冠军单曲，听这首歌感觉就是纯粹的爽，跟隔壁深紫的《公路之星》一样。 9. The Sound of Silence by Simon &amp; Garfunkel伟大，无需多言。 People talking without speakingPeople hearing without listeningPeople writing songs that voices never shareAnd no one daredDisturb the sound of silence……And the sign flashed out its warningIn the words that it was formingAnd the sign said “the words of the prophetsAre written on the subway walls and tenement halls”And whispered in the sounds of silence 10. Dream On by Aerosmith第一次听到这首曲子其实是在卡拉苏的《电棍：Dream On》，二创版本其实对我影响更大，但是我没有办法在网易云音乐听到卡拉苏的作品，所以听了原版，后来也越听越喜欢了，慢慢成为了我的生活必需品。 Sing with me, if it’s just for today.Maybe tomorrow the good Lord will take U away. 11. Hotel California by Eagles长达两分钟的前奏，不知道还以为是前摇，但听着真的爽。而歌词的内涵也相当丰富。 Last thing I rememberI was running for the doorI had to find the passage back to the place I was beforeRelax, said the nightmanWe are programmed to receiveYou can check out any time you likeBut you can never leave 12. A Day in the Life by The Beatles省流： “Nobody was really sure if he was from the House of Lords~” “I’d love to turn you on~” “乱鸣的交响乐.wav”别的我说包罗万象可能是在夸张，但是这首的交响乐是真包罗万象，听完之后感觉大脑被开启。 13. All Along The Watchtower by Bob Dylan我还是更加偏爱鲍勃·迪伦版本的，尽管吉米·亨德里克斯的翻唱在很多人看来更加“好听”，但是迪伦版本的悲壮是无法模仿的，吉米疑似过于热血了。 Outside in the distance a wildcat did growl.Two riders were approaching, the wind began to howl. 14. 雪月樱花之国 by 上海爱丽丝幻乐团七分雪色，三分月色，我正候着樱花烂漫的时节，像黄帝一般在梦中造访雪月樱花之国……如诗如画的曲子，我的几句话是道不尽它的美的，它就像德彪西的《月光》一样，以一种印象存在于我的脑海之中，或者说，像吉米·亨德里克斯的紫烟……作为一个地点，它又是一个我回不去的故乡，像约翰·列侬的草莓园。总之，《雪月樱花之国》是一首我不可能忘掉的曲子。 15. Flamingo by 米津玄师对，不是《Lemon》，也不是《沙之星球》、《打上花火》或者《灰色与青》，是这首《Flamingo》。即使我很长时间没有听它了，它仍然是我听的最多的歌曲。 笑えない このチンケな泥仕合笑不出来啊 互揭丑事真是恶俗 Honorable Mentions 百鬼夜行 / 灰色与青 by 米津玄师 November Rain / Sweet Child of Mine by Guns N’ Roses 一丝不挂 / 富士山下 by 陈奕迅 The Wonder of You by Elvis Presley 东之国的不眠夜 / Demystify Feast by 上海爱丽丝幻乐团 Close to the Edge by Yes Shine on You Crazy Diamonds by Pink Floyd Bohemian Rhapsody / Made In Heaven by Queen 谁伴我闯荡 / 灰色轨迹 by Beyond Smells Like Teen Spirit (少年心气) by Nirvana","link":"/01/MyFavSongs.html"},{"title":"金阁寺的一块天花板","text":"那天上午，我在金阁寺散步时，看见了一个蓬头垢面的乞丐，躺在一个双肩包上，那个包里面满满的，好像要鼓出来。我试图装作没看见他，快步地走过，但我听见一个声音，好像来自于他，但他没有开口。那声音说，“年轻人，能帮我做一件事吗？” 我看向四周，这条小道上没有别的人。我想问他，但话到了嘴边又被咽了回去。我转向他，用食指指向自己的脸。他哑然失笑，以一种几乎注意不到的角度点了点头。 “那我要帮你些什么呢？”我同样地感到很可笑，终于忍不住问道。 “去鸠山的玉泉，帮我打一瓶泉水来。”他静静地说，“倘若你带着那瓶水回来，我就给你二万日元的奖励。天下可寻不到第二桩这样的美差了。”在他从包里拿出二万日元的现钱前，我将信将疑，事实上，我看见他的包里满满地全是现金，略有些心悸，他不会是银行抢劫犯吧，让我干这莫名其妙的事情，不会是要洗黑钱吧？不过当我看向他平静的面庞时，一切疑虑都烟消云散，一个要设计害人的人的表情不会这么平静，起码我是这么想的。 “玉泉在哪儿？”我如是问，他的目光放空，散向远方。 “沿着行步道，你一直走，不要停下。直到看见一条三岔路，左边那条充满泥泞与未完全化作泥泞的草木和落叶，就走那条。你会听到蝉声呜呜，但不要忽视风声，唯有那被忽略的当作背景的风声，才是指明通向你理想道路的信标。总而言之，走过那些落叶时感受因它们的凋落而得以保留或因而消逝的生命，然后透过木叶的间隙看那雄伟城市的高楼广厦一点一点地向后下坠。在城市的影迹完全消散之后，向林子的西边走，直到你看见一条小溪，顺着它的水流向下行。你看见它时，会抹去汗迹，暂且于原地停驻，带着微笑，走向凸起的白岩间生出的另一条溪流，那就是玉泉。”他仿佛身临其境，时而欢欣时而伤感地说，“抱歉，中间有点跑题了。” 我沉默不作声，他恍然大悟似地掏出几千日元给我，我接了过去，问他：“你怎么知道我不会拿了钱就跑？” 他从容地说：“你会回来的，如果你看见了玉泉，你会为了得知新生疑惑的答案再一次来见我。” “如果我连玉泉也不去呢？”我说着，不自觉地向左上方臂，我知道我会去的，我只是习惯性地问。老实说，我刚说出口，就已经有些后悔了。有的时候话语已经说出口了，人们才会想要弥补、收回。 “你记得我说过的那句话吗？或许你就像他们中的许多人一样，将一切解构直到只剩下有用信息——例如‘路线’为止——但那些被你忽略的词藻，也时刻在以你所没有想象过的方式影响着你……”他语毕，挥了挥手。他递给我一个看起来很普通的矿泉水瓶，示意我可以走了。我便沿着小径离开，脚步扬起尘土；走出山门，回入尘嚣，遁入林中……越过门槛，跨上石阶，峰回路转，我终于看见那个三岔口，我向左转，走进泥泞小径。没有鸟鸣，蝉声像合成器生造出的，蕴着一种令人急躁的情绪，像霓虹灯或短视频中常出现的那种公式化音乐，连名字也被剥夺了，被人们称为“XX神曲”。我沿着溪流向下走，已经忘却了自己走了多远，我实在走不动了，找到了一棵大树坐下来。我闭目养神，却看见一片模糊的橙红。 我睁开双眼，向四周看，似乎有什么东西唤醒了我，大概是风吧。我站起来，却发现白岩砌成的玉泉，就在自己的不远处。我走上前去，拧开瓶盖，装满了一整瓶，我可以回去交差了。但我倒也没有这么早走的意思，天色未晚，他也没有给我一个时限。我一边在山间随意地走着，一边端伴着在瓶中折射着光的泉水，并没有什么特殊之处，也因此我愈发好奇自己手中之物究竟是什么。 我闻到一股我一开始忽略，却在恍惚中又重新发现的香气。它透过风传到我的鼻尖，如罂粟一般将我的四肢麻醉，我转过身去，发现它来自于玉泉。拧开瓶盖，香气愈发浓烈，我仿佛意识到了什么，但我已经喝下了第一口，一切都太迟了。鸟鸣开始从各个角落传来，落叶从地上缓慢地爬回树上；没过多久，狼与水獭的尸体从树上长出来，土地化作了透明的大块塑料，我能看见蛆和蚂蚁在其间穿过。 我抬起头，看见空中飞翔着一群长着木棉翅膀的人，他们像大雁一样向南飞行，影子投射于明治时代，大正年代和战国时代的贫民窟上，从其中走出成群结队的忍者，妓女，俳谐师与鬼，他们都向着远方的一座建筑行去。 这个“金阁寺”与自己印象中的位置不同，色彩与结构也不尽相似，但我的直觉告诉自己，那就是金阁寺。而自己身后的这块巨大的白玉，便是鸠山。 我想问他们些什么，但那些将自己打扮得与日本人一模一样的人却完全无法理解日语，且从表情来看，比我还要疑惑一些。我在内心里反复问自己真实对自己究竟意味着什么，究竟是与现实本身足够像，还是一种细节的充足和丰富。我倒是认为是前者，因为有些时候，你能意识到有些感觉仅凭借感官是感受不到的，过量的信息只会使我犹疑，我能看见不在我视野范围内的色彩，我在做梦，在幻觉中，但这并不妨碍我的清醒。 远方的飞艇上，资本家们享受着美酒，看着背负着十字架的圣人，听着他身后的信众们的悲鸣。他们走向鲜血淋漓的沙滩，两个马背上的骑士手执“沙漠之鹰”手枪，看着彼此的眼睛，食指在扳机上滞着，我看见金阁寺的中堂之上，那具没有脸的金色神像用手势示意我向上看。我看见一块楠木制的天花板，没有接缝，也没有钉铆，却像一块棺材板，将光明挡在寺院之外，但声音却能够传进来，爆炸声，破碎声，呐喊声，血肉飞溅的声音…但那些都只是前奏，因为骑士们还未开始决斗。 子弹在枪声之后抵这铠甲之上，骑士们自知这不过是徒劳，不过是象征。我的身体逐渐上升，与楠木板化为一体，我品味着DNA被修改，细胞膜之外长出一层细胞壁的感觉。子弹在铠甲上留下痕迹，裂痕，空洞，正与在天花板上出现的那些一样，两个骑士拔出长剑与矛枪，马同他们一样身穿白色的钢甲，四把兵器僵持在一起，坐骑追逐着彼此之尾围绕着某个中心旋转。战斗的悬念似乎只剩下谁先漏出破绽。 金阁寺在破碎，漏洞越来越多，号角响起，地震与火山喷发将已经被完全同化的我的意识再度唤醒。风声逐渐变调，几近崩坏，仿佛一位指挥家成心让自己的交响乐队越奏越跑调，激烈的震动刺激着我那已不存在的耳膜，或者说它存在，我能感受到它。空洞扩大融合，最终占据一切，我的视觉已完全模糊，仿佛有什么东西捣烂了我的眼睛，我只能看见血红色与黑白灰。在天花板彻底在炮火中消弭之后，我的身体随着硝烟飘上天空，我的灵魂坠入断壁残垣之中。 我睁开双眼，幻境戛然而止。我躺在我自己的床上，被子盖的很严实，我向右方看去，却发现那个矿泉水瓶正摆在桌上，里面的液体只剩下三分之二。 我爬起来，意图将它倒掉，但我犹豫了：既然他想要它，那我便将它带给他吧。 我穿好衣服，简单洗漱，冲出三十平米的家，以最快的速度跑到车站，再过几秒就赶不上趟了。我走进山门，顾不得与熟识的僧人闲聊了，我走进那条小径，看见他仍旧躺在那个角落。 他说：“你来了。”他的语气十分平淡，似乎有些刻意地显出漫不经心。 他把钱付给我拿走了瓶子，有些失落地说：“所以你喝了，对吗？”他的双眼对上我的双眼，他坐起来。 “是的。”我尝试不去看他，我不知该怎么说谎，所以只能将真情实况向他透露。 “那你感觉如何？”听到这个问题，我怔住了，我不知该怎么回答，也不确定他能否理解。 “有些分裂，充满了现代和神代的象征和符号，是分裂而发散的…总是能感受到好几件事情同时发生，但每当我想要细究某一部分的时候，整个幻境就变得像一个音画不同步的视频一样。”我摊开双手，比划着尝试解释。 “音画不同步？”他的语气中带着一些惊愕，我所说的话，似乎完全不在他的意料之内。 “是的，有的时候仿佛音轨被冻结，而画面却在持续运转。而在第一个幻觉的最后，我的身体被金阁寺的天花板同化统一，归为一体时——”我沉浸在回忆里，那如同沙海一般令人窒息的幻觉中。 “等一下，第一个幻觉，你还做了第二个？”流浪汉惊讶地问道。我默默地点了点头。 “是的，我不记得具体的细节了，但总之在我快要醒来时，我突然想起了自己儿时曾瞥见的一个幻影，回过头时，它却已经消失了，我突然感一种怅然若失的感觉，就像那时一样，所以我喝了第二口。” 我感觉我被卷入一个巨大的旋涡中，下方的指针在逆时针旋转，纸片飞向日历，破碎的黑胶唱片重新聚合到一起。我听到鸣笛声，仿佛有辆列车即将到达，我的灵魂被卷向笛声传来的地方。 我在车站的长椅上醒来，她坐在我的右侧，我睁开眼时，夕阳的余晖经过我泪水的折射化作了重影。她要走了，很可笑的是我没有理由挽留她，或者再见她一面，到现在我还在犹豫要不要说。 “我…我…我的脑海中涌出无数言语，我的思维飞快地搜索着，像仙鹭掠过血流成河的沙海。 “嗯？”她转过起来，太阳正从西方冉冉升起，但我没有在意这反常的预兆。 “我讨厌沙子，它很粗糙、干涩。它流动的样子令人不安，它不是一个整体，是散开的破碎的无机质。”我已经不知道自己再说什么了。 “我没听懂，你…你想说什么，约翰？”她十分疑惑，一只水鸟飞过她的身畔，它先前被烟雾染为黑色。 “我不知道，忘了刚刚那句话吧。”我还是把我的话语咽进了喉中，听见右方逐渐传来鸣笛的声音。 “话说，洋子会喜欢什么类型的男生呢？”在她上车前，我最后问了一句，她略有些茫然，不知所措。 “会干出各种不可思议的事情的那种人吧，在金阁寺演奏交响乐之类的，光是想也觉得过于光怪陆离的诡异，不对，这么说似乎有点不太好…我在说什么呀，哈哈。”她说着说着，苦笑起来。 “好的，我明白了。” “你不如忘了我刚才那番话，要是你真有那方面的想法的话，我倒是建议你付诸行动。”我帮她将箱子抬上列车，她向我挥手，我转过身去。 列车的轮子逆着旋转，仿佛在暗示我些什么，我再一次并没有理会这暗号，而是看着空中北去的白色水鸟，想着一袭白裙的洋子，想着她以英文名称呼我的习惯，想着元旦那次与她一起去金阁寺赏景的经历，还是不久前的事。得益于刚才的对话，我现在闭上双眼就看到一片沙海，真是叫人恶心。 这都是好几年前的事情了，如今我依旧是孤身行在涩谷的街头，这华灯璀璨的世界里充盈着歌妓与醉汉，他们越醉，越觉得自己清醒，时不时地还要口占几句“名言警句”出来，什么“空虚是性感”，“她其实早就死了”之类毫无来由、莫名其妙的话，以至于东京电视台还给他们办了个综艺节目，还派出记者去与他们对话，来收集这些胡话。实话说，这也不怪他们，在靖国神社倒塌之后，已经很久没有什么大新闻了。 忽然，我听见披头士乐队的《Strawberry Fields Forever》，那声音从一家叫做法厄同的小酒馆里传出来，于是我暂且留步，只为了将第三节听完。 Always, no, sometimes, think it’s meBut you know, I know when it’s a dreamI think I know, I mean—er—yes, but it’s all wrongThat is, I think I disagree 我眼里不禁涌出了泪水，上一次听到这首歌还是什么时候来着？我不记得了，回忆只会让生活更加艰难，有时我想，会不会闭上双眼，一切都会好起来。我下意识地否认这种可能，但我想起在某一个遥远的午后，我似乎已经做出了这个选择。小雨逐渐变大，和着雨声，疯癫的酒鬼们开始和着雨声胡言乱语，我只好走进电话亭避雨。 我看向电话，犹豫着，拨通了洋子的电话。我问她在哪儿，她说她回东京来办事情，雨下的很大。她又问我在哪儿，我说我也在东京，她笑了，说听雨声也听得出来。我问她要不要出来聚一聚，她却没有立刻应答，我只能听得见背景里的雨声。良久，她沉静地说，要不就金阁寺见吧。我应允了，然后她放下电话，我沉浸于电话挂断时的长音中。 我走出电话亭，我看见一个流浪汉举起左手，右手擎着一个银质的烛台，他看见我，微微一笑，用左手比了一个噤声的手势，烛火在雨水的阻挠下持续燃烧着，跳动着，从其中跳出沙海的影子，似乎提醒了我些什么。被火焰吞噬之前，存在于沙海所在之地的是一座森林；这又怎样呢？我尾随那个流浪汉走到我居住的公寓，他将蜡烛放在了我家的门口，约莫仅剩三分之二的烛身还未被火焰侵蚀殆尽，雨突然停下了，烛火也熄灭了，他隐入了影中。 他让我噤声，但我必须开口。因为此刻她正站在我面前，我的背后是僧众们组成的交响乐团，我只要抬起头，就可以看见金阁寺的那块天花板。我意识到有什么不对，我睁开双眼，却看见紫金色的木条相错构成的“镜天井”。我看向她的眼睛，开始了演奏。 我们演奏的曲目是披头士乐队的《A Day in the Life》，观众们似乎对这首曲子不是很熟悉。那天天气很好，但我因为前一天晚上过多的睡眠而感到疲惫。眼泪映出鸠山的草木，白石间流出的泉水和泥泞小径旁的溪流，我听见风声里夹杂着流浪汉的声音，他告诉我，到时候了。我看着她，愈发紧张，于是我闭上双眼，却看见火焰燃烧于沙海之上，烧出一片净琉璃，琉璃之下，掩埋于沙间的骨骸显现。僧众们的乐声逐渐跑调，我尝试将一切拉回到调子上，但我无能为力，我想起我曾经尝试过将每一个做过的梦都装在氢气球里，用绳子绑起来。指挥棒从我的手上滑落，我睁开双眼拾取，火焰却从我的幻视中腾起，将金色的楠木染上乌黑，人们一哄而散，但火焰的蔓延太快，寺院古老的木质结构并没有坚持多久，许多人被埋葬在了被倾覆的寺院中。 “洋子，洋子！”我没有找到她，她在哪儿？ “救我！约翰！约翰！”我听见她的声音，它来自一片废墟，我将倒在其上的柱子移开，但那里面什么也没有，我又听见她的声音，来自风的方向，于是我又转过头去，却发现身后什么都没有，只有她的声音悠远地、永久地回荡，我跪下，用双手捂住脸，不知所措。 黑色的烟尘逐渐出现，紧接着是一场由外到内的爆炸，那炸弹在完成爆炸之后，又回到了美军的飞机上。我躺在地上，承受了爆炸之后，再也无法起来，我只能静静地看着木片们逐渐回到原来的位置，构成一块完整的天花板。终于完整了，骑士们的长矛穿过了彼此的盔甲，他们杀死了彼此，鲜血从伤口中喷涌而出，我逐渐感受到一种失重，我的灵魂长出了一对木棉的翅膀，正在飞离我即将完全地化作无机质的身体，于是它就很识趣地躺在原地，流着血微笑，目送着我的灵魂越过天花板…… “讲完了？”在我久久地沉默后，他问。 “讲完了。”我点了点头。 “嘛，先让我来一口。”他为了清醒地听我说完我在幻境中的故事，忍住了没有去喝玉泉之水，现在他终于如愿以偿地拧开瓶盖，“你说说看，真实的体验和虚拟的体验是否都算是一种经验，如果是的话，那么生活在幻觉中和生活在真实中就没有什么区别。” “那你更推荐我活在哪种生活中呢？我应该回去吗？还是说跟你一起在这里过这样的生活？”我问他，但他喝下玉泉之后一直在喃喃自语，我能听懂他语言里的几个词汇，串在一起却毫无意义。 在我离开金阁寺的一刻钟之后，他喃喃地说： “在这里又怎样呢？回去又怎样呢？” 氿月 2024/7/15","link":"/01/MirrorsOnTheCeiling.html"},{"title":"脚本哲学(1) Minecraft 服务器区块与备份脚本","text":"开始之前我好久没写技术类的推文了，原因很简单，我有些跟不上大伙的节奏，我技术力过于低下。但仔细想想，发一些技术文章还是可以精进自己的技术的，于是便打算重新开始，于是就有了这么一个新系列，叫做“脚本哲学”。 另外，在最新的决定中，我将这个博客分为了三个网站，一个是本站，主要发技术文章；一个是 Legacy，是旧物的堆积地；以及 Memoria ，是我与远冬的文学博客。《御伽之国的鬼岛》《白银树之恋》等文章已被迁至 Legacy。《日记八集》中的部分篇目，已被永久删除。 要求与解析这次是接了一位好朋友的单，他的要求很简单，每隔6小时，将 world 文件夹的每一个变动的文件都复制到 backup 文件夹的压缩包中以达成备份。 那么首先是造个backup文件夹（如果已存在还要处理错误），用 watchdog 看着，然后再在每一次侦测到 Snapshot 改变的时候复制到 backup 文件夹的 zip 文件里。非常轻松。 代码部分如下： 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152import timeimport osimport watchdogfrom watchdog.observers import Observerfrom watchdog.events import FileSystemEventHandlerfrom watchdog.utils.dirsnapshot import DirectorySnapshot, DirectorySnapshotDiffimport zipfileimport sysimport threadingclass HD(watchdog.events.FileSystemEventHandler): def __init__(self, aim_path): super().__init__() self.timer = None self.aim_path = aim_path self.snapshot = DirectorySnapshot(self.aim_path) self.second = 120 def checkSnapshot(self): snapshot = DirectorySnapshot(self.aim_path) diff = DirectorySnapshotDiff(self.snapshot, snapshot) self.snapshot = snapshot self.timer = None if not os.path.exists(&quot;./backup&quot;): os.mkdir(&quot;./backup&quot;) zip_file = zipfile.ZipFile('./backup/%s.zip' % (time.strftime('%Y-%m-%d-%H-%M-%S',time.localtime())),'w') for x in diff.files_modified: print(x) zip_file.write(x, compress_type=zipfile.ZIP_DEFLATED) zip_file.close() def on_modified(self, event): if self.timer: self.timer.cancel() self.timer = threading.Timer(120, self.checkSnapshot) self.timer.start()def observe(path=&quot;./observing&quot;, timer=120): observer = Observer() observer.start() event_handler = HD(path) event_handler.second = timer observer.schedule(event_handler, path, recursive=True) try: while True: time.sleep(timer) except KeyboardInterrupt: observer.stop() observer.join()if __name__ == '__main__': observe(path=sys.argv[1], timer=int(sys.argv[2])) 用例及仓库1python3 main.py {侦测的目录} {Snapshot间隔时间} 仓库地址：(GitHub)[https://github.com/Lafcadia/MCServerBackup] 后记脚本需要可复用性，为了省事而直接在脚本中设定 path 和 Snapshot 时间间隔是不可取的。 顺带一提，我得蹲着服务器等好几个小时才能知道这东西到底有没有生效，当然最终的结果是有效。就目前而言，朋友疑似相当满意，证明了它的效果还不错。","link":"/01/PhiloScriptPart1.html"},{"title":"行步于夜晚的白鹭城","text":"亲爱的犹大： 我最最敬爱的叔父，我很高兴收到你的信，我最近过的很好。在61号公路与你告别之后，我去了土耳其，几周前我到了京都，又乘坐东海道到了姬路。尽管白鹭城与几个世纪前的她相比起来，略显苍老了些，但是我仍然能认出她的模样。毕竟，尚存与这世上的，再没有什么能比那如同仙鹭一般立于丘峰之上的古堡更能令我身心愉悦了。相较于我前些日子造访过的君士坦丁堡，这里游人很少；只可惜我到的时候，樱花已凋敝，我走近树下，嗅到甜蜜而酸腐的气息，抬起头望，青叶隐天蔽日。 在京都时，我与熟人打听了一下。我们曾看到的金阁寺之景已在一九五〇年作了旧，我们曾见证的存在于过去的整体分裂成了碎片，他们执着于东拼西凑，用尽了借口和计谋，却没法把一切归回原始状态。我造访金阁寺时，在一条小径上，看见了一个衣着体面的青年在埋葬一个流浪汉，我问他这个流浪汉是谁，他说他也不知道。流浪汉的脸上逐渐浮现出一种释怀的笑，他还没死，我想提醒青年，但青年却做出了一个噤声的手势。于是我没有出声，看着他庄重地埋葬了一具活着的尸体。他从包中掏出一瓶水，他开启瓶盖，我诧异地闻到了狄奥尼索斯之酒的芳香。与其他饮用那甘泉的人一样，他舒服地麻木了。他也成了一具活着的尸体，只不过没有人去掩埋他罢了。无间之钟的音响从金碧辉煌的断瓦残垣间传来，我知道我得走了，这里并没有我要寻找的东西；空旷的人群与那音响相和；我感到坚定，我要离开金阁寺，我要离开日本，去下一个目的地。 在我离开日本之后，我看见了一条X上的讯息，一个维特鲁威人发了一个视频，是一个10岁左右的小孩，被一个巴尔巴厘安士兵打的血肉模糊，下巴骨被整个拆下；即使他还能存活，他的后半生已经无法以常人的方式进食，这种伤害是永恒的，他生不如死。那个维特鲁威人声泪俱下地说，大总统只是被击中了耳朵，但在萨迦，一个小时就有四五十个人在空袭中遇难；但人们关心大总统，而不关心那些死去的人们。但很多人保持冷漠，我实在想不到为什么。 现在道德这东西好像不时髦了，像我这样的老东西可能完全理解不了什么是“道德相对主义”、“道德虚无主义”之类的词汇，从一些人提起它们时的腔调来看，我怀疑他们是在找借口。我记得约莫两千年前我们头一回去伯利恒的时候，也听耶稣讲过一些类似的阐释道德的话（或者完全相反，我那个时候还听不懂加利利那块的方言，讽刺的是，他死后我才学会），但是耶稣是个更加有魅力的人，我能听他唠上好久，尽管有时候我一句话也听不懂。我怀疑大总统的很多粉丝们也是像我这样的，他们在台下，大总统在台上，大总统说一些令人费解的话，然后他们在下面欢呼雀跃。那几本《福音》八成就是这么写出来的，当时的人们不懂，但是听着很积极和振奋，他们把这些令人们亢奋的话语记录下来，祈祷以后大伙读到这些的时候也能得到相同的感受。 但是耶稣走了之后过了一千多年，他们读那些令人振奋的话语时并不感到亢奋，而是感到的是一种与欲望完全相反的东西，这种东西让他们用看不见的绳索把自己绑住，像我们那次去拜访那个吓人的萨德侯爵时，他所描述的那种东西一样——他认为在不远的将来，也就是现在，人们将禁止自己的欲望，同时禁止别人产生欲望；在这样的冷冰冰的世界里，最温暖的地方将会是地牢。为什么人们要给自己套上一层层枷锁才能感到温暖呢？ 我相信叔父您也在数千年的“行走”中注意到了，这个时代的人们将古早的人们当作精神的寄托，以他们的信徒的名义向他们忏悔，我认为这是好的，是没有什么坏处的。但是有时我们会看到“好人”和“坏人”干着相同的事情，他们在犯下最伤天害理的过错之后，只需要向自己信奉的那一尊神像忏悔，就可以放下心里的道德牵挂了。第二天，他们就可以从不安中走出来，去干又一件骇人听闻的事。 离开的前天晚上，我行步在白鹭城，星辰隐去了身形，远处有人在用手电筒打暗号，我裸着双足，在草地上走着；我触摸着墙壁，道别着前进，却发现一道数百年前就已存在于鹭翼之上的伤疤。过了这么久还没愈合吗？或许永远都愈合不了了。我释怀了，便试着同你一样向前走。 有时我也在想，我们追求美好的品德，究竟是为了什么。我想并不是因为我们坚信善必将胜过恶，可能几千年前我还信邪不压正，现在可得另说了。我们追求“善”，只是因为“善”是好的，而且大概没有什么能比它更好，这就足够了。即使是在这样的时代，我依然选择在接下来的日子里追求“善”，直到我漫长生命的尽头。 爱你的以扫 2024年7月4日 亲爱的以扫： 我至亲至爱的侄儿，我收到你的信已经有十几日了，但我前几日在你父亲以色列的坟墓里工作，我在查看是否需要修缮他的墓穴。他生前曾与我说，他希望在他死后，人们可以带走他罪恶的遗产，只留下他美好的，与他一同埋葬在六尺之下；我非常高兴地发现事实恰恰截然相反，秘宝和文物不翼而飞，但债券和尸体永远被压在了石棺中。我想他应该也无法因此来责怪我，毕竟我没有动过他的一分一文。 你说得对，现在的世道确实变了，一切的语言都被构造成了武器和监牢。有些人过去为了发泄而发声，而现在为了发声而发泄；因为在这样一个时代，一切有意义的语言都会被审查，但他们迫切地想要别人听到，因为再没有人听到自己的声音和思想，他们就要窒息在渺茫的空虚中了（我觉得与你在信中写的“空旷的人群”有些类似）。但若是别人听到的只是一个人无意义地喃喃，那他的发声还有意义吗？没有，但是他仍然可以沉浸在自己享受了发言权利的喜悦，以及“被听见”时所产生的自我安慰中。他们的语言已经沦为了一种象征，而这种象征很难再被称之为语言。 我或许与你提起过，你或许已经忘了；在漫长的行途中，我最欣赏的旅伴是克里斯蒂安·罗森科鲁兹，他在短暂的一生中同我们一样在大地上行走，将东方的智慧带回西方，尽管他并不一定是对的，但是这种行为很值得钦佩。但这种方式在现在已经不适用了，现在的人们环游世界，却无法从其他文明的身上获得问题的解决方案，正是因为他们面临着同样的问题。 有人说狄奥尼索斯之酒，就是献祭时流下的鲜血酿成的；大祭司将木杖敲入白岩，裂缝之间就会流出红酒；暴君举起军刀，大地之上就会血流成河。很不幸的是，人们仍然在重复他们几千年前的生活方式，他们将活人献祭给“神”，但那个神不再是主，而那个被献祭的也不再是亚伯拉罕的儿子。在和平中的人们沉浸于幻觉中，这致幻剂却恰恰是由鲜血酿成的。但最显目的赤诚者的鲜血，到最后也只是血迹，消磨了，又容易被人遗忘。 我在鹿岛神宫的时候，曾经碰到过一位故人。那天的天空是金橙色的，云莫名地透出青白的光。他要走了，我劝他在离开之前回家乡一次，他反问我我有多久没有回到过迦南了。我那时才意识到我已经忘却迦南了，他又指向远方的楼宇，说他的家不知多少年前就被碾碎了，那一座座破旧阴湿的小屋现在可能连残存的木屑也找不到了。在他还有余力的时候，他总是抽出时间从异乡回到常陆，在混凝土铸成的高墙的缝隙间寻找着某种缺失的东西。他很确信自己的家就在这些缝隙之间，城市用空虚来填满自己，空隙反而成了唯一有意义的东西。他现在不这么做了，因为缝隙已经被填满了，他只能幻想，或许还有些东西存在于六尺深下。我与他告别之后，我乘坐着东海道到了京都。 在东海道上，我品鉴了歌川广重的《东海道五十三次》，用塑料模仿的景色永远无法比拟它的美，虽然我知道其中的许多细节都只不过是广重想象出来的，但我宁愿相信他的想象，也不愿意相信现代的所谓高清复原。或许这是我的一种固执，我相信最能理解的就是你了。遗憾的是归时已入夏日，春之雨和雪晴的景色我都没看到，有些可惜。我发现日本的景色就是短暂的，或许正是美好的短暂，才催生了歌川这样能用深邃的双眼捕捉下珍贵一瞬的艺术家。在最后一程，我合上画册，睡了一觉，梦里的世界很美好，绿意盎然的断崖在远方静静矗立，蓝天白云被青绿淡黄色的枝叶掩住，千百种花在天地交界画出奇特的彩色曲线。远方的碧绿水潭由风打破沉静，涟漪一起，波纹不断。 我从睡梦中醒来，但不知为何。我睁开双眼，没有人呼唤我，且离到站还有很长一段距离。窗帘也是拉上的，拉开来，却发现赤橙色的炎阳，从蔚蓝色的大海之下升起，它映照着每一个人。莲台野，金阁寺，白鹭城，三条大桥，都从其被逐渐摧残消磨的历史和神话中走出来，沐浴在金光之下，我以往怎么就从来没有发现呢？或许走出困境的秘密，就在隐匿于这无尽发散的光与热之中。但我怎么也说不出口，不如就让这秘密弥散与沉默之中吧。 莫噤声，侄儿，天亮了。 爱你的犹大 2024/9/23","link":"/01/NightAtKamisato.html"},{"title":"The Grimoire of Chuishen ~ 2022摄影集·渝川","text":"一、前言我的这个摄影集是我去318国道自驾游时拍摄的，对应的游记应该会在8月出来 (2024.3.23 更新: 没出来)。 二、渝川 倾泻落雨的山城 映像的黄金轨道 风吹过暗色回廊 彩云化水墨渲染 汹涌而不复回返 问君能有几多愁 青天默默向昏黑 神明眷恋之高原 凡人的点点星光 p.x { text-align: center; color: grey; vertical-align: top; }","link":"/01/The-Grimoire-of-Chuishen.html"},{"title":"脚本哲学(2) WaterMello, 一款壬性化的《合成大西瓜》启动器","text":"前言我们学校有一款由某位已经离校的学长开发的，基于《合成大西瓜》代码的，名为“合成校长”的游戏，风靡一时。许多人想要制作一个自定义版本。于是我就决定把这个当作一个脚本来写。 解析 介于主要用户（即同学们）不一定有使用命令行的经验，所以设计一个GUI是有必要的。 此外，要能够直接启动游戏，意味着将生成后的游戏可运行在本地服务器上。 另外，要求用户提供裁剪到合适尺寸的圆形PNG文件，是不合实际的(我对此深有感触)，所以要自动剪裁图片到合适尺寸和格式。 另外需要多线程处理，防止程序未响应卡死。 代码以下为 main.py 的内容，我们默认原版游戏的源代码放置在 ./original 文件夹 (建议前往 WaterMello 的 repo 下载)。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175import contextlibimport osimport randomimport shutilimport socketimport sysimport webbrowserfrom PySide6.QtWidgets import QApplication, QMainWindow, QFileDialog, QMessageBoxfrom ui_mainwindow import Ui_MainWindowimport cv2from PIL import Imagefrom http.server import SimpleHTTPRequestHandlerfrom http.server import CGIHTTPRequestHandlerfrom functools import partialfrom http.server import ThreadingHTTPServerimport threadingdef start_thread(name, kwargs={}): thread = threading.Thread(target=name, kwargs=kwargs) thread.setDaemon(True) thread.start()&quot;规则：\\n1. 图片从小到大排列。\\n2. 生成按钮会在ready文件夹生成一个可以玩的版本的源文件；\\n而部署按钮会将这个版本发送到站点上，让你可以在线上玩。&quot;class DualStackServer(ThreadingHTTPServer): def server_bind(self): # suppress exception when protocol is IPv4 with contextlib.suppress(Exception): self.socket.setsockopt(socket.IPPROTO_IPV6, socket.IPV6_V6ONLY, 0) return super().server_bind()ext = ['.exr', '.webp', '.rgb', '.gif', '.pbm', '.pgm', '.ppm', '.tiff', '.rast', '.xbm', '.jpeg', '.bmp', '.png', '.webp', '.exr', '.jpg']comparison = [52, 80, 108, 119, 153, 183, 193, 258, 308, 309, 408]places = [ &quot;./ready/res/raw-assets/ad/ad16ccdc-975e-4393-ae7b-8ac79c3795f2.png&quot;, &quot;./ready/res/raw-assets/0c/0cbb3dbb-2a85-42a5-be21-9839611e5af7.png&quot;, &quot;./ready/res/raw-assets/d0/d0c676e4-0956-4a03-90af-fee028cfabe4.png&quot;, &quot;./ready/res/raw-assets/74/74237057-2880-4e1f-8a78-6d8ef00a1f5f.png&quot;, &quot;./ready/res/raw-assets/13/132ded82-3e39-4e2e-bc34-fc934870f84c.png&quot;, &quot;./ready/res/raw-assets/03/03c33f55-5932-4ff7-896b-814ba3a8edb8.png&quot;, &quot;./ready/res/raw-assets/66/665a0ec9-6c43-4858-974c-025514f2a0e7.png&quot;, &quot;./ready/res/raw-assets/84/84bc9d40-83d0-480c-b46a-3ef59e603e14.png&quot;, &quot;./ready/res/raw-assets/5f/5fa0264d-acbf-4a7b-8923-c106ec3b9215.png&quot;, &quot;./ready/res/raw-assets/56/564ba620-6a55-4cbe-a5a6-6fa3edd80151.png&quot;, &quot;./ready/res/raw-assets/50/5035266c-8df3-4236-8d82-a375e97a0d9c.png&quot; ] #感谢来自于 liyupi 的源代码: https://github.com/liyupi/daxiguadef circle(img_path, cir_path): ima = Image.open(img_path).convert(&quot;RGBA&quot;) size = ima.size r2 = min(size[0], size[1]) if size[0] != size[1]: ima = ima.resize((r2, r2)) r3 = int(r2/2) imb = Image.new('RGBA', (r3*2, r3*2),(255,255,255,0)) pima = ima.load() pimb = imb.load() r = float(r2/2) for i in range(r2): for j in range(r2): lx = abs(i-r) ly = abs(j-r) l = (pow(lx,2) + pow(ly,2))** 0.5 if l &lt; r3: pimb[i-(r-r3),j-(r-r3)] = pima[i,j] imb.save(cir_path) return cir_pathclass MainWindow(QMainWindow): def __init__(self): super(MainWindow, self).__init__() self.ui = Ui_MainWindow() self.ui.setupUi(self) self.file = [&quot;&quot;] * 11 self.ui.Opener.clicked.connect(self.opening) self.ui.Deployer.clicked.connect(self.deploy) self.ui.Generator.clicked.connect(self.generate) self.ui.Activator.clicked.connect(self.activate) self.ui.About.clicked.connect(self.showAbout) self.ui.Remover.clicked.connect(self.remove) self.ui.Ruler.clicked.connect(self.rule) self.ui.Starter.clicked.connect(self.start) self.ui.Deployer.setEnabled(False) if os.path.exists(&quot;./tmp/&quot;): self.ui.Starter.setEnabled(False) if os.path.exists(&quot;./ready/&quot;) == False: self.ui.Remover.setEnabled(False) def activate(self): def run(server_class=DualStackServer, handler_class=SimpleHTTPRequestHandler, port=8000, bind='127.0.0.1', cgi=False, directory=os.getcwd() ): &quot;&quot;&quot;Run an HTTP server on port 8000 (or the port argument). Args: server_class (_type_, optional): Class of server. Defaults to DualStackServer. handler_class (_type_, optional): Class of handler. Defaults to SimpleHTTPRequestHandler. port (int, optional): Specify alternate port. Defaults to 8000. bind (str, optional): Specify alternate bind address. Defaults to '127.0.0.1'. cgi (bool, optional): Run as CGI Server. Defaults to False. directory (_type_, optional): Specify alternative directory. Defaults to os.getcwd(). &quot;&quot;&quot; if cgi: handler_class = partial(CGIHTTPRequestHandler, directory=directory) else: handler_class = partial(SimpleHTTPRequestHandler, directory=directory) with server_class((bind, port), handler_class) as httpd: webbrowser.open(&quot;http://127.0.0.1:8000&quot;) httpd.serve_forever() start_thread(run, kwargs={&quot;directory&quot;: &quot;./ready&quot;}) def rule(self): QMessageBox.information(self, &quot;食用方法, 务必看完&quot;, &quot;&quot;&quot;初次启动需要“初始化”，之后不需要，然后“打开”一个装有11张图片的文件夹(其他什么都不要有)。点击“生成”，然后等待跳出“已完成”提示窗口。点击“启动”可启动游戏，部署功能还未写完，请勿使用。生成完毕的游戏代码在&quot;ready&quot;文件夹中，请保管好。如果要再次生成游戏，请点击“清除缓存”，这会导致上一次生成的游戏文件丢失，请保证自己已保管好。 &quot;&quot;&quot;) def start(self): os.mkdir(&quot;./tmp&quot;) QMessageBox.information(self, &quot;初始化完成&quot;, &quot;初始化完成。&quot;) def remove(self): shutil.rmtree(&quot;./ready&quot;) QMessageBox.information(self, &quot;已清除缓存&quot;, &quot;已清除缓存。&quot;) def generate(self): def go(): shutil.copytree(r'./original', r'./ready') for x in range(11): circle(self.file[x], &quot;./tmp/&quot;+str(x)+&quot;.png&quot;) img = cv2.imread(&quot;./tmp/&quot;+str(x)+&quot;.png&quot;, cv2.IMREAD_UNCHANGED) img = cv2.resize(img, (comparison[x], comparison[x])) cv2.imwrite(places[x], img) start_thread(go) def showAbout(self): QMessageBox.information(self, &quot;关于&quot;,&quot;&quot;&quot;WaterMello v0.1 Beta开发: 玄云海 OblivionOceanSpecial Thanks: liyupi, Fgaoxing.Enjoy the game, thy life as well. &quot;&quot;&quot;) def opening(self): correction = True filepath = QFileDialog.getExistingDirectory(self, &quot;打开装有11张图片的文件夹。&quot;, &quot;.&quot;) files = os.listdir(filepath) for f in files: _, a = os.path.splitext(f) if a not in ext: correction = False if len(files) == 11 and correction: for i in files: self.file[files.index(i)] = os.path.join(filepath, i) print(self.file) QMessageBox.information(self, &quot;成功！&quot;,&quot;已导入图片。&quot;) else: QMessageBox.information(self, &quot;出错！&quot;,&quot;图片数量过多/过少，图片后缀名错误。&quot;) def deploy(self): QMessageBox.information(self, &quot;我饿啦！&quot;,&quot;把这个功能吃了，下个版本还你们。&quot;)if __name__ == &quot;__main__&quot;: app = QApplication(sys.argv) window = MainWindow() window.show() sys.exit(app.exec()) 以下为 ui_mainwindow.py 的内容。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465from PySide6.QtCore import (QCoreApplication, QDate, QDateTime, QLocale, QMetaObject, QObject, QPoint, QRect, QSize, QTime, QUrl, Qt)from PySide6.QtGui import (QBrush, QColor, QConicalGradient, QCursor, QFont, QFontDatabase, QGradient, QIcon, QImage, QKeySequence, QLinearGradient, QPainter, QPalette, QPixmap, QRadialGradient, QTransform)from PySide6.QtWidgets import (QApplication, QMainWindow, QPushButton, QSizePolicy, QStatusBar, QWidget)class Ui_MainWindow(object): def setupUi(self, MainWindow): if not MainWindow.objectName(): MainWindow.setObjectName(u&quot;MainWindow&quot;) MainWindow.resize(315, 113) icon = QIcon() icon.addFile(u&quot;icon.ico&quot;, QSize(), QIcon.Normal, QIcon.Off) MainWindow.setWindowIcon(icon) self.centralwidget = QWidget(MainWindow) self.centralwidget.setObjectName(u&quot;centralwidget&quot;) self.Opener = QPushButton(self.centralwidget) self.Opener.setObjectName(u&quot;Opener&quot;) self.Opener.setGeometry(QRect(10, 50, 81, 41)) self.Generator = QPushButton(self.centralwidget) self.Generator.setObjectName(u&quot;Generator&quot;) self.Generator.setGeometry(QRect(90, 50, 71, 41)) self.Deployer = QPushButton(self.centralwidget) self.Deployer.setObjectName(u&quot;Deployer&quot;) self.Deployer.setGeometry(QRect(160, 50, 71, 41)) self.Activator = QPushButton(self.centralwidget) self.Activator.setObjectName(u&quot;Activator&quot;) self.Activator.setGeometry(QRect(230, 50, 71, 41)) self.Starter = QPushButton(self.centralwidget) self.Starter.setObjectName(u&quot;Starter&quot;) self.Starter.setGeometry(QRect(10, 10, 81, 41)) self.Remover = QPushButton(self.centralwidget) self.Remover.setObjectName(u&quot;Remover&quot;) self.Remover.setGeometry(QRect(230, 10, 71, 41)) self.Ruler = QPushButton(self.centralwidget) self.Ruler.setObjectName(u&quot;Ruler&quot;) self.Ruler.setGeometry(QRect(90, 10, 71, 41)) self.About = QPushButton(self.centralwidget) self.About.setObjectName(u&quot;About&quot;) self.About.setGeometry(QRect(160, 10, 71, 41)) MainWindow.setCentralWidget(self.centralwidget) self.statusbar = QStatusBar(MainWindow) self.statusbar.setObjectName(u&quot;statusbar&quot;) MainWindow.setStatusBar(self.statusbar) self.retranslateUi(MainWindow) QMetaObject.connectSlotsByName(MainWindow) # setupUi def retranslateUi(self, MainWindow): MainWindow.setWindowTitle(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;WaterMello&quot;, None)) self.Opener.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6253\\u5f00\\u6587\\u4ef6\\u5939&quot;, None)) self.Generator.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u751f\\u6210&quot;, None)) self.Deployer.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u90e8\\u7f72&quot;, None)) self.Activator.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u542f\\u52a8&quot;, None)) self.Starter.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u521d\\u59cb\\u5316&quot;, None)) self.Remover.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u6e05\\u9664\\u7f13\\u5b58&quot;, None)) self.Ruler.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u67e5\\u770b\\u89c4\\u5219&quot;, None)) self.About.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u5173\\u4e8e&quot;, None)) # retranslateUi 用例及仓库用法见软件内部“食用方法”。 仓库地址：GitHub 后记WaterMello 本身并没有受到关注，但是在班内，大伙非常喜欢我用它生成的“合成哟西”小游戏(架设在玄云海域名上)，甚至已经有了班内竞赛，而我是最高分纪录保持者。 作为“自己的游戏”的最高分记录保持者，这值得骄傲吗？(笑)","link":"/01/PhiloScriptPart2.html"},{"title":"寂白之间 第四章 腐水迷宫 Rotten Maze","text":"循环，再循环，再循环，我整夜深陷在这迷宫里走不出去。接着，我看见那从苍白中探出病怏的身躯的太阳从正西方升起。腐烂的水从四周涌上来，我意识到有什么不好的事情将要发生，然后那死水充盈了我的身体，我的肺，我以为它将亡我，但它只是再推我一把，将我完全地推离这迷宫，让我看见以苍白掩盖空虚无物的天和即将凋谢的太阳。而就在我看见那空白的阳光的时刻，我看见了真正的阳光。 秋日的清晨，在我醒来时，寝室里早已空无一人。我拿起拖把，连脸也来不及洗，赶紧把地拖了个干净就跑下楼去。想吃早饭也不大可能了，最后一年了，一定不能迟到。我并不是因为最后一年了，而对这里留下了怀念，我只是不想要在这个我欲求离开的地方留下印迹。我想要在日常生活的循环中忘却这段时光。 “那个，翻开报纸到第六页。”作为英语课代表的我，一到教室，就几乎是一定要领着一群不大早读的人早读，那段时间的周二与周四早晨，几乎是我一生中最耻辱的瞬间。领导来检查，我带着读，几乎没有人跟。我摆烂的话，领导和老师说我不是；他们摆烂的话，领导和老师貌似也是说我不是；如果我说是同学们的问题不是我的问题，同学、领导和老师们就会说我不是。不过实质上这三种情况，对我而言都一样，而且我都经历过，这三种情况是一种反复出现的循环，取决于我和领导、老师、同学们当时心情如何。就好像一个无解的迷宫一样，被安置在迷宫中，但是这个迷宫没有出口，只有三条堵死的路，我只能在这三条路中选一个碰壁。 我见领导不来，回到座位上，拿出《御伽之国的鬼岛》开始写第四章。可是隔壁班的老师倒是来了，还气势汹汹，说我们班很吵，让我们班安静些。我一想这逻辑很可笑，在早读的时候让同学们安静些，这不是很幽默吗？但我一想到说出来，就会成为出头鸟，我就一点不觉得幽默，我就感到迷惘、无助和彷徨。老师让我上去读，我很无奈，我便说我咳嗽，读不了。我装模作样地带上口罩，又拿起保温杯，摘下口罩，大口灌了不少开水。说我不咳嗽是假的，但说我完全读不了也是假的。我只是想找个借口推开这个根本无法执行的任务，就是领读。 老师气愤地一摔门走了出去，我不知道她为什么生气，如果是因为我的话，那就因为我吧。我想起我干英语课代表也干了快两年了，怎么现在才意识到自己几乎没有真正意义上带读过全班呢？我现在明白了，身处于迷宫中的时候，人们往往会下意识地认为迷宫一定会有出路，如同一切题目都有解一般。我有的时候，想到这里，往往会觉得是存在过这种情况的，我好像成功过，事实上就是没有，可以说我不称职，或者说，我期望着这个难题有一个我做的出来的解法。 对我来说，这种生活已经在机械地继续着了，直到我离开之前，都会是这样，是一个又一个无解的迷宫。有时候我会侥幸地想，会不会有什么变化呢？会不会有什么不同之处呢？不会，起码在这里不会。 写着写着《回忆京都》的旋律突然在耳边响起，我粗笨的手指跟随它在桌上舞动，仿佛我真的会弹钢琴，仿佛我真的理解这重复的旋律。我想起京都的同时想起杭州，仿佛我此刻人不在杭州，而在别的城市一般。回忆时，却发现过去的世界里，仿佛没有杭州这个地方，更多的是小区、小学、武林门、西湖，却不是杭州。我对杭州的了解始终很少，我在杭州的生活，一直在一个杭州里面的小范围里做着循环，却与困在一个迷宫里不一样。哪怕是局限在小范围中的我，日日也有新鲜事，也有自己真心所热爱的生活和风景；而在学校里，除了笔墨、音乐和几个朋友以外，我只剩下机械运行的一套程序了。 我感到沮丧，我知道那虚无循环的程序不属于我的一部分，但我每天每时每刻都要被它驱动去碰壁。我已经知道了我迟早会碰壁，那一切都没有什么好说的了，伪装着努力，伪装着去改变现状，可又有什么用呢？我记得曾几何时，我曾经说过，我是最讨厌虚伪的。于是我又去敲开办公室的大门。 “这件事对你来说很意外吗？”我笑着说。她拿起我的辞呈，眼神中有一丝迷惑，似乎我的这个决定让她很不解，但实际上我怀疑她很明白我这么做的用意。 “倒也不是，只是说，我记得你不是这么一个放得下的人。你一开始竞选这个职位的时候，你以最低票数当选，但是又干得最久。而且凭我说，抛去你那些恶习和做事刁钻的怪毛病，可能也干的还可以吧。我记得你之前也说过，要去做一些事情改变班级现状的，你大业未成就功成身退，这对你来说真的合适吗？”梁老师坐在办公椅上，看着我的眼睛说。有那么一瞬间，我看见一年前的她，我还记得那印象，如今又浮现在她的脸上。究竟是我又一次产生了幻觉，还是她没有变，变的是我，变的是我看待事物的方式？ “我觉得是合适的。我现在已经做出了选择要去参加中考，那么以我的能力，去参加中考需要非常充分的准备，否则极有可能失败。整体上来说，班委职务会消耗我大量的准备时间，综上所述，以我的视角来看，我应该辞去所有的班委职务，用心准备中考。“我不去看她的眼睛，却看见那越来越深的裂缝，在光暗交接处迸发。AI一般的空而无物的发言，用来结束我空虚的班委生活，异乎寻常地讽刺与合适。 “你不是这么想的，对吧？”梁老师笑了，“但我明白了，你走吧，我接受你的辞呈。我们班也快散了，如果你觉得同学们对你很重要的话，多花点时间陪陪他们吧。我不是早就与你们说过，三年的时间，很快就过完了。” “哦对了，还有一件事。”梁老师叫住我，语气急切，仿佛要说什么。 “什么事？”我回过头来，门外的阳光照进来，照到我身上，却没能照亮梁老师所在的那个角落。 “没什么。我不需要与你说，你也自然会明白。”她的眼神中仿佛带有着一丝歉意，我懂了。 “如果是那件事情的话，其实也没必要。”我冲她笑了笑，冲回了教室，与小泽一起趁着课间写了几篇辞呈，一起递交给了许多老师。但老师们几乎都看出来了我与小泽并不是真心想要为了中考放弃职位。我与他是在提前将自己在军特的生活状态放弃掉，在腐水使我身躯浮起，越过迷宫的桎梏之前，我要先切断那曾经让我流连忘返的，一丝一丝的，虚无缥缈的牵连。","link":"/01/RottenMaze.html"},{"title":"游记：黄鹤楼的遗憾","text":"公路片的开头，我们先是从杭州一路开到武汉。武汉大学的樱花没有看到，倒是看到了这座城市被病毒留下的阴影，核酸的队伍很长，挡住太阳的视线，将夕阳的影子留下。 然后黄鹤楼是一片黑压压的人影，楼下是一片现代装修风格的所谓「古街」，这古街修的没有半分古色古香的风格，卖的基本是儿童玩具，纪念字画，正如无数类似的景区。我只是想登上黄鹤楼，去看看这究竟是什么样的景色。什么样的景色会让无数人前来留下墨笔无法描绘的回忆？ 我们去的太迟了，便是白天的场也赶不上。我隔着一层门，只听到里面叮叮咚咚的响，我问这是什么，他们说这是表演。此刻的黄鹤楼便成了鲁迅先生小说中咚咚惶惶的戏院了。我说等会吧，母亲提议先去吃饭，我们便去吃热干面。有名的馆子有的并不开门，也有的少有客人。我们从杭州这个大暖炉奔赴武汉「避暑」，的确要被笑话痴傻。苍蝇馆子门口杂乱地停着小轿车，半新的木头桌子侧摆在行人道上，我坐在木椅上，喝着我几乎不喝的可乐，只因火锅的辣味刺激了我的味蕾。火锅的热气飘来，向我展示了武汉热气腾腾的朝气，窗外的被云遮住逐渐显得暗淡的阳光映出远方灯光璀璨的黄鹤楼的轮廓。我开始思考为了先人的文句，寻访这座被污染的名楼究竟是不是一个正确的选择。我想体会「感极而悲」的含义，是这让我来到这里。 父亲告诉我，如果此刻登上楼去看，我可能只会失望。须知黄鹤楼不是原先的黄鹤楼了，搬迁了数十次的它已经不再是前人登过的了；而景色也不是当年的景色了，木石的土地成为了钢筋混凝土的地界；至于人，此刻上面游客人满为患，戏子敲锣打鼓咚咚惶惶的响，相机、手机拍摄声不绝于耳，我看到那些人，我还能保有我自己的感情吗？哪怕我爬楼梯爬得慢一些，都会被谴责的快节奏，难道就是我真正想要的吗？我来黄鹤楼，究竟是为了寻找什么，为了避开什么，为了逃离什么？哪怕是登上这样的高楼，哪怕是这样的思想者们所汇聚过的地方，我也找不到能留给我个人的感情空间的地界。 我们便并没有登楼，而是远去秭归，屈原的故乡。离去的路上有晚霞的送别，我仅仅在天空中望见青红色的阴影与城市的灯光。橙色的日轮在远方默默的沉下水去，其实它离我们有八光分的距离，我们所看见的颜色，都其实是在几分钟前的，经历了地球的大气的渲染，呈现在我们的视网膜上。在风中残破的须臾的景色已经在我的心中离去，心中残留的是阿加尔塔之风吹来的幻想的永恒。记录下来吧，这每一瞬间的记忆，多少掺杂着几分不真实。某些人将人所促成的景象，人所残留的印象，人所描绘的画像，全部改写为一种模糊镜面的反射，让我不再能够看出原来的风景。或许正如范仲淹从未登过岳阳楼却写出了《岳阳楼记》一样，我未登上黄鹤楼，或许我对他心中唯美的印象反而显得更加的真实。 后来我们也没有去秭归，车从欧若拉的领地驶向尼克斯的领地，我们便停留在更方便明天赶路的枝江。顺带一提，枝江金湖大酒店服务做的很好。我们在那里睡了一个安稳觉，然后第二天吃到了湖北的特色早餐。我们并没有留给这座城市过多的留恋之情，早上九点大概也没到，我们就出发前赴重庆。","link":"/01/TheFallenReconstruction.html"},{"title":"十三而立","text":"序「当时我有着许多非凡的欲望，我最近才明白这只是梦中的呓语。等到看到童年的尽头时，我才恍然大悟，原来人不是想做什么就做什么。在人的一生中，有着无穷尽的选择题，然而在现实向你抛来的责任面前，人总是没有选择的。」 如果说我能从这十三年中学到什么，那就是十三年太短，不足以学到什么。我承认我很无知，我承认我犯下了无数滔天大罪，承认了这些，我就再也没有清白可言。自从我承认这些我的失败以来，套上的枷锁仿佛也与我合为了一体。 谨以此文，献给我走过的这十三年。然而我还是想要把这十三年抛弃，不为什么。 † 1 †下课的铃声总是很突兀，钟楼的钟声也总是很不明所以的沉重而难听，我一路看见一群人在走道里骂骂咧咧，殴打学弟，也看见了一株在窗口外花朵绽开的白玉兰树。有人说，只要你够洁身自好，你就看不见身边的污秽。然而我觉得，如果真的看不见身边的污秽的话，也不是什么好的事情，任何两面性都有存在的必要。如果一个人只能看得见白玉兰树，他就不会在意骂骂咧咧的人，更不会知道他们殴打学弟的严重性——甚至可以说是完全不知道有恶的行为。在彻底消灭恶性和良性之一之前，我建议还是把两者看的一样重要。然而我想得出神，几乎忘了我们班的班长在几分钟之前向我走过来，跟我说班主任找我有事。 “……这个……”班主任倚在转椅上欲言又止，我不是喜欢等待的人，我就随便找了件事打断了她：“报告梁老师，副班长唐某传我绯闻。她最近偷鸡摸狗，无恶不作，少年无行，吊儿郎当。整天跑到隔壁班去交男女朋友。建议吊销她的班长职位。” “你这说的都啥跟啥？这个，额，小唐的情况不同，她能力低下，喜欢传八卦，她工作偷鸡摸狗，但有任务的时候还是比较勤恳的。你不要太看重同学们最近说的话，把这些话当成你们日常的玩笑和梗就行了。本来吧，我找你有个事情要和你商量商量。”梁老师双唇紧抿，最后还是开了口。 “说。”我感觉自己更像班主任，梁老师也不太在意我语气中的一种膨胀：“就是你们寝室的小王，他割了自己手腕三刀，你知道吗？” “不知道，要是知道了还得喝一蛊，这种人乃是造大粪的机器，还当什么副班长。老师您要说，跟全班公布好了，干嘛劳班长大驾请我上您的办公室来。”我不大在意这事，但显然这三刀让梁老师焦头烂额。这种焦头烂额，体现在他反复斟酌该怎么跟我说这件事情上，更体现在他单独请我到他的办公室来聊这件事情，我和他都不太喜欢和对方单独说话，因为我觉得这么聊是在浪费时间，他觉得我说话话里藏刀，我和他不对付，实际上却是如此，我和很多人都不对付，主要体现于我绝不会说他们想要我说的话上。 “额，其实是这样的，小郑同学，你是你们寝室的寝室长吧。”其实我不当寝室长很久了，但我们寝室没有寝室长这个职位。在学校寝室的记录上，我仍然是寝室长。梁老师想必不知道这一点，也很正常。“大概吧。”我这样回答。 “既然你是寝室长，那这事情就由不得你了。小王他今天晚上回寝室，你得守夜，不准睡觉。这是他母亲和学校一致的决定，你守了夜，你们寝室的那帮坏小子就都会老实守夜了。你带个头。”他说这话的时候，露出一种很瘆人的阴笑。 “梁老师，您老人家怎么能这样整我。”我露出一种痛苦的表情。梁老师完全没理会我，他阴笑着说：“没有整你，这是校方和他父母的决定，既然你是第一个，那么你们寝室的另外的同学们就会是第二个第三个。你可以把这个当作安慰。总之就是这样，享受今宵吧。” 事实上这种东西完全不能算是安慰，因为我不睡觉简直是对我精神的一种折磨，我常常想入非非之境，比如这次吧，我就开始想为什么人会去割自己的命脉，人为什么要勤劳，最后这很多问题，都引申到为什么人要受苦。 我看见、想起、想象许多痛苦的人，我不知道为什么人要受苦。我更不知道苦难是什么。我甚至都不知道我是谁，更不知道存在是什么，为什么我要到来，凭什么我要离去。 † 2 †一般来说，大家认为人生的前十二年是人的童年，《圣经》中说人的一生有七十年，但从第十三年开始，人就不可避免地要彷徨与衰老了。我常常蔑视各种先进的小同学，痛骂他人做的看似无用的行为，这样的站在制高点上指责他人的快活日子仿佛就在昨天。现在我成了班级各大活动、事务最积极的人物。看来时间真的能够很大地改变一个人，潜移默化的影响使我失去了往日的所谓高傲，剩下的最后一点自我在嘴里和记忆里。我常看到某些混的好的同学，有时我想对他们顶礼膜拜，又有时我会想我怎么了，为什么我会变得如此。要知道，当年认识我的人无不称我为好汉。 有时候我想要真诚的活着，但有时一些东西的出现就会使我的这些想法化为灰烬。我在跑的时候会大喘气，这总是让我联想到自己ß¥时的感受，这东西若是没有了≈的刺激，就和剧烈运动一样令人难受。我常想到这个，就不再想要去爱别人，也更不想要让别人爱我。但心里总有一种心理因素在我的心里刺激我，让我浑身发痒，让我疲惫不堪，让我筋疲力尽，使我不禁想到，爱是什么呢？ 李斯说：人之不肖如鼠也。孟子说：人之初，性本善。罗马皇帝马可·奥勒留在《沉思录》里说：人是大宇宙中的小宇宙。年轻时的我常觉得自己是得道高人，故有一种狂傲之气，竟也想要对人类进行划分了。当年我这么说：人有两种，傻X和亡命之徒。听名字有点滑稽，但我觉得这么分也没太大问题，亡命之徒每一天都在准备着死亡，傻X每一天都会自愿去送死。 小王在寝室里的名声很不好，恐怕也和他作为傻X的送死行为脱不开干系。他常常脱的光光，跑到人家寝室门口大喊一声：“我是个傻逼！”然后赶紧跑开。我真诚地觉得他是个实诚的傻逼，但实话说，我们男生寝室一般都是赤条条的，宿管都不敢管我们，不赤条条的反而是异类，我就不觉得人应该裸露着生殖器跑出去，所以在很多人眼中，我是比小王还异类的异类。我的异类之处还在于，我午休时不打篮球，回到教室写作业之类的。我觉得这是理所应当的，但很多人就不这么觉得。我这么写，并不是我想要突出我的优秀，相反，我觉得我所“特殊”的都是我需要克服的弱点，这种行为使我某种意义上被大家排斥。但实际上，经过反复思考后，我认为我这么干是对的，有的时候你会发现，大家都犯错的时候，大家都指责你的时候，你是很难去做正确的事情的。 经过被他人的排斥之后，我下定了决心做一个亡命之徒，我要为自己而活，不必看待他人看我的看法。但是空虚感却使我产生了一种犹豫。我现在开始有一种麻木的虚无感，这让我想起了过去的那一次经历 过去的一天的下午，我坐在教室的地上的角落，思考着那一天自己遇到的种种怪事，须知，我人生中从来没有遇到过露阴癖、男同性恋、暴露狂、校园恶霸之类，而那一天我却全都遇见了。这使我很怀疑我的过去的教条和行为准则，因为我发现我应对没有见过的这些奇葩束手无策。然而那天，我看见一个面色苍白像鬼一样的人走进我们班的教室，我不认识他，而他穿着我们学校的校服：“喂，同志。你走错了，这是七班。”他的脚步很乱，径直向我走过来，没有绕很远的路，他欲言又止，目光呆滞。他的身上仿佛有一种虚无在向我靠近。经过一段长长的对视，他消失了，我感觉仿佛过去了永恒，又仿佛只是一阿托秒。我当时只觉得这个人不存在，但没有证据证明他的存在，也没有证据证明他不存在，而且我看了看表，过去的却是三分钟。 到了今天，我还是不知道那个人存不存在，是不是个哑巴。所以我总是觉得那个人就在我的附近，而且我有预感，我们很快就会再见，因为我再一次感受到了他身上的虚无感向我的逼近。对于不知道的事物，我们虽然要保持尊敬的态度进行研究，但我觉得，直觉和预感也很重要。 † 3 †今天上午第一节课我要做一个做一个新闻报道。虽说梁老师给我安排了一个搭档，不过我怀疑他是存心整我——把我和老王安排在一个组！我站在台上，不知为什么怎么都正经不起来，然而台下数十人严肃地看着我，眼神中带着一种来自恒星的辐射力量，竟有几分像像捷尔任斯基了，我不敢看。“Ladies and Gents.”小王穿着一身整齐的校服，庄严肃立，像在国旗下演讲，像在新闻发布会，就是不像他自己。他看到的，大概是一群坐在那里的同学；我看到的，是一群装模作样，很不像样的八卦狂魔和露阴癖像是得了正经病一样，人不人鬼不鬼的在装正经人。我站在台上，看着这些令人发笑的同学，忍不住笑出了声。梁老师抬起头，瞪了我一眼。然而我不害怕后果之类的东西，因此我假装没看见，依旧在台上很得意，笑嘻嘻的。 小唐此时给一个男同学传了一张纸条，两人都脸红了。结果正好被梁老师抓包了，梁老师叫了起来：“唐同学，下课到我办公室来一趟。还有你，郑同学，在台上嘻嘻哈哈的像什么话！”下课了，到了办公室，梁老师先骂姓唐的，他骂人一向不带脏字，真是行云流水，听着令人很解气。然后轮到我了，我仰着头挺着胸，像一个中世纪的骑士接受处刑。他骂我是不是家里没父母管教，是不是没有爱，来学校找存在感。我走出办公室，狂笑不止。 得益于梁老师的“谆谆教诲”，我一想到严肃，就越想到假正经，就越止不住狂笑，没办法，我毕竟还只是一个凡人，凡人都喜欢有趣。 顺带一提，本人认为，一篇小说中只有很少的东西有可能是真的，比如梁老师就可能不是梁老师，是六老师；小郑同学大抵也不是小郑同学，是张鹏；小王也不是小王了，是JOKER。人名不真，事情倒是不假。我编一个老师骂我缺爱干嘛呢？所以我要么是一个极度无趣的人，要么是一个以虚构物探求真诚的人。由此，我们有知道，若是讨论真伪，小说家就坐不上论席。但我总是因为真伪的论题大想特想，要是想要了解真伪与真理，你就必须要在现实中探索。就好像你只有看真正的夜空，才能知道它实际上并没有那么黑。 因为我要记叙的是所谓虚假又真实的事情，所以只能用史笔，或者说直笔。我实际上并没有这只史笔，我只是想要拥有这样的力量，像史官一样能够使自己的文笔成为历史。而我既然没有这样的力量，我就要从小人物和小事情讲起。 那时候我们班的班长姓和，去和二班的舟湖阳表白。我很有一种不祥的预感，班长是一个率性的人，舟湖阳是一个畏畏缩缩、谎话连篇的比我还糟糕的人。他们两个在一起，注定没有好结果。但我总不能在人家表白之前就咒人家吧，我心想。班长的这一想法酿成了大祸。 但世界上哪有那么多可以被预测到的事情呢？我们不是预言家，就算猜中了一两件事情，也不可能了解更长远的未来。许多人心里想着白头偕老，先不说那些人分不分手，「白头」之前就去世的可能性也不低啊。然而班长却就是这样的人，许多人说她是恋爱脑，但平时她又是最冷静又最疯狂的人。我刚和大家一起讨论这件事情，然后她红着脸跑到了班级里，跟大家说她已经被「婉拒」啦。我倒不意外，所以一副并不吃惊的表情。她趴在桌子上，头不停的摇，估计是在哭。有一个女同学，她跑过去时问我为什么不过去安慰。我说我早预测到会这样了，那个女同学就问我为什么不告诉她。我只好说不合适，人家没表白就咒人家，没意思，再者我心里没兜底，说不准姓舟的一天变成了绝世好男人呢？我感觉我说出来的话我自己也不信，我又害怕被更多人纠缠，赶紧跑到男厕所避难。 她哭了一整个上午，据说在半夜的时候还要呜呜的哭，让全寝又睡不着。第二天又觉得肯定是姓舟的想要更好的学习，姓舟的才不答应她的告白。于是她又说姓舟的是「绝世好男人」，又写了一封情书，说要给姓舟的补习，还说自己爱他。然而姓舟的作为一个直男（干脆直接叫渣男），非常没有情商的假装没看见那封情书，走路都要绕着我们班走。后来她千辛万苦约到了他吃一顿饭，地点在食堂三楼，她请客。他一听到是对方请客，一下子又精神了，然后马上给了回应。“这下有戏了。”她这样说。我沉默了，想要跟她说我的想法，但奈何不敢破坏她脸上的光彩。然而，我预测到的事情又发生了，他果真不是什么好东西，连一个消息也没有就放了我和班长鸽子。 泪有时如泉涌出，有时如绵绵细雨，有时如火山喷发。她心中的激愤还是爆发出来了，她要报复。我听到她这么说，没有回应，第三次我仍然欲言又止，但在我的心里我到底想要告诉她，但我还是把话憋在了肚子里。我觉得这一场「恋情」，肯定对她来说凶多吉少。说不准这一次，恐怕是「她在沉默中爆发，我在沉默中灭亡」。然而最终却知道不是。 † 4 †我千不该万不该保持沉默，我明知老和此劫难逃却不敢说。她最近也不告诉我她干了些什么，我一天比一天担心。那一天的晚自习，梁老师与班长都不在。隔壁办公室里传来摔门的声音和辱骂的声音，但仿佛只有我一个人能够听到。我不知道老和干了些什么，照这个形势看，肯定是非常严肃的事情，而且要受处分了。趁老师不在，而其他人又都在俯身写作业，我快速的给小唐写了个字条，问她是不是知道些什么。她却转过头来带着一丝哀伤似的看了我一眼，然后转了回去只是摇摇头。我后来据此很怀疑她是不是知道些什么，却不告诉我。 下课了，我们班里的所有人都一窝蜂涌出去，有不少人想着要看办公室里发生的「惊天大事」。我的直觉告诉我不要进入那个将真相与我的胡思乱想相隔的门。这会儿小唐和一群八卦狂魔终于把这事情的大概给梳理出来了，说来无聊：本来是班长打算用钱收买班草，他们俩装成一对情侣，故意去二班门口恶心姓舟的。她恐怕脑子不大好使，一是觉得班草不会坑自己，二是觉得姓舟的不至于举报他们俩。结果就是姓舟的跟年级组长举报他早恋；班草不住校，一回家就跟他爸妈说漏了嘴。这两边只能通知梁老师，让他「好好处置」这件事情。在这件事情发生的过程中，有很多遗漏的细节，实际上没有人知道，而我若是不知道，就不能借着手上的直笔乱说。 我想到这样的事情，我经历了很多，然而都是在这军特中学中经历的，所以我对学校的评价不佳，想必大家也知道不是乱说而是有所原因了。我进入人生的第十三年之后，常在生活中看见露阴癖、早恋情侣，还有所谓的「社交牛逼症」患者。或许是我过去没有留心，但我大抵是最近几年才开始「见多识广」的。我相信一个人初看到这种东西，心里要承受的精神压力一定不比探究形而上学要低。而且我发现人世间还有更加伟大的东西，使我想为之活下去。然而，这是我的观点，我猜并不是所有人都那么想。 今天中午，班长要为我们做检讨。梁老师对我们做检讨特别有热情。我在检讨前一分钟进了教室，一个个人都神情庄重，有的屏息凝神，看着老和，好像在跟遗体告别；还有的看着老师，老师则是刷着手机等待检讨开始。还有一个小泽同学在检讨开始时，打算趁大家不注意从教室的最后钻出来，检讨结束之后，他就被「请」进了办公室。 对于检讨，应该没有什么好说的。实话说，检讨者只会说一些大家都懒得听的话，自己不愿意说的话，以及一些绝对「正确」的废话，有的时候这些话还会很政治正确或者非常假正经。对于检讨者，这就是行刑一样的折磨。真伪的重要也在这检讨里边显现，强迫一个不知道自己犯了什么错误的人做检讨，不就是逼一个可怜又无知的人说他不想说的话吗？而这就是虚伪。 若一个人想要维护自己虚假的权威，就要让一个人为自己重复无数次的谎言。这种人，我们一般称为暴君。 关于真伪和虚实，我想给大家讲一个故事。我小时候特别喜欢在海边吹风，仿佛在没有人看见的，遥远的海边就没有人能够看到我。而当时，我几乎与风化为了一体。我时常想起我坐在海边的栏杆上等待落日，白色的海浪向我席卷而来，海鸥则快速地在我头顶掠过，我还有时坐在那里看海天一色。遗憾的是，我没有任何证据可以证明我的这段美好回忆是真的。但正是因为我无法证明我记忆的真实，我才会仰望这景色的美丽。而我一生，都有可能不会有机会证实这段回忆了。 † 5 †我们身边死去的人们都有一种支撑他们活下去的力量。从另一个角度看，我们身边活着的人们都有一种将他们推向死亡的力量，这就是压力。我想到这里，回到教室，感受到一种莫大的无聊。然后我看见小泽坐在窗台上，手里拿着一把大号美工刀（很能反光，在夕阳的映衬下显得极为锋利），眼眶里噙着泪水。他的桌上有一张109.5分的试卷（一个大大的110分，旁边多了一个小号的-0.5分，是别的班的同学为了整他故意给他多扣了0.5分，但当时卷子刚发，谁也不知道）。他哭的撕心裂肺，高声大喊着：“我他妈不活了！” “好！好！”“很有精神！”鼓掌、欢呼打破了他的哭泣，我也想要附和着叫起来，但我很快就开始怀疑我这样的行为是否正确，所以我始终没有叫。因为心里想叫但没有叫出声，所以我很苦闷。但苦闷稍纵即逝，因为我发现他这样的行为恰恰使我得到了「消遣」，但这样以他人的痛苦来作为自己的消遣，真的好吗？我保持否定的态度，因为我想起窃·格瓦拉说的那句话：“我怎能在别人的苦难前转过脸去？” 这时梁老师进来了，梁老师一来，几个叫得最响的同学就马上躲起来，或者跑出去。梁老师还带了一个学校的心理咨询老师，他们进来，看到一个七尺男儿披着一身汗渍的校服坐在窗台上，手里拿着一把在日暮之光下色泽金黄的美工刀。他的眼里饱含泪水，映出赤色的炽热目光，大抵是因为泪水折射出了夕阳的余晖。那个男人一会仰起头，好像要叫起来；又一会看看手里的刀，一会望向窗外，好像在选死法。梁老师后来跟我说，那时他以为这是无伤大雅的学生叫嚣，进来看到这样的场面，吓得差点魔怔了，甚至有一个想要装作没有看见然后赶紧离开的念头。但他还是马上夺过了小泽手里的刀，把小泽从窗上拉了下来，他说他也不记得自己是怎么做到的了，而站在一旁一动不动的心理老师，则表示自己当时近乎产生了去看心理医生的念头（这是后来谈这件事情的时候的玩笑话）。 小泽并没有做检讨，而且自从他那件事情之后，做检讨作为一种处罚的次数变少了。大家据此认为他是一位「英雄」，若他真是一位英雄的话，我觉得他的过人之处就在于他那件事情作为一件难得的「消遣」打破了我们沉闷的一天，而不是在于他敢于「舍身取义」和减少了某种处罚。而自此之后他出现了两种变化，第一就是突然变得喜欢走路时摇来摇去，开始读起了物理学；第二是他的身上突然被贴满了标签。班长现在和他坐在一起，现在来看，他们俩很能聊。具体他们怎么聊，我不知道，要问问小唐，她才是八卦狂魔，我不是。 班长小和违反的班规比我一时半会能想到的还多，小泽也曾经担任过副班长的职位（后来接替小泽的就是我）。他们两个人经常被约到办公室去吃班主任的「鸿门宴」，后来被他们调侃成「三人约会」。小泽最近开始变得没脾气了起来，出了事情他不管内心生气不生气，看上去一直都很开心的。最近我和他们聊天的时候，发现他们都是感情主义者，触动他们的东西，他们就会一直铭记；没有在他们心中留下印痕的东西，比如那篇检讨，就从来不会被他们在乎。我感觉我挺像这种人的，所以我和他们很聊得来。 说到那一次检讨，其实那一次班长和我差点结下仇怨。当时她在台上慷慨陈词，我在和自己下五子棋。她当时讲到一半顿了一下，扫视了整个班一圈。然后突然说有些班干部贪污受贿，给同学打「保护伞」。我怀疑她当时看了我一眼，不然我绝不会从绝佳的一局五子棋中抬起眼来，我有一种直觉，她在暗示我。实际上，我的确「贪污受贿」，具体过程就是，收东西照常收，开处分照常开，小报告照常打。「保护伞」这种东西就纯属她的想象。我觉得她这么说我有点不厚道，而检讨完了之后，梁老师「请」我进他的办公室。我虽然没有干过坏事，但是我十分的紧张，心脏仿佛在一瞬间剧烈颤抖了一下，仿佛我真的行贿了一样。 他开门见山的问我：“你有没有行过同学的贿？”我说没有，可是在那目光的威严照射之下，我十分的紧张，而且脑子里不住的在想我到底有没有干出那样的事情。他的目光中多了一丝狐疑，他欲言又止，仿佛我能看见他想要以这个「罪名」审判我，但他最后又抬起手让我离开。我走出教室，凝固的笑容瞬间消融了，化作了一心的不愉快。当时我想把她宰了。 † 6 †小泽本来和我一样，没有想过初中要来军特这种鬼地方。他是为了一个密友来的，为了和那个密友继续朋友关系，他就从宁波转到了杭州军特。入学日，在寝室里大家一开始都很拘谨，我和小泽是整天都很拘谨。后来就在那些最拘谨的人里面，露阴癖也出来了，同性恋也出来了。他整天神经兮兮。寝室里，小王整天对他搂搂抱抱的，还整天说要çåø他，他一直都不理解，而且为之而怒，但他最终还是忍住了。这令我十分的佩服，因为我从来没有见过那么能忍耐的人。使我更加佩服的是，他作为一个聪明人，却能装成傻子，他可以不摇，却偏要走路的时候像个鸭子一样，搞得老师和同学忍俊不禁，不了解他的人可能真的以为他是一个脑子好使的弱智。 刚开学没多久的时候，他睡不好，我也睡不好，因为小王半夜喜欢像野兽一样地嚎叫。而就在那几天，他看见了无数将阳具裸露出来的男同学，他总是怀疑自己是不是在做梦。这段日子里，我们总是对一切事物将信将疑。他有一天突发奇想，说：“军特的风水不好，所以我才这么倒霉！”于是那天他神神叨叨说什么军特位于鸡笼山之南，阴气大聚，垃圾场就在寝室楼对面。总而言之这地方太晦气！未成想这番话却引起了小王的愤怒，小王像是发神经一样地说：“对，对！都是因为我！行了吧，好了吗？”然后他冲上去，将小泽撞到了门上。 那夜，我们六人不得安宁。结果就是小泽离开了我们的寝室，而且自他到了另一个寝室之后，他从未提过我们寝和风水，哪怕半个字。小王也不嚎叫了，他又养成了在半夜放电子舞曲的习惯。我问他为什么放这个，他说不放睡不好，我说你放催眠曲我也不来纠缠你，你放舞曲干嘛？然后他用瞪小泽的眼神瞪我，我不知道为什么缩了一缩，但到底勇敢起来了，于是问他：“你放这个你开心了，你知道我们睡不着觉吗？”然后他的眼神消失了，然后用一种悲悯的眼光看着我，我本来想用这种眼光看他的。但到底因此发现了这眼神太令人恶心，没有谁值得我这样去悲悯他。回到教室里，写着作业，却总是提不起精神来，难道我有什么比他低的才能或天赋，或者我比他不幸，所以能够使他悲悯我的吗？彻底想不通。这时我的眼光看向窗外，想要也即兴写一首《天问》，于是草草写下不少文字。然后长舒一口气，看向繁星，人们常常深陷于未知中，迷惘中的人们抬头望向苍天，然而天幕之上却有更多的问题，真正揭示了人类的无知。 我在校运动会的看台上，把这些积淤我心底的苦恼告诉了小和，然而小和大抵没有在听，他正在和隔壁班的程光说话。程光是二班的，和小和在校运动会上认识的，他们都是志愿者。我也想去参加志愿者，毕竟可以结识学长学姐之类的人物，但我还是太懒了：我连参加志愿者的表格也懒得填。但我怀疑还有更加深层的原因，我的激情在别的东西上。运动会结束的时候天上下起了雨，很小很冷的雨滴打在我的脸上，我花一年的时间大抵想通了为什么小王要悲悯我——他自认为他是不在乎这种事情的，所以他完全不知道自己行为的危害，他是在对我的「敏感」不屑，但他又对他人对自己的冒犯行为极为敏感。 读书的时候，看到了名家的一个经典的论断《坚、白石论》，而联想到了一个有趣的观点：如果你认同一个规则，而不去遵循，那就是比不知道而去做错事者的过失更大。这种想法并不是完全正确的，因为很少有人真正的遵守这种规则，对和错永远是主观的意见，它不是客观意义上的正确和错误。 † 7 †有无数的人在时间的流动迷失自我，这就是流年的威力。若有什么东西已经被流年侵蚀到不能再侵蚀了，那它就会被时间抛弃，而这意味着死亡。 小王在自述中谈到，他小学时是一个很要面子的人，据说他小学时他受的是整个余杭区最严格的教育，会弹吉他，英语不错，会点音乐制作，非常了解电子音乐。 上午，在英语课上王老师和小王又发生了口角。彬彬有礼的那个只在他叙述里出现的小王决不会这么做，所以从那个时候看，这件事决不会发生，但还是发生了。把个人改造成另一个样子，这就是时间给人带来的变化。连我也变了。 王老师这个人也很有意思她总是喜欢说自己老了，设脾气了。她作为一个三十来岁的老师，却能够随和而不随意地活下去教书育人这似乎证明了我的观点是错的，有的人似乎的确不会老去。但是时间却是无情的，一瞬之后，一个人就不再是那个人，所以一切时间皆是珍宝，每一秒都是恩赐。 梁老师作为我的成长导师，找我聊天的时候提到又一次提到了跳楼这档子事，因为他看着我觉得我很像一个忧郁的青年，小泽跳楼时几乎就没人能理解，现在梁老师就几乎抱着调侃的语气来谈这个事，不在现场的小和也老是装不知道：王小波曾说过：只要一个人的情感不是装出来的，我们就可以共言他的愤乐，同情他的悲伤。但这大抵不对，因为小泽没有得到任何同情，他唯一的成果就是在走路摇的时候被称为摇摆羊，一摇大半年，至还在摇，我也不知道为什么他要摇，我也不知道为什么没有一个人有对他的同情心。所有人看着他自杀的事件，第一反应是嘲笑，这究竟是王小波话的问题，还是诸人的问题？ 我想起我过去的活法：以他人的快乐为自己的快乐。这种做法在我实践了十二年之后作废，因为人人并不都是友爱的，我在这十二年里被我的友人们仇视过无数次。我尝试活得更简单，于是我要到冬日的下午里冷冻我的记忆。你能说出在这座钟楼的底下的有什么呢？你能说出你对这黑暗的理解吗？你能知道钟楼存在的目的吗？说实话一个物体可以存在是有许多外界因素的，但它自身在物项世界的存在会否完全取决于它自身。而钟楼存在的月的并非他对于我们的作用，实际上，一个物体的存在没有任前目的可言。如果要为之加上一个目的，那个物体就只是一层所谓的粉饰。 地球自转没有什么目的，沙子从沙漏上端落下没有什么目的。但人类是万物中的例外，它们干什么事都想达到某个虚无的目的。林木的金装是我为之沉醉，落叶残花纷纷飘舞在琉璃瓦上，此刻若品一杯茶，想必是一件美事。这景象如此美好，我却不能为之逗留。之前发生了一件大事，我不能在钟楼走下去了，我走回到教室。 † 8 †那是艺术节的一个“文艺汇演”，天很冷，但大家都穿了戏服，表演的场所是体育馆，压根没有什么空调，还把天窗开了。 “这怎么整的？”我坐在后台，看见导演没把音乐拷上去，我就急中生智，派了个邻班的女同志到下面通知导演做好没音乐准备。那女同志下去一趟，上来嗯了一下，那大概就没问题了，但墨菲定律告诉我们，你越怕什么事发生，什么糟心事就会发生。我和灯光师聊着天，我说我发虚汗，尿频，现在就忍不住想去厕所。归光师打个哈哈，说：“你们一帮小年轻，忍一时风平浪静，没事的。”然后他顺手给我们班打了一个老年迪斯科光效，我顿时觉得这个人极不靠谱。当第六幕开始时，所有人看向镜头，默不作声——我心里大喊一声”死了妈的导演！”然后快速地用另一台电脑的网易云打开了音乐。 结果就是在网易云音乐打开之前，所有演员都看向镜头默不作声了足定半分钟。我跟灯光师说：完蛋了，我本来有哮喘、鼻炎，现在又有心脏病了。”我冲到舞台下面，不知道为什么就很害怕，想跑。小王作为主演兼编剧，一拳把我打到了地上。我压根设想久留，飞速跑出了体育馆。平心而论，小王在这个剧组的资历、地位。贡献都比我大他打我一拳设什么的。但我知道他们都认为是我整的这事这才是问题的关键，要是我让他打，可能我会躺在太平间里头——由此我们很自然他可以看出另一个关键是我愿不愿意用挨揍来换取一个不被冤枉，解释自我的机会，明显，我不愿意，因为我不应该挨揍。 若是我要证明自己有几个反证的条件：①PPT不是我做的，②音乐不是我剪的，③我没在操控后台的电脑。三个一个也不成立，PPT和音乐，后台都是我负竟，这个责任我是逃不大了的，我之所以要回去和他们说清楚，是因为我发现人们不论真伪善恶都应该知道这个我的观点。不论这个观点对错。 大家看着我，面红耳赤。大家都以为是回来做反省的，没人这么反省，都想让我下台。但我要是想说什么话，梁老师也拦不住我，甭说下面的乌合之众了。最后不仅没有掌声，还有人质疑我，而导演和小王的脸色则变得更加阴沉。 我坐在座位上思考为什么大家都不情愿听我说出真相。这时一位姓道的同学走了过来，告诉我不要再说了。再说就是我欠揍。说实话怎么会欠揍呢？这时我忽然想到了一个事实，那就是导演当时哭了，小王想割腕，主创团队就我一个人还能被骂被打，但这又和我欠揍有何必然联系？ 切格瓦拉说了一句话，那就是：我怎能在别人的管难前的转过头去？王小波说别人受苦，他不受苦？我人生的前十二年都有意无意地与格瓦拉意见一致。但这一年我却改变了想法，但我仍旧对他人抱有帮助之心。大家都说我没情商，大概因此我没交到什么朋友。小王和小和勉强算两个损友。小泽和梁老师大抵也是。小和最近老是对我露出那种脑袋光秃秃的老人会露出的蒙娜丽莎的微笑。她处处作自己留余地，所以比我所受的的苦头少些；她有知己，学习名列前茅，而我没有多少成绩或朋友。她这次就很明智地没有踩进这一滩黑水，她早就猜到到了剧组早晚会起纠纷。 她这一生大抵就发了一次疯，那一次告诉我们，发疯的人会被制裁。小泽那一本《几何原本》我终究没借到，他最近研究起了物理学，最近他不太说话，不知道为什么。我的同桌小陈劝我不该问就别问。我觉得他们都在装正经，因为我曾记得小泽不是那么寡言的人，小和也不是一个虚伪的人。小时候我觉得有的事情发生与否，你很容易知道，我现在再不这么认为了，因为一人所有的一切，都会在时间的流逝之中被抹消。你不可能知道，下一秒，另一个人会要成多么不同的人。 在岁月如流之中，只有你还来被消磨的自我才是所谓你自己所有的东西。 常有人问我，活着的意义是什么，我老是想告诉他们，活着本身没有意义可言，时间给予人们的生活意义，也带走这些人们和他们眷恋的意义。有人因为这样的事情而陷入痛苦，难道这样的悲剧还不够多吗？不够让所有人都为之而哀叹吗？不够让我们吸收这个教训，尝试创造并拥有一个不再为这些虚无缥缈的假象而驱使的未来吗？ 然而所有人都沉默了，在白色的寂静中，只有我一个人在发声。我行走在这白色的沙漠，行走在那银白的绿洲，行走在那苍白乃至无色的城市，我只看到了无声的寂白。我继续远行，在这个被虚伪光芒覆盖的世界里存在。 ###【末语】 本文改编自真实事件。 这就是《十三而立》的WEB版本。我终于把它润色改完了，最后有一点点仓促，希望大家可以认真看完。如果可以接受的话，顺便也听一下ZUN的《蓬莱人形》专辑，真的很好听。","link":"/01/Thirteen.html"},{"title":"视音频转换器","text":"零、前言前面其实说过了，我要做视音频转换器，终于在旅途的车上挤出来了这段代码。 土土作为头号测试员（小白鼠），表示非常满意。 一、代码以下是main.py的代码: 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889import sysimport pathlibfrom pydub import AudioSegmentfrom gui import Ui_MainWindowfrom PySide6.QtWidgets import QMainWindow, QApplication, QFileDialog, QMessageBoxfrom PySide6 import QtCoreimport cv2QtCore.QCoreApplication.setAttribute(QtCore.Qt.AA_EnableHighDpiScaling)MUSIC = [&quot;MP3&quot;, &quot;FLAC&quot;, &quot;WAV&quot;, &quot;OGG&quot;, &quot;WMA&quot;, &quot;M4A&quot;]VIDEO = [&quot;MP4&quot;, &quot;FLV&quot;, &quot;MOV&quot;, &quot;WMV&quot;, &quot;AVI&quot;]loadtext = &quot;&quot;&quot;食用说明: 1. 文件的保存位置一般为原文件位置。2. 部分格式之间的互换未经过完整测试。3. 支持视频转视频，视频转音频，音频转音频。4. 请勿作死尝试将音频转成视频。5. 未在Windows/Linux上经过测试，理论上支持这两个平台。6. 有bug可反馈至作者博客: https://chuishen.xyz/。7. 请通过源代码安装的用户自行安装ffmpeg。地址: https://ffmpeg.org/。8. 支持导出的文件格式有: MP3, FLAC, WAV, OGG, WMA, M4A, MP4, FLV, MOV, WMV, AVI等，支持导入的文件格式更加多样，且未来将支持更多导出格式。&quot;&quot;&quot;class MainWindow(QMainWindow): def __init__(self): super().__init__() self.ui = Ui_MainWindow() self.ui.setupUi(self) self.ui.TransNow.clicked.connect(self.tran) self.ui.ChooseFile.clicked.connect(self.choicebox) self.filename = None self.func = None QMessageBox.information(self, &quot;食用说明&quot;, loadtext, QMessageBox.Ok) def fext(self, f): file_extension = pathlib.Path(f).suffix EXT = file_extension.strip('.') return EXT def to_video(self, filepath, input_type, output_type): try: cap = cv2.VideoCapture(filepath) frame_cnt = int(cap.get(cv2.CAP_PROP_FRAME_COUNT)) height = int(cap.get(cv2.CAP_PROP_FRAME_HEIGHT)) weight = int(cap.get(cv2.CAP_PROP_FRAME_WIDTH)) fps = int(cap.get(cv2.CAP_PROP_FPS)) size = (weight, height) fourcc = cv2.VideoWriter_fourcc(*'XVID') out = cv2.VideoWriter(filepath+&quot;.&quot;+output_type, fourcc, fps, size) for n in range(frame_cnt): _, frame = cap.read() out.write(frame) if cv2.waitKey(10) &amp; 0xFF == ord('q'): break cap.release() out.release() return 1 except: return 0 def to_audio(self, filepath, input_type, output_type): try: song = AudioSegment.from_file(filepath) print(song) filename = filepath.split(&quot;.&quot;)[-2] song.export(f&quot;{filename}.{output_type}&quot;, format=f&quot;{output_type}&quot;) return 1 except Exception as e: return 0 def choicebox(self): filePath, _ = QFileDialog.getOpenFileName(self, &quot;选择音乐、视频&quot;, &quot;.&quot;, &quot;*&quot;) self.file = filePath def tran(self): text = self.ui.comboBox.currentText() suffix = self.fext(self.file).upper() if text in MUSIC: self.func = self.to_audio elif text in VIDEO: self.func = self.to_video if self.func(self.file, suffix, text) == 0: QMessageBox.information(self, &quot;出错啦!&quot;, &quot;出错啦!请检查配置与输入有无错误。&quot;, QMessageBox.Ok) else: QMessageBox.information(self, &quot;成功!&quot;, &quot;成功!&quot;, QMessageBox.Ok)if __name__ == &quot;__main__&quot;: app = QApplication(sys.argv) window = MainWindow() window.show() sys.exit(app.exec()) 以下是gui.py的代码: 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687from PySide6.QtCore import QCoreApplication, QMetaObject, QRectfrom PySide6.QtGui import QFontfrom PySide6.QtWidgets import QComboBox, QLabel, QPushButton, QWidgetclass Ui_MainWindow(object): def setupUi(self, MainWindow): if not MainWindow.objectName(): MainWindow.setObjectName(u&quot;MainWindow&quot;) MainWindow.resize(302, 108) self.centralwidget = QWidget(MainWindow) self.centralwidget.setObjectName(u&quot;centralwidget&quot;) self.comboBox = QComboBox(self.centralwidget) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.addItem(&quot;&quot;) self.comboBox.setObjectName(u&quot;comboBox&quot;) self.comboBox.setGeometry(QRect(70, 60, 101, 31)) font = QFont() font.setFamilies([u&quot;Weibei SC&quot;]) font.setPointSize(14) font.setBold(True) font.setItalic(False) self.comboBox.setFont(font) self.label = QLabel(self.centralwidget) self.label.setObjectName(u&quot;label&quot;) self.label.setGeometry(QRect(10, 60, 71, 31)) font1 = QFont() font1.setFamilies([u&quot;Weibei SC&quot;]) font1.setPointSize(18) font1.setBold(True) self.label.setFont(font1) self.TransNow = QPushButton(self.centralwidget) self.TransNow.setObjectName(u&quot;TransNow&quot;) self.TransNow.setGeometry(QRect(180, 60, 111, 41)) font2 = QFont() font2.setFamilies([u&quot;Weibei SC&quot;]) font2.setPointSize(24) font2.setBold(True) self.TransNow.setFont(font2) self.label_2 = QLabel(self.centralwidget) self.label_2.setObjectName(u&quot;label_2&quot;) self.label_2.setGeometry(QRect(10, 10, 211, 41)) font3 = QFont() font3.setFamilies([u&quot;Weibei SC&quot;]) font3.setPointSize(24) font3.setBold(True) font3.setItalic(False) font3.setUnderline(False) font3.setStrikeOut(False) self.label_2.setFont(font3) self.ChooseFile = QPushButton(self.centralwidget) self.ChooseFile.setObjectName(u&quot;ChooseFile&quot;) self.ChooseFile.setGeometry(QRect(180, 10, 111, 41)) self.ChooseFile.setFont(font2) MainWindow.setCentralWidget(self.centralwidget) self.retranslateUi(MainWindow) QMetaObject.connectSlotsByName(MainWindow) # setupUi def retranslateUi(self, MainWindow): MainWindow.setWindowTitle(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;Van能转换器&quot;, None)) self.comboBox.setItemText(0, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;MP4&quot;, None)) self.comboBox.setItemText(1, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;MP3&quot;, None)) self.comboBox.setItemText(2, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;FLV&quot;, None)) self.comboBox.setItemText(3, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;MOV&quot;, None)) self.comboBox.setItemText(4, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;FLAC&quot;, None)) self.comboBox.setItemText(5, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;OGG&quot;, None)) self.comboBox.setItemText(6, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;WMA&quot;, None)) self.comboBox.setItemText(7, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;AVI&quot;, None)) self.comboBox.setItemText(8, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;WMV&quot;, None)) self.comboBox.setItemText(9, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;WAV&quot;, None)) self.comboBox.setItemText(10, QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;M4A&quot;, None)) self.label.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u8f6c\\u5316\\u4e3a\\uff1a&quot;, None)) self.TransNow.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u5f00\\u59cb\\u8f6c\\u6362&quot;, None)) self.label_2.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;Van\\u80fd\\u8f6c\\u6362\\u5668&quot;, None)) self.ChooseFile.setText(QCoreApplication.translate(&quot;MainWindow&quot;, u&quot;\\u9009\\u62e9\\u6587\\u4ef6&quot;, None)) 二、结语我对于某些很无聊的线上转换网站感到很不快，明明是「免费」的，却要加广告，上传下载速度都慢，结果到最后下载的时候一个503代码，浪费了我生命中的十分钟。 我之所以一直在做轻量的实用工具，实际上也只是因为现在的服务太臃肿，我和某些人需要而已，事实上，很多人可以忍受这种虚假的免费，但我们不能。","link":"/01/VideoAudio.html"},{"title":"寂白之间 第六章 滇雪山林 Ouroboros Ring","text":"我在各种琐事中，挺过了一轮轮考试，读完了《挪威的森林》，那是来自天明的推荐，我有时也在想怜月与我与书中的主人公与木月有无相似之处，结论是有却不多。其中最大的不同是，我从未真正意义上了解过怜月，哪怕是从数年后的我的视角来看，我对他了解的也不多。 于是就这样，几个月在迷惑与淡然中过去了。创新班的人与中考班的人平静地度过最后一段时光，蒋竹风近乎要被遗忘，准确来说也不是遗忘，而是对昊天的恨意转为了调侃与无视，像《祝福》里写的那样，当泛滥的同情心用完之时，有的看客就要在暗地里嘲笑了，这令我又一次想起小和，想起过去的自己。 “所以你最后想要去哪儿呢？柏林？程光？”小和露出蒙娜丽莎式的微笑，不知在什么时候，对我和程光发问。我依稀记得，那天是雨天，小和的发丝是湿的，像一团缠在一起的乱麻，红漆的英式宫墙一般的建筑在雨季衬托得格外阴暗却湿暖。程光说他想要去德国，然后便缄默了。 于是小和以期待的目光看向我，我却深知自己没法说出她期待的那些话，于是我说： 去哪儿？我无处可去。我原有的梦想的唯一机会已经被我放弃掉了，不如说是根本抓不住。与其说是有选择，还不知说是没选择；与其说是有未来，还不如说是没未来。 我记得在那时，她即将开口，然而我与她都沉默了，究竟多少本该说出的话语，最终却又永久横塞在了心中，等到我再一次回过神的时候，枯黄的灯下，朱红的墙上只剩我一人的影子了。而那朱红的墙面也隐去化作冰蓝的平滑，天依旧阴郁，杭州依旧是那个多雨的城市，我的影子却不比往常，瘫成一个黑色的圆，倒在地上。 我像以往一样随意地走向办公室，梁老师还是坐在老位置，抿了一口枸杞西洋参茶，看着我，那眼神再次让我想起了小和。 “怎么了？看你这眼神，最近有什么心事？” “没什么，我想起她了。” “她？你这样的人也会有个她吗？不对，倒是应该问是单人旁的他还是女字旁的“她”。”他终于笑了。 “这种玩笑倒也不必，你不是要去中澳班当班主任了吗？恭喜啊，你还有什么要对我说么？”我快速地扯开话题。 他的表情变得严肃起来，但又经究意识到不合适，于是又微笑了：“柏林哪，你这个人有的时候太直了，我那次给你检讨的机会，结果你几乎在批斗大家，搞得大家下不来台。那时我觉得你这样的人肯定走不长远，但过了这么久之后，我可能要推翻我之前的想法了。现在，我倒是觉得你会走得比我们都远。” “所以这句话我也送给你，希望你能走得比我更远，走向梦想的另一端。另附《传习录》一本，不妨在暑假读读。”我将信写毕，用静电贴贴在《传习录》的封面，然后便走向门外，走向遥远的西南边，小泽不在，我便留了封信在他的桌上，我期待他收到的那一刻。 我撞见已经入了军特创新班的程光，我还记得他知道小和离开军特时，表情中透出的不甘与失落。他说他寒假要去米兰，签证已经过了。我问他还记不记得那日的谈话，他说那时有太多这样的谈话了，那时我大抵与他和小和有过这么一次谈话，但到最终也记不清了。他说还是像我这样写些东西才好，流年似水，有的事物带着美好几瞬就在记忆里消弭了。 但我却又说了些落寞的话来，我说：“当我将活生生的人物经作文字的画的时候，我已经在用文字来代替印象。另而言之，写作真实的事物相当于。在那些事物的记忆还留存的时候，就用文字来抹杀它们，最终虚假的记忆会在以住的空巢上自成体系，自欺欺人。过去我曾为此自鸣得意，现在我倒对其带给我的空虚有了特别的感受。很难说我这么做是对的。” 程光眉头紧皱，看似苦思后说出：“有时候你若是不失去什么，就会被夺去什么。命运与时间在你我这样的人身后追的很紧。有时来不及表达爱，思慕的人早已离开；有时来不及回忆，记忆就会散去，归根结底，你还是幸运的，你还能够想起一些残片凑起来，但我只能在流年里沉浮了。再会！”我听懂了他话里的意思，于是我便没有告诉他那件事，让“她”在他的心中留下一个飘渺的影子。这也是我极少数在那些年干过的并没有一点后悔的事。 “喂！程光！程光！”程光拖着行李箱，即将走过校门，听见我在楼上的呼喊，转过身来疑惑地看向我。 “假如，我是说假如，某日我真的将你忘却了，而记住了那一个笔下的’程光‘，你该不会要记恨我吧。”我的语言已然混乱无章，但他听懂了。他唯一的回应是耸了耸肩，然后轻捷地走出校门。 一个月后，飞向昆明机场的我，怀中紧紧抱着一个黄白色的木盒子。后来有许多熟人看过照片之后，问我那里面是什么，我说，是过去，是我不得不面对之物，是我没发出过的情书，同时也是我的遗书。 “话说你往前不是提过你写过一篇小说吗？那篇你原打算寄给怜月的，可以给我看看吗？ “不行啊，因为它已经消失于人世了。已经没有人可以寻到它，将它拿回，再将它阅读了。” “消失了？是说把它弄丢了，还是烧了，还是？”天明的眼神略有些诧异，而我的语气趋于平静。 “不是这个意思，我只是把它放在了一个永远不会有人找到的地方，仅此而已。” 金红色的寺庙已在远处渐变淡化即将消失，我行在与天一体的湖上，踩着怪石走向另一侧，三面环绕着海拔超三千米的森林。这里四季常春，一望皆是淡淡的青绿色，形成一种没有边界的模糊感，像将万事万物的勾线给去掉了一般，只保留厚涂的大色块。 湖面平得没有一丝波澜，我的存在与这些树的存在一样，没有给它带去一点水花。就连风起之时，湖面也不大有起伏，只能看得见，云的影子在湖下飞，我的影子被云卷到了一边的草地上。精疲力尽的我在草地上躺下，看着蓝得不真实的天空，没有飞鸟掠过，正如这湖上没有落叶。仿佛我又一次回到人生的黄金时代。看见他，看见过去的种种。 “奥罗波若是什么？”我问那时如师如友的他，他在本子上画了两条蛇，一黑一白，形成我最熟悉不过的阴阳图象，咬着自己的尾巴，下方注着潦草的“奥罗波若”字样。 “是个环，是衔尾蛇，”他回复道。“象征着一切都只不过是循环，开始即是结束，结束亦是开始。你以为你能够走出去，却又总在某个达成微妙平衡的地方回到原点。我写过的小说里所有的角色都是如此，他们总是以为自己能够走出既定的历史套路，却只不过是第二次、第三次开始。然后自我吞噬，走向毁灭。” “环的中间是什么？”我异想天开地提问道，但我并没有想到怜月因此沉默了许久。 “环的中间……并不存在什么东西，纯粹的不存在，纯粹的空虚。”我以为这是我第一次看到怜月词穷。但我在数年后才发现，如果让我来描述，我也无法说的比他更精确、更多。 “那又有什么方法离开呢？”我不知为何，急切地问道。 “通过空洞进入，通过空洞离开。”怜月喃喃地说。 或许在高原反应下，我的神志已不清了。在寺里喝了一碗酥油茶后，才在恍忽里走到醉醒后第一个镜头。我抬起头，摸着木桌，却发现那木盒已经消失了，我想，它已经找到它的归宿了。我却还未找到我的。我看向雪山，远方模糊的蓝白色形状，离我如此遥远。我感到它走向我。 而我走进我的旅店，店主正泡着一壶茶，他问我是否将要离开了，我说是的，在晚上六点前我会走。店主说我不妨坐下喝杯茶再走，于是我坐下了。店里放着歌，是《加州旅馆》，我印象极其深刻，不仅因为这是我第一次听。 “你可以随时为你的一切买单。( You can check out any time you like. ) “店主背过我的身去，哼唱着歌。 “但你永远无法离开。( But you can never leave! ) ”我淡淡地接上，却又突然回想起什么。当书写着这回忆的我忆起我回想起什么时，两行热泪已经掉入茶杯，浑浊了我的面目了。 (《寂白之间 (上)》完)","link":"/01/%E2%9A%AA.html"},{"title":"无韵之歌","text":"闻《凋叶棕》1234雨过石楼夏入秋，孤荷残叶谁来收？临春偏感萧寒意，苞花散尽君见否？叶凋树枯人落泪，无言语默失其所。何必分别感涕零，万水千山曾踏过。 听了上海爱丽丝幻乐团《东方妖妖梦》的一首名叫《凋叶棕》的曲子，由感而发。本来是按照木兰花的韵做的，但是最终无论怎么改还是对不上调调，就算了吧。 望海潮·千脉忧思12345678千脉忧思，随秋风起，冷凄忧怆清荫。万川哀水，挟热泪去，忆起如燕身轻。少时好光阴。无伤无思虑，心明如镜。映见五蕴，一往无行少年勤。天水凝血成冰。看败棕凋叶，衰落凋葩。湖面灵明，四起水花，悠然烟起远家。闻古寺钟遐。叹不如意事，十有七八。试看荣华一瞬，不过冢头花。 “冷凄忧怆清阴”实际上用典“悄怆幽邃”（这种多个表示同一感受的词连用很有感觉）。“映见五蕴”的“五蕴”二字本系佛教用语，不知我用的恰不恰当。 “闻古寺钟遐。叹不如意事，十有七八。试看荣华一瞬，不过冢头花。”这一段实际上是我的一位朋友帮我改的，我的原文是“心思旧难发。闻远方笙音，古寺鸣钟。人生恒常失意，荣不过塚花。”不得不说我的这位朋友真是才华横溢，只改几句，却将诗句和意境拔高到了一个新的层次。“塚花”典出《东方花映冢》，无需多言。 虞美人1234纤纤玉指细细弹，淡淡声声慢。悠然回首眉眼潸，郁郁幽幽垂下发縿縿。点点琴声鸣哀乐，寒寒忐忐忑。阑出起乘返山鹤，缓缓飐飐归故里为客。 听好友弹琴，却生起一丝思乡之情。但倘若我此时归乡的话，想必是“儿童相见不相识，笑问客从何处来。”","link":"/01/WordsWordsWords.html"},{"title":"脑中的鹿角","text":"（乱写的，轻喷） 我接受了赫特医生的治疗之后，觉得心智得到了开启，于是我拿起日记本，将今日的奇妙见闻给记录下来。然后我发现我把门锁上了，为了防止母亲在回来时由于打不开门大骂“操你妈”，我只好放下笔将门拉开。我拿起笔一股脑地将思绪写在了封面上，如其他的国际生一样，我的表层思维夹杂着汉语、英语、日语和西班牙语。然后我翻开封面撕烂几页纸，在一块较大的碎片上写道: 今天早上，我去白马湖钓马，却钓上来一只鹿，那只鹿哈姆哈姆地叫，我又害怕又喜欢。 我拿起钓竿再钓，什么也没有钓到。我牵着鹿打算离开，一旁玩着昆特牌的几个守卫让我交鹿税。我说没有鹿税只有马税，他们异口同声地说鹿就是马。我把他们揍了一顿，撞见了郭继承教授，郭继承作为一个名门正派的人，看不惯我使用野蛮的方式对待他人。于是他使用某种古怪的法术召唤了警察，他们将我绳之以法。我愤愤地问如果鹿是马的话，那鹿克思岂不是马克思。然后一旁窜出来一个马克思自设性转COSER，她的眼神十分地睿智，据我估测，睿智程度在阿布思·邓布利多和阿库娅之间。她说，“Precisely.“，话音刚落，她就被跟在她背后的孔夫子一枪爆头了。 但我还只是个未成年人啊，当我看见那粉红色的脑浆融在血水中的样子时，我注意到我得了抑郁症。我向他们求情，说我既然是个抑郁症患者，能不能法外开恩，让我把鹿带走，但他们把鹿牵走了，我也被母亲牵走了。她说要是我有抑郁症，就该找个老中医好好看一下。 我们走到临沂四院，母亲把我牵进去，说找杨永信院士，全息投影出的一个老中医说杨永信不在，但他们有万能的老中医，可以治百病。母亲非常欢喜，在机械音声的指引下，毫无顾忌地将我的三十多万存款交给了医院。我拿着挂号单，数着手指的根数，越数越快，越数越多。我用余光看见几十号形形色色的人走进去，但没有人出来。我终于明白为什么我数的手指愈发得多了，我抖得太快，抖出了重影。 “请114.514号，包籽进入404诊室。”那奇特的机械音让我进去，那我便进去。但里面一片漆黑，好像什么都没有。 “你好，有人在里面吗？”我发现身后的门已经关上，我周围仿佛空无一物，仿佛一场太空隔离实验。我是否在此刻成为了宇航员呢？我终于实现了儿时的梦想，在太空中做实验，若是我有手机的话，我一定要拍下来发朋友圈，才不管别人说我抽不抽象，可惜我的手机被没收了，我这个年纪的人，感伤时做的事情，大抵就是回忆自己上一次拥有梦想的日子，有多么地遥远。 忽然，从某个角落传来机械运作时，金属摩擦的声音，一个巨大的灯泡将周围照亮。但房间的边界依旧是黑暗的，我这么说，主要是因为我依旧感觉不到这个房间的墙壁的存在。一个穿着白色大褂的人坐在一张办公桌上，修长的手指拨弄着一个旋钮，调整着音乐的音量。我听出来那是克里姆森国王的《二十一世纪精神病人》，如同许多前卫摇滚乐曲一样，歌在前奏开始之后许久，主唱才开始演唱。 过来吧，114.514号，那个看起来很像医生的人如是说。他的笑容有些诡异，看起来仿佛一位笨拙的雕塑家用柳叶刀在一具尸体的脸上刻出无数疤痕一样。这些褶皱即使被强光照射，仍能匿住影子。我突然开始道德反思，如果这就是地狱的话，那我肯定是犯了什么错才到这儿来的。于是我一边看他的脸一边想，会不会是因为我的梦想都是偷来的，上帝保护梦想家们的版权，所以才把我丢到这儿来？我想着诸如此类的乱七八糟的东西，直到那个医生开口。 他说他叫赫特，我可以叫他赫特医生，我是他今天最后一位病人，不过他已经治了五百一十三位病人了，都是像我这样的抑郁症，方法自然是针炙，拔罐是治不好这种病症的。于是他开始寻针，我想提醒他他已经放在桌上了，但他自顾自地翻着，军刀，太刀甚至戒尺都找出来了，但就是找不到针。于是他先从柜子里拿出电疗用的电击器，将插头插上，然后得意地说，过会我们从五安培开始。 他让我躺在床上，或者说手术台更为恰当，他自己则随着音乐起舞，用匕首削着胡子；面皮被割破了，但血不淌出来，原来那不过是一幅老中医的面具；他有些怠惰了，于是将面具的下巴部分撕碎，假装自己已经剃好了胡子。 他在火焰上烤炭着生锈的钢针，把它们插到我的脸上，一定流了很多血，不然我是不会感到舌尖上传来的那甜腻的感觉的。 他将正负电极接到我大脑两侧的太阳穴，我从未感觉这么痛过，我忍不住大喊了一声，“啊——”，没有回声，他也没有回应我的呐喊，在这刑场上，我仿佛孑然一身。 他似乎对我有些不满意，他说我只需要接受就行了，就只会感到有一点点恶心。这比起含心茹苦，任劳伤怨养育我的父母所受的苦根本不算什么。他们交了几十万元，只为从孩子的身上驱走一种他们不理解的病症，他们理解的只有给够了钱，医生就会用柳叶刀割开脑子，将坏种取出来。或者说他们只是想要别人看不见而已，毕竟只要别人看不出来，便相当于没有。他说他在重新雕刻我的灵魂，我应该感恩。在经过了几个小时或几分钟后，电击终于暂时地停止了。音乐也停下了。 “好的，你认为你现在还有抑郁症吗？”他的眼睛透出青白色的光，注视着我，仿佛在催眠。 “没有，没有。没有！”我注意到他的手又要倾向那开关。我回想起巨量的电流倾泻着流过我的大脑，使我的意识时断时续，我甚至感觉我短暂地死亡了几次，又被复活了几次，像弗兰肯斯坦。鹿、钓竿、枪、修长的手、柳叶刀、404号房间、针、宇航员，我是宇航员吗？还是说我是实验品？我面对着他的笑容，踉跄着倒退着走出号间，我笑了，我从来没有笑得这么开心过，我猜测是因为某种快乐像羽毛一样入侵了我的意识。按照他所说的，我没有疯，我只是变得例外的正常了，不是一般的正常，正常人所达不到的正常…… 我将碎片折好，放入琴键之间。我突然不想弹钢琴了，因为我发现我无论怎么摁，那个琴键也摁不下去了。我只感到郁闷和慌张，我感觉有一种鬼在这附近摇晃着；于是我走进了我母亲的房间，找出了那件自从我父亲去世后就再也没人动过的婚纱，我换上婚纱，将钢琴合上，回到房间里，拉上青红色的窗帘，用一把鹿角贯穿了我的脑子，这次我见到脑浆的时候，没有先前那么害怕了，都得感谢赫特医生的栽培。 （和《鹿乃子乃子虎视眈眈》没有关系，我觉得那部番也就还行。）","link":"/01/BranchesInMyBrain.html"},{"title":"彩","text":"王彩艳拖着尚发着低烧的身体回到家中，耳边还回响着领导“小王”、“小王”的叫声。她静静地看着那一面裂痕斑驳的白墙，水壶中溢出的白烟凝在窗上，仿佛在这五十年来的小家中下了一场雨。她的脑子此时似乎也不大灵光，在尝试数次用手撕开“清开灵”和“板蓝根”的包装之后，她还是从橱柜里取出了剪刀。 将颗粒摇匀之后，她一饮而尽，有些烫，但她只想尽早喝完躺下。她解开领花的结，将西装外套和包臀裙叠起来放进衣柜，清一色的黑白，其中夹杂着一些灰蓝，藏青与淡棕。她倒在床上，刷着一些短视频，关于蒸蒸日上的经济，靖国神社的倒塌，两千元人民币相比三千美元的购买力优势…她的手指一直在向上划，直到她看见一个名为“白马湖漫展枪击案”的视频，但在视频加载完之前，它就被下架了。她只感到无趣，便将手机放下，合上双眼，沉沉地睡去。她被电话铃声惊醒了，是肖邦的《谐谑曲》，灯光透过她眼角的泪花，显出一片虹。她拿起手机，是一个陌生的号码，看地区，倒有可能是昨天在柜台和自己谈了很久却没有下单的客户。她清了清嗓子，直起身来，接通了电话：“喂，您好，这边XX银行王彩艳，请问是要办理什么业务吗？”但当她听到那熟悉的声音时，她怔住了。“彩艳啊，是妈，妈最近换了个号码，你最近过得怎样啊？找到男朋友了吗？”母亲的声音从扬声器中传来。“有什么事吗？”她那热情甜腻的声音瞬间变得冷淡，甚至有一点害怕，她的眼睛向下瞟，看向那红色的挂断键。“哦哦，你忙是吧，那妈就长话短说：你哥找了个女朋友谈得特别好，很快就要结婚了。但是…”“但是什么但是？”彩艳逼问着母亲，掩饰着自己的慌张失措；母亲停顿了一下，似乎她也不大好启齿。“你哥掏不出彩礼钱，你知道的嘛，她们家里是江西那边的。就差这一下了，你哥要是掏不出这钱，人家就会觉得你哥是个穷小子，配不上她们家的女娃。”不知是因为什么，母亲的语气愈发从容了起来，仿佛要钱是一件很光彩的事情一样。“多少？”彩艳咽了口口水，她感到渴，脊背上已然汗珠密布，不知道是因为药效，还是自己过度紧张。“五十万。”母亲几乎没有犹豫，仿佛这个数字对于他们不算什么大数目，但彩艳却倒吸了一口凉气。“五十万？妈！我们没这个又要打肿脸充胖子！就算我把车卖了也付不起呀。”她的语气仿佛在哭诉，虽然她知道这只不过是一种情绪的发泄。“我们家穷还不是怪你没出息，你上大学花了多少钱，赚的还没有你哥一个中专出来的赚得多！”那个名为父亲的声音加入进来。“你哥现在倒是家里最风光的了，他可是一年挣不知道多少万，认识数不清的大老板——”他说完了又想说。“我哥这么有钱，怎么不自己付彩礼呢？那么多大老板们的手里，多少总有点闲钱借给他们的老朋友吧。”她将“父亲”打断了，扬声器里久久没有声音传来，这次家庭通话大抵已经要不那么愉快地结束了。“他去投资了。”那个男人压低了自己的声音，隐藏着微微的笑意。“投资？投资什么？”她想起当年在大学里被他的狐朋狗友追着要保护费的日子，想起他在家中堂而皇之地吹嘘自己的人脉优势的日子，或许正是从那时，她意识到了她和他们不是一路人。“这你就不用关心了，我们生财自有道，不便传于外人。”电话被挂断了。果然，自己一直都没想错过，他们就是这样的人……确认了自己的体温还不算高，且并没有得新冠后，第二天，她照常去银行上班；她收到了一条消息：“请收到这个消息的员工立刻到三楼办公室来一趟。”三楼只有一个办公室，而她今天其实不太想见行长。“请进。”行长把他们请进来；青白色的灯，灰白色的墙，一尘不染的黑色地板，黑白色的大理石雕像仿佛在暗示，他们都只不过是融于光中的影子；而整个房中唯一的色彩，即是行长手中的三张彩色纸条。“因为我十一月底要去卡塔尔度假，所以这个月的月度最佳员工就趁我还在的时候发掉好了。但是我实在没法从你们三个里挑出一个，所以我们抽签；为了避嫌，就请小王来抽。”她走上前，行长的手像电影里魔术师的帽子；她慢慢地拿起粉色的纸条，注意到行长的眼神似乎有一些变化，但她并没有理会，展开一看，上面是自己的名字。她十分开心，但不知为何还是没有笑，她能感到自己的身后，有什么东西正很诡异地靠近她，在粉色的纸条上投下影子。她转过头去，却看见是行长站了起来，在她的耳边轻言：“张屹。”她能感受到他比她还紧张，不知道为什么。“张屹！”她无意识地喊出了声，行长喘了两声气，抿了抿嘴唇，尝试隐去自己的笑容。张屹也没有过多的喜悦，而是愣在了原地，不知该干什么。另一个同事则是满脸困惑，默默看向乌木大门，想要离开。“张屹，刘艾刚，你们先下去通知大伙等会在二号会议室颁奖；彩艳，嗯？你先别走，我有些话要与你说。“二人快步离开，行长坐回了椅子上。彩艳感觉像是一个一直被端详着的花瓶，不敢说话的花瓶。“这回多谢你帮忙了。咳，奖金我会给你的，但这个奖真的只能由张屹拿。”他的话语略显软懦。“为什么？”她下意识地回了一句。“他是我朋友的侄子，多拿些这种奖项之类的，以后评职称好评一些。”他的语气中蕴着一点矛盾，但那职业的假笑浇灭了所有人情味。“……”她不知道该说什么，或许自己根本不配在这种场合说话。行长也注意到了她的不自在，便也想让她走。“那这五千块钱转你了啊，彩艳。有什么‘获奖感言’吗？”她仰起头看向头顶的炽灯，眼前依稀虹彩陆离。“我不知道，这好像是我应得的东西吧，但拿到手时，总感觉有种，中了彩票的感觉，但又没有那么开心……”“你还是开心点好，快回去接着上班吧。”她回过神来的时候，已经快要下班了。她在工位上刷着手机，不知夕阳欲颓；直到母亲发来一条微信，说今晚有大喜事，务必要回家吃饭。他们学聪明了，没有打电话来渎扰自己，正好这次回去也可以和他们说清楚，和他们划清界限。她驱车驶向城市的东陲，将日光抛在身后。她又行至熟悉的家门，门前贴满了各式各样的小广告，有的还是00年代的，已经烂在门里了。她推开门，她看见那个男人和母亲，她努力地匿住自己的不适。“哼，你终于还是滚过来了。”名为父亲的那个男人抽着烟，躺在躺椅上冷笑道。他不是爸，爸在自己很小的时候就死了，或者逃了，反正人间蒸发了，没有人能找得到他，连尸体都寻不到。可能指望爸比那个男人好也不大切实际，但自己也只能这么指望了。彩艳一边想着，一边四处踱步，却怎么也躲不开那个男人身上的劣质香烟味。她寻不到话头，便问：“不是说有甚么喜事吗？喜事呢？我都来了这么久了，也没见着什么喜事啊。”“你个小丫头别急，等你哥带上他那小女朋友来家里吃过晚饭，就自然有喜事了。”话音刚落，门铃就响了。那个男人立马直起身来，一路小跑着去给哥和他的女朋友开门。二人进来之后，男人光是笑脸相迎，然后把哥拉到一边，说：“她怎么和APP上长得不一样？你看看她那对眼睛，像个比目鱼，你怎么下得去手的？”“我都问了快几百个了，也就只有她愿意来家里，将就将就得了，你以为你是谁？”哥似乎有些不留情，那个男人面红耳赤，走回了房间。女孩似手也不大开心，刷着手机，摆着一副臭脸，彩艳便走到哥的旁边，问：“那个喜事…到底是什么啊？”哥的表情倒是很轻松：“体彩你晓得不？前阵子我认识的那个黄老板，他就是做这行的。他说他有内部消息，说今晚德国必大胜日本，让我买德国三比零日本。我看了一下那个赔率，赚麻了，赶紧网贷了五万买了德国三比零日本。高低赚个七八万，再接着买，等到世界杯结束，我岂不是要成百万富翁？哈哈哈！”“可是……”“可是什么可是？黄大仙可是十三连红的高手，他的消息怎么可能有误？你就眼巴巴看着你哥我赚大钱就是了！”她已经不知道该说什么了。在一场无声的晚餐后，一家人整齐地坐在沙发上看电视里的球赛，很快萨内就进了一球。那个男人和哥开了不知道第多少瓶啤酒，他们已经几近要晕过去了，时不时嘟囔一句：“怎么还不进球？快给老子进球！”终于，在等待许久后，比赛迎来了第二枚进球，震耳欲聋的欢呼声将两个沉溺于发财梦中的男人唤醒，他们惺忪的双眼看不清电视上的比分，只能分辨出屏幕上那蓝色的光。“日本队进球了！堂安律头球破门！日本队扳平了比分！”播音员高亢的声音使所有人感到畏惧。“什么？鬼子进了？鬼子扳平了？鬼子他妈真他妈进了？”哥成了一头野兽，歇斯底里地扑在女友身上，女友看着他瞪得浑圆的眼睛，吓得连尖叫的力气也失去了。而那个男人正手执一根铁棍，重重地打在门上，仿佛在打战鼓，门里传来嘶哑的母亲的哭喊声。她大抵正死死地顶住那门，向着高天之上的神佛求助。作为整座宅中唯一一位还没有被侵犯的女性，彩艳飞快地跑出了门，将大门从外面锁上，邻居们都在欢呼，浅野拓磨又进了一脚漂亮的反击，人们欢呼着日本队战胜了德国！但她在漆黑的楼道中只能感觉有什么人在看着，对她的窘境一边笑一边鼓掌，一边欢呼。她摔了一跤，连滚带爬地跑上车，她只想出，想要话命。车灯照亮了水洼上的油脂，在黑夜中放出彩红色的光。她无意识地向着某个方向开着，直到油脂干硬化作腐臭的黑泥，直到耳边不再传来尖叫，尖叫，尖叫…… （收录于《明治十七》）氿月2024/9/5 （瞎写的，别骂。）","link":"/01/ForbiddenColor.html"},{"title":"义和拳","text":"日本人是“有小礼而无大义”的，这是很可以确认的。那与之相对的，我们中国人就是有小礼又有大义的（或者说，有大礼又有大义更合适？） 国足零比七惨败日本队后，我见到一种说法，那就是国足应当踢人来减小潜在的比分差距，使对方不敢进球。这种说法初一听带点滑稽，但是看见支持者声泪俱下的姿态后，我发现他们可能是认真的。甚至当我在短视频平台上刷到官媒转发这些观点的时候，我瞬间就开始认为他们是对的。但作为一个真的看过比赛的人，仔细一想，国足或许并非有能力踢人，刘洋两次放铲久保建英，两次都不中，还给自己整伤了。另外，板仓滉被肘击，杨泽祥铲倒南野拓实……这真的没有“踢人”吗？看上去是踢了，所以我不知道他们在哭什么。说到底，我也开始怀疑我们到底占不占理了（应该是境外势力入侵了我的意识），于是我只能在史书里翻检，因为在我的印象里，这似乎并不合乎什么礼。幸亏我是错的，中国队的“踢人”，在史书里有料可查，国足寻回了数百年前大清人民的智慧，那便是：义和拳。“义和拳”在这里，不能够作为一个词理解，我们应当将其理解为一种遥遥领先的战术——其遥遥领先性体现于作为一个清朝时期就已经出现了的奇妙战略，它在现代依旧适用。在义和拳战术之前，我们自然对对手施加以礼，我们是有礼的，就算是面对狡诈阴险的日本人，我们也要送礼，我们光是上半场在门前就送了日本队两个大礼；甚至不止在场上，在场下我们也要送礼。但是日本人似乎过于贪婪了，我们都已经送了两个大礼，但他们还是想多进几个球，此时，便应该使用义和拳战术了。首先便是强调公平正 “义” ，宣称对手买通了裁判，或者有什么主场优势，抑或是球员犯规比我们多。若是对上日本，那除此之外就要提福岛排放核污水，侵华战争和靖国神社。但是这样似乎也没有什么用，比赛似乎也没有变得更好看起来。然后我们便只好割地求 “和” ，我们的解说们和博主们就瞬间失去了高傲的态势，开始倒地求饶：“别进了！别进了！”“一场比赛进三四个球差不多了。”然后又开始灭自己威风，夸起了对手：“他们的球员都在五大联赛踢球，和我们的球员不是一个水平的。”理论很完备，但从实际操作上来说，这似乎也并没有结束对手的进攻趋势。最后我们便要打 “拳” ，确切来说，这是我们骨子里的温良的一种体现，包括但不限于嘘对方球迷，对方国歌，在场上多犯规，打出血性，甚至打出出血量；踢废对方球员，甚至直接击毙。还有更加巧妙的方式，那就是换上格斗武术队，丢两球以上就在场上开始打人。这要是还耻辱大败，那就使用东风导弹。果然日本人害怕了，他们踢进七个球之后，终于不敢进更多了。比赛的比分是七比零，国足输了，他们没有血性所以输了；但球迷赢了，球迷们可以在网上吹嘘义和拳战术的伟大了，他们可以做漫长的白日梦，可能直到下一场比赛开始，他们才会醒来。九月十日在大连梭鱼湾足球场发生的事也和我猜的大差不差就是了…… 氿月2024/9/16 （瞎写的，别骂。）","link":"/01/IronFists.html"},{"title":"失落的桃花源","text":"“先生去哪儿？”我清晰地记得那天我再见桃花源时的一切细节，包括出租车司机的北方口音。 “桃花源。”是的，那个时候他们也都还没有失业，乘客与健谈的司机还是有话好讲的。 “啊——好久没有人去那儿了，先生是本地人？”他拖长了语调，显得十分惊讶地问道。 “我在那里曾有一套房产。”我不知该如何指辞，或许一个“曾”字已然含括了我对之所有的感情。 “哦哦哦，那不奇怪了。”他似乎也慌起来，仿佛我们在谈论什么不祥之物；汽车的速度时快时慢，但这条公路上明明没有别的车辆，远远地我望见了塔楼和如墓碑一般林立的公寓楼。再靠近些，我就能看到无数黯淡的窗与积满腐叶的阳台。不对，就在我视线的远端，有什么东西在闪烁着，这里有人吗？哪怕有一个呢？哪怕有一个人还在此地生活呢？不，那是一盏路灯，其上结满了蜘蛛网，在午后不合时宜地亮着。到了，我到了，时候也到了。我拿出一张大钞，让司机不要找钱，赶快离开，但司机反问我我该如何离开，我一时不知该如何回应，我想摆脱他，有时我想摆脱任何人，摆脱所有一切…… “谢谢师傅的好意，不过这不是师傅您要考虑的。”他便离开，我独自一人行于灰尘扬溢的道上；那又怎样呢？我想道，我回到了这里，又是来干什么的？我不知道，或许只是因为没有什么事更值得自己去做了而已。我只庆辛母亲没能看见我活成这样的一个人，我已经够让她失望了，她没有必要再承受我的悲伤，但她一直在承受，甚至承受了我与她告别时流下的最后一滴泪。 我爱我的母亲，确切地说，有时我甚至觉得我比我的父亲还要爱她；我不确定这算不算一种俄狄浦斯情结，反正内心深处，有这么一种我名为爱的东西，能够让我原谅她当年对我的所作所为。她将我逼到自杀，为了将我的抑郁症治好在骗子身上花光了父亲给我留下的三十万；但在所有人都以为我死了的时候，是她将鹿角从我的颅中拔了出来，但她能救我，我却不能救她。 藤蔓般萦绕在断壁之上的钢筋，被不满的住户打穿的墙上的洞，起伏不平的柏油路，像古文明的遗迹，桃花源藏身于郊区的一隅。当下是秋天，桃花已落寞，而这些只为被观赏而生的树也几乎没有可能结出果实。我知道置办房产不是一件我这样的庸人容易办成的事，我有一位朋友在温州买了一套江景房，那已经是八年前的事了，现在他依旧为了这套房四处奔走；我和他的境遇比起来也好不到哪里去，也许我过得好一些，那也只是因为我学会了释怀，我不再去对固定的住所，和有钱阶级的优越感有任何非分的向往，我也不再去试着与女性交往，我释怀了。而且我也很久没有想母亲了，我重新学会了将时间分配在不那么重要的事情上——我似乎一点也不后悔，毕竟不去面对是我的选择。但我最终还是回来了，我回到了那停留在九十年代一成不变的故园。 事实上，我在回到这个陌生故乡的第一个晚上，在一家青年旅舍里做了个梦，我就梦见了母亲，确切地说，母亲的坟墓。在这一方小小的山地上，我花了四十万元，这大概率将是我一生第二大的消费；她只想要入土为安，所以我成全了她，我用透支的信用卡，网贷和数年的“007”工作成全了她。我不知道是什么原因，可能是因为在我的记忆深处，这座城市始终有她的影子，我挖开了我为之奋斗数年的人生的里程碑——她的坟墓，我想见见她，我没有想通为什么我会以这么一种极端的方式求见唯求安息的母亲，可能是因为在梦里我没有太多的思维，也有可能是因为我的大脑过于畸形，在现实中也一样，我只能在生活的碎片拧成的铁索上蠕动。 但我没有想到的是，坟墓里没有任何东西，唯有泥土。不可能，根本不可能，我是看着她沉向地下的，我这样念着，一铲一铲铲出所有的土。突然我的脑中闪过一个令我自己也吓了一跳的念头，或许我和她本来就是不对等的，有时候我或许可以考虑了结我自己，但她没有这份权利；因为在那些日子里，我有时会忘了去关心她，有时我甚至想要去尝试不关心她，这样我就真的可以对我自己下手了。但是她永远不会忘了去关心我，哪怕是以不那么符合我期待的方式。母亲，母亲，求你了，再让我见见你吧，我在心中默念。我忍不住了，我跳了下去，在泥土里翻找着，却什么也没有找到，坟墓里只有我自己和我背负的一切。 我倒下了，太累了，或许是我的梦还不够深，以至于在梦中我还能感受到自己的疲惫。梦想、理想、音乐、文字……太多东西随着我的倒下散乱在地上，交融着，腐烂着，发出甜美的香气。我不想离开了，我想把太阳的光遮住，把月亮的光遮住，我想在最切实的黑暗里被埋葬。我的愿望很快就得到了满足，我能感受到有什么东西在给我盖上被子，很温暖，很潮湿，让我想起了八月的杭州。我试着停止呼吸，有什么东西在和我的身体共生，我没感觉有什么不好的，一切都很舒适。直到我的鼻腔中爬出一只蛆……我从梦中惊醒，却看见枕头上全都是鼻腔中流出的血，非常多，非常多的血。我不知道该如何处理，小时候他们说仰起头就行了，后来似乎又有别的说法，于是我什么都没有干，直到不再流血，我猜这应该不会让情况更坏。 电线杆光秃秃的，其间也没有电线连接，似乎桃花源的住户们那时很有意见，认为电线杆破坏了社区的美感，现在电线已经被埋在了地下，电线杆还未被撤走，恒大却出事了，他们也早已消失在不知处了。人们找他们讨要“一个解释”，我却不敢有这个程度的奢望，于我而言，如果这种程度的事情也“要解释”的话，那我一生估计都要在抗议和游行中度过，我很识趣的离开了，我甚至都没有想过纠缠合同里的细枝末节，抑或是和恒大的喉舌勾心斗角，我太累了，既然我不配得到一个可以称之为家的地方，那就没有好了。我从某一刻起意识到必须要离开这个地方，寻找一个能让我不再停留于九十年代的小城，而活在二十一世纪的身份。商户们离开的比我还早，或许是因为他们比我们更会捕风捉影，在我离开的那天，喷泉流出墨绿色的水花，像一块浑浊的青玉；但到我归来的时分，喷泉里连水也没有了，唯有破碎的雕像和石块，像是被八国联军洗劫过的圆明园，可能少一点战火。 说来也奇怪，我总有一种模糊的感觉，这些棕灰色的公寓楼像一片碑林，桃树像献给逝者的鲜花，而我们像在墓冢挣扎着求生的蝼蚁。我这一生仿佛一直在品味自己的失落，这正常吗？请原谅我在这方面的无知，愿意与我熟识的人不多，且大多也都是和我一样容易感伤的人。我想着，走到家楼下，用几乎依旧崭新的钥匙打开门。房中还有我当时遗落的东西，没有人来整理，没有人进来过，厚厚的灰尘上没有脚印。除了早已过期的盐酸舍曲林和一些更没用的东西以外，这里什么也没有。 母亲的轮椅还在房中，我掸了掸上面的积灰，坐了上去。我坐过轮椅。那是在初中的时候，我与同学们踢球时，对方的门将突然急了，一脚将我的小腿踢骨折了。我记得我恨了他好几年，但是我已经不记得他的名字了。他经常在我不知道的时候出现在我身后，摆着一副庄重的表情，几乎是慈悲地看着我，我不理解，我只是害怕。我没有什么人际交往，他其实一开始也相当不喜欢我，他只是一直觉得他欠我些什么：在赔偿医药费之后，在无声的霸凌和私下的攻击减少之后，他还欠我些什么。我也不知道他欠我什么，那时的我只觉得他莫名其妙，而且相当怕他。 在他消失在我人生中之后，每当我坐立难安之时，我总是能够感觉到，一个影子在我身后，用同样怜爱慈悲的眼神看着我。就像那一刻，我在警觉中转过身去，却发现偌大的房间里什么也没有，只有我一个人。这房子不闹鬼，我在这里住了很长一段时间，我是知道的。那那个影子是什么呢？我闭上双眼，看见维多利亚式的塔楼在阳光下熠熠生辉，小孩们在塑料的游乐场游玩，小贩们兜售着各种奇异的零食，湛蓝色和铜绿色的琉璃窗，人们谈论着即将到来的新时代，喷涌于雅努斯雕像之上的白色泉水，还有立于门前看似极为吉利的桃树。那段日子仿佛一切都是好的，上涨的股票，上涨的经济指数，摩登的楼盘，一切都向着光芒而生，仿佛一切都在和最新潮的大城市看齐。但真正经历过当下的我却不敢睁开眼睛面对一切，未来究竟会是什么样呢？吉耶？凶耶？给个定数。 桃花源以白夜般的寂静回应。 氿月2024/10/1（收录于《明治十七》）","link":"/01/ParadiseLost.html"},{"title":"致命玩笑","text":"（谨以此篇，致敬阿兰·摩尔的《蝙蝠侠：致命玩笑》和鲍勃·迪伦的《沿着瞭望塔》。） “目前一切正按照计划进行，龙净已经到达公寓内部，我也已经准备好狙击了。”狙击手如此说道。 “好，只要你看到他走到窗前，就立刻击毙。”对讲机传来了指令。 “其实我有些事想告诉你，阿卜杜勒……”龙净背对着阿卜杜勒，缓缓地走向窗台。 “快说吧，无论你要说什么，现在是最后一次机会了。”阿卜杜勒的声音突然变得冷淡，但令龙净更加不安的是保险打开的声音。高大的西亚人用枪口抵住了他的后脑勺，毒枭发现了他们的计谋，但他似乎并不急着杀死这个叛徒。 “我现在不急了。”龙净坦然地说，“你已经知道了。” “你跟我跑金三角十年了，这十年里，我给你讲完了我所有的笑话，不是吗？”毒枭冷冷地笑了笑。 “是。”龙净的回应宛如风声，不过阿卜杜勒也并不需要他的回应。 “弟兄们都死完了，就剩你我了，现在我给你讲讲我最后一个笑话。”毒枭的语气中带着一丝愤怒和不甘，“也就只剩你还能听懂了。“ 透过瞄准镜，狙击手清晰地看到龙净的身影，在纯白的月光下，他向窗的另一侧行进；他的身后即是毒枭，那毒枭的手被月光映得显出煞白，它正紧紧地握着一把左轮手枪，并逼着他往房间的另一侧走。那手臂逐渐地进入他的视野，致命部位还没有出现在视野里，还太早，不能松懈，就差一点了…… “他走进视野范围了吗？”领导的声音打破了寂静，他下意识地确认了一声，“立刻击毙！” 狙击手无意识地扣动了扳机，但阿卜杜勒突然用力将龙净拉回，他的枪也几乎同时射出了子弹，两发子弹穿过了龙净的腹部，他重重地倒在地上，鲜血流在污秽的地板上，而那血泊上正倒映着洁净的月光。当他意识到自己做了什么时，高大的西亚人已经消失在了视野的远端。 “龙净！龙净！哥！哥！”狙击手将耳机摔到地上，以最快的速度跑下楼去，又迅速跑上另一座公寓的顶层，他听见诡异的声音，尖锐的声音，金属摩擦时产生的声音。他一脚踹开了大门，寒风萧瑟，他不由得裹紧了外套。 “呵，呵呵呵，哈哈哈哈。为什么啊？为什么……”但他刚刚听见的不是凄惨的叫声，也不是死前的平静。他的兄长在笑，龙净在笑。 “那个笑话，那个笑话……”龙净乌黑的瞳孔几乎要散到眼白里，从腹部伤口涌出的血流终于逐渐开始平息，笑声愈发嘶哑，最终嘴唇变白，笑容也凝固在了脸上。龙武流着泪，为他的兄长合上了双眼，将笑容也理成了一副庄重的遗容。他感到有什么人在看着，于是转过了头去，那建筑也随他的视线歪曲旋转，像在不稳定介质中寻求通路的光一样。逐渐地，色彩和意象都融成了一块，在暗灰色的世界里，模糊地飘出一段文字，他不确定是在他眼前显现的，还是在他心中出现的： 曾有两个人窘于荒野之中…… 龙武在车上醒来，不错，确实曾有两个人被囚于荒野之中，不过那是三年前了。他看向手机，自己要迟到了，他换上警服，然后一脚将油门踩到底。他半睡半醒，分不清亮起的究竟是红灯还是绿灯，不过是哪个也无所谓，毕竟自己开的是警车。勉强在狭小的缝隙里停好车后，他走进局里。 所有人都向他问好，这很自然，毕竟自己现在与三年前是大不一样了，三年前自己还是那个王八的棋子，现在自己已经坐在他的办公室里了。他现在可能正在暗无天日的牢房里像个老鼠一样爬着，他活该，如果不是他与阿卜杜勒的私下交易，金国与东之国边境的毒贩就不会那么猖獗，他就不会被阿卜杜勒抓住把柄，也就没有必要让自己暗杀阿卜杜勒，龙净就不会死…… 他不知道为什么过了这么久自己仍然会想起这件事，欲求身居高位的人（如果自己能够这么说的话）还是不要有太多的情感为好，否则容易误了大事。可能是因为那个谜团：他不知道究竟是自己还是阿卜杜勒杀死了自己的兄长。 他走过审讯室，他不知道为什么自己要回去，他已经很久没有面对过被捕的犯人了，他失去了折磨和摧残他们的勇气，或许是因为自己“老了”，这也许就是资历老的警察会被安排坐办公室的原因，他们失去了年轻时的锐气，就没有用了。他的思维太简单了，他什么也想不通。 当龙武看向那血迹已黄的铁窗之时，他还是能依稀地看见龙净的身影，那影子似乎正坐在椅子上，双手正被铐住；或许他只要用力，就能够挣脱，但那没用，自己随时都可以击毙他，他是毒贩。但龙武并不急着这么做，毕竟两人已经十年未见了。十年前他们俩都还是孤儿，在街上讨饭为生，终于，龙净无法忍受这样的生活，便抛弃了自己跑去东之国谋生。自己后来交上了好运，被一个好人家收养，后来又当上了警察，龙武有时候希望他的兄长在东之国过着好日子，心情不好的时候便希望他也混得很烂，毕竟故事的另一半龙武并不知道，直到那天。 那天，龙净面无表情地对自己说，在他越过边境的那天晚上，他被数个高大的毒贩抓住。很侥幸的是，他们正好缺人手，他才有机会为他们行苦役而活下来。他们让他改名字，反正也没有人会记得他的名字，他便沿用了。他很庆幸，他起码活下来了，活到了今天；但他并没有表达后悔的意思，只是表示想不到再见竟是在审讯室里。 自己的任务很简单，那就是让龙净告诉自己“安全屋”的位置，阿卜杜勒的其他手下基本上都已经被击毙，只有他还活着。因此，局里的技术人员已经模仿他的口吻，用他的设备将阿卜杜勒约到“安全屋”，一同将货物分散运到安全地点。但龙净说他什么都不懂，他什么都不明白，他并不开口，于是自己开始骗他。 那天自己说了很多谎，都说了些什么来着？说自己想要和他重新成为兄弟，在这件事情结束之后开始新的生活，他会得到自由，获得正式的公民身份，他的名字将会真正地成为他的名字，他会享有人权，拥有依靠和家人。此时，他突然冷哼了一声，他笑了，但是是苦笑，没有死前那么爽朗，自己也永远无法知道他究竟在想什么了。总之他突然答应了，他突然放下了背叛的负担，他似乎注意到了什么东西在悄然地变化。他随口吐出了那个地址，然后失魂落魄瘫在了椅子上。透过泛黄的玻璃，他看见那椅子现在已经断了腿，被原先固定用的钢链悬在空中。他终于回过神来，三年恍如隔世。 他回到办公室，手机上有几条消息未读。他看见那张熟悉的脸，点开语音，正是那张自己曾在瞄准镜中看到的脸，他感到害怕，他不害怕阿卜杜勒，他害怕什么呢？ “龙哥，我们找到他了。那个走私犯的名字是马利克，他在雪德寺附近的一处仓库库房被监控拍到了，这是他的脸。”他点开语音，神情恍惚：“看来是天意让我再见到你，不是么？” “我亲自去处理他，不要通知其他任何人。小马，你干得很好。”他拿出了抽屉里的枪，确认子弹充足后，便走到了警车前，警车里的油应该够他开到雪德寺，至于别的，自己都不想管了，自己什么都不再关心了。在当下，一切都不过是一脚油门的事；车已开出，对未来的思虑都来的太迟了，失去了意义。到海滨大街时天色已黯，他换上了便衣，独自一人巡逻，他看着监控摄像头向后数，不会很远，马上就到了，他愈发紧张起来，直到来到门前他的心才平静下来。锈蚀的锁被轻易地拨开，库房里空无一人，只有用过的注射器与一整柜的毒品。 夜里的仓库一片漆黑，唯有月光相映，一个男人走进门，脱下皮夹克，将尚有余温的手枪丢到地上，然后走到柜前，在柜子里翻找着注射器，他并没有留意到那是用过的注射器。不过就算他知道，也不会在意。他只想给自己尽快来上一发，根据线人的消息，当地的警察已经对他的这个身份有所怀疑，他明早之前就应该离开这个城市。突然，他隐隐听见脚步声，他立刻拔掉针头，伸出手去捡一旁的枪，但他抬起头时，却发现脑后便是枪头，就像当年一样，只不过自己现在是被枪指着的那一方。 “别想着捡枪。”龙武走进了他的视野，有那么一瞬间，他以为龙净复活了，那个自己再熟悉不过的东方男人从坟里爬了出来，走到了他面前。不，这两兄弟完全不一样。他闭上了双眼，等待子弹穿过他的头颅，但他并没有像自己所想的那样被击杀。 “给我讲讲那个笑话吧，阿卜杜勒。三年前龙净死前，你给他讲的那个笑话。”他的语气十分冰冷，像是在审判。 “什么？你怎么会问这个？”阿卜杜勒怔住了，然后突然发笑，他没有想到龙武竟然会问这个，他的背上涔出冷汗，“你真的想听吗？” “少废话，快说。”龙武蹲了下来，将阿卜杜勒的枪夺走。阿卜杜勒看见龙武极小的瞳孔和血丝密布的眼睛，他早该猜到的，不过这也不重要了，于是他开始唱。 “There must be some way out of here,”said the joker to the thief,“There’s too much confusion,I can’t get no relief.Businessmen, they drink my wine,plowmen dig my earth,None of them along the lineknow what any of it is worth.” “什么？不可能？你在撒谎，这不是那个笑话……这不好笑，这根本就不好笑，你究竟想要表达什么？这个笑话究竟想要表达什么？”龙武一脸茫然，止不住地摇头，龙净死前的笑脸浮现在他面前，那般释怀的笑容此刻也逐渐浮现在阿卜杜勒的脸上。 “这就是……本质区别，你还没有发现吗？这一切都不过是个大玩笑。呵……呵呵，我记得年轻的时候，我常常步行很远去海边的餐厅里，坐在点唱机边上听这首歌，那时候我还不知道鲍勃·迪伦，不知道他是一个美国佬，我年轻的时候什么都不知道。头一次听这首歌的时候，我莫名地感觉自己很滑稽，然后我就想笑，笑着笑着，什么都忘了，忘了家人，忘了朋友，忘了想——” “——的念头。”雷鸣般的枪声打断了阿卜杜勒的独白，阿卜杜勒看着从伤口中流出的那一大滩血，但不知是因为药物的作用，还是因为自己的结局过于可笑，他看着龙净的眼睛，止不住地笑。 “原来，你一直都知道。哈哈哈……哈哈……哈哈哈哈……”龙武听着他的笑声，心中生出一丝害怕，他快步跑出漆黑的库房，阿卜杜勒笑出了眼泪，那眼泪掉进了血泊里，激起一丝涟漪。 而那血泊上倒映着洁净的月光。 氿月2024/9/24","link":"/01/TheKillingJoke.html"},{"title":"水上烟花","text":"入夜尚未深，上弦月便已高悬在京都的夜空，乌云也很识趣地散开。少年少女们结伴穿过街头巷尾，走过三条大桥之后再各回各家。我还是一个学生的时候，经常在三条大桥看烟花，毕业了之后，我的记忆里这烟花便没有升空过了。我也犹疑过，或许在那几年后，这幸福的象征就被取消了，可能某一个一直为之筹款的富翁离世了，抑或是那个放烟花的人也已经过了欣赏烟花的年纪。当然更有可能的是，我不关心了。 确切地说，我不再关心了。起码那时我是很在乎的，我会在随身携带的本子里记下烟花升起的时间和最佳观赏点，然后在每一天放学后，在三条大桥写着作业，等着烟花出现，然后看它如何用其源自工业文明的光彩，让繁星学会谦卑；看它延展开曼妙的线条，在星空中做几何画；看它用存在超越造物者的想象，让少年少女们感到温暖，感到升腾，感到爱的热望；看它如何像一只被嵌在黑曜石里的蓝蝴蝶，在星月的注视下飞向远端，飞到我们看不到的地方。这就是我贫乏的想象力所能联想到的极限，没有人能理解我当初究竟在看什么。 那时候母亲为了我的学业陪我住在京都，我晚些回家，免不了她的责骂。那时我会找个借口，大多是与同学有约之类，反正搪塞过去就过去了。母亲知道我在外面有自己的社交，也不再说什么；但我其实没有，那些夜里只有我和烟花，还有永远写不完的作业。似乎还有她，在母亲不知道的夜里，我透过屏幕一直注视着她，那时候熬夜与压力无关，在无梦的清晨醒来的我只是感到年轻。 我忽然又对烟花生了兴趣，于是我又走回桥上，一旁几个年轻人挤在栏杆上，正谈着他们的天；我凑过去听。 “都什么年代了，怎么还有弱智写这种东西？” “出版社现在真的闲到这个地步了吗？” “幽默。”我看他们笑的这么开心，也跟着笑了起来；此时他们终于发现了我的存在，不过他们也不太关心，大抵是发现了我对这本书的意见与他们相同。 我看了一眼他们的电子屏上正显示着什么——他们正挖苦着的，是我的新书《粒子力学的数学原理》；看一眼评分，竟然只有0.8，也难怪他们这样嘲笑我；我记得我在学生时代，也是喜欢这么讥笑评分较低的书的，尤其是在他人面前，这样可以体现自己审美的优越。不论如何，起码它还是比一些无法评分、无法评论的东西好上那么一些的。我只能这样自己安慰自己。 我写科普书已经好几年了，销量上的相对成功掩盖不了口碑上的绝对失败。事实上我已经愈发不满足写这种民科刻板印象式的“科普书”了，我想写一些“真东西”。但出版社不愿意出版“真东西”，读者们喜欢看一个自命不凡的科学狂人闹笑话。纸媒和科普读物的市场已经很小了，营销号和短视频已经快要让我们失去最后的生存空间了，我不敢考虑未来几年我应该去干什么，我的文笔不足以支撑我当一个作家，而我又没有能力搞研究；于是我只好写一本又一本的“笑话”，我甚至不敢直视这些书的标题，正如我认识的很多人在领薪前不敢直视卡里的余额一样。转念一想，我的生活似乎过的比他们自在。但我越想越觉得不对，如果我时刻在体验作家生活的那种松弛感，我怎么会感觉不到呢？ 我走下桥，走到车站。我坐在等候区，无所适从，看着人们机械地在屏幕上划动手指。我也掏出了手机，往下划着，刷到了一个虚拟主播的直播间。在我还年轻的时候，我非常喜欢看虚拟主播。我最喜欢的主播叫佐玖菅眠，她自称是下岗的梦神，在每个人的梦中都出现过，并在我们的睡梦中播下了种子，让我们的潜意识指引我们来到她的直播间。除了这个以外，她似乎还有许多别的说法，大同小异。她确实算得上是比较称职的那种主播，她从不消极怠播，也不用一些其他主播会用的“手段”来涨粉。我是什么时候开始忘却了她的呢？大概是大学毕业之后找工作那几年，不过我现在也还没有找到工作就是了。她毕业了吗？大概吧，似乎虚拟主播被公认是个不可能长久的职业。 我再一次往下划，却看见一则关于“电子竞妓”的广告，实在令人忍俊不禁。“电子竞妓”是东京这块近期才出现的一个新词，无非是一个好听点的说法，就是原先深耕红灯区的妓女的二次元版，或者说是线上二次元妓女的线下版，无论哪种都好不到哪里去。这种形式的合法化不过是因为我们这一代人已经全然丧失了欲望，传统的妓女和牛郎们已经连谋食也做不到了，不得不转型为“二次元的”、“国民的”、“文化的”……归根结底，还是妓女和牛郎们，只是戴上假发穿上COS服，做着同样的工作。 就在我嗤笑着这荒唐的时候，我听到了那个熟悉的名字，“佐玖菅眠”。不错，这个名字我过多久都不会忘。我睁大双眼，看见一个和她一模一样的年轻Coser正站在舞台的中央，她说着她标志性的台词，让我仿佛回到了学生时代。没想到她也去当“妓女”了，我瞬间收敛起了我的笑容，然后开始查找那个”妓院“的位置，我想去见她，不需要原因，只是好奇。 自天花板垂下的，是那一整排如同鬼火一般的红白灯笼，其薇光映衬着一旁的浮世绘，约莫有五十多张，大抵是歌川广重的《东海道五十三景》。老鸨正引着我走向佐玖菅眠的笼中。我交了钱，不算很贵，不过我想不太通为什么我在中途不能提前出去，我不知为何总感觉这里很熟悉，感觉在某刻自己像是卖了身，可能是在被迫将真正的想法写成笑话的时候，也有可能是在街上被人取笑的时候。实话说，这实在是有些不体面，若不是我在头脑一热时付了钱、画了押，我当时就会以最快的速度离开。在这里，在这样的场合，我还没有想过要怎么面对她。不对，或许我面对的还不是她。 ”你还没有回答我，她是佐玖菅眠的中之人吗？“我随意地向老鸨发问。 ”她‘就是’佐玖菅眠。“老鸨咽了一口口水，瞪了我一眼。 “所以她只是一个Coser？”我继续质问着。 “你以为你真的分辨得出来？她是，她不是，又怎么样呢？我现在告诉你她是，你难道又有权利反驳我说她不是吗？”老鸨几乎带着几分怒气，把我撵进了笼中。然后我看见了她的眼睛，那对紫罗兰色的眼睛，那对曾在舞台上闪闪发光的眼睛，此刻也正放着光芒，她与她一模一样，声线，容貌，甚至年龄，直到如今，我仍然不知道她是怎么做到的。但惊喜很快地变为了茫然，茫然在数十分钟后的寂静后，化作了我那时还尚未熟知的存在主义恐惧。 “奇怪，真的到了这里却不知道要做什么。”我的冷汗逐渐从背上涔出来。 “奇怪吗？按照我的经验来说，你们都是不知所措的。” “经……经验吗？”我语无伦次，“什么经验呢？” 她沉默了，随即叹息着说：“你连自己想要的是什么都不知道，为什么会想要来呢？” “如果我知道自己想要什么，还怎么会来呢？”她没有回答，我关上了灯。 我睡不着，我害怕失去意识的约束之后，有某一种东西会在我的表皮被剥离后失控。但我又害怕我无法卸下这层约束，我害怕面对我难以发挥我的本性的事实。失眠原来是这样一种感觉，感觉自己以前感受到的难眠感皆是轻到不能再轻的。我的手本能地打着节拍，随着心跳加速。我的内心涌起一股沉重的感觉，但我却没有想任何东西，直到我留意到主动权只是静静地从我的掌中流走。我直起身来，期待她会说些什么，但她什么都没有说，只是稍微蠕动了一下那纤白的身躯，示意我她还醒着。我感觉我将自己卖给了老鸨，我和她都在笼子里，她是妓女，但她镇定自若；我坐立难安，但我是谁？我是一个粒子力学家，一个科普书作家。突然我的脑海中跳出一个词，妓女，不，我不能是妓女，我怎么会是妓女呢？我瞬间感到非常地荒唐，甚至笑出了声。她转过身来看着我，并没有谴责我打搅了她的意思，而是一种我曾见到过的人工合成的宠溺。母亲，这是我第一个联想到的词汇，不，更像是姐姐。她在对我进行一种二次元角色式的安抚，或许她以为我受惊了，我并没有，我并没有…… “你还没睡吗？”我避开她那紫罗兰色的目光，努力地找出一句话来与她说；我曾在深夜里无数次被她凝视，但那充其量是透过屏幕的折射，那时我没有回避任何的欲望，以为未来也将如此。 “我在睡啊，我随时都在睡。别忘了我的人设是梦神哦。”她半开玩笑半认真地回答道。 “那你睡着，怎么还能和我聊天。”我想要表达我的不安，我感到有什么事不对劲，她想要通过某种方式论证她的“人设”存在于当下的现实之中。 “陪你说梦话呀，或许我只存在于你的某一场春梦里，不是吗？反正你的某一场春梦里定然有我。”有那么一小段时间，我彻底地沉沦了，我放弃了寻找她语言中的逻辑漏洞，我想要存在于这个童稚状态尚存的伊甸园，这里我不会被嘲讽，没有我不敢面对的性，没有不纯的东西，只有我和她，像亚当和夏娃。我闭上双眼，我梦见自己变成了一束烟花，一种模糊的失重感将我的身体和思维撕裂成千百万段，我化作无数紫色的火星，在空中游曳，飘忽不定，我的思维正在消化无数只“眼睛”合成的图像，我看见了十年前的自己，我还在犹豫要同他说什么，有几粒火星已经落入了湖面。无数人的欢庆声与烟花熄灭的嘶嘶声交叠重合在一起，我此时才发现这里面没有我的声音，我永远只是踽凉之人罢了。我只是欣赏美，然后在意识到自己配不上它之后，很识趣地离开。我的意识正逐渐溶化在水里；在此时我想着她，想到“佐玖菅眠”曾多么逼真的3D模型和她甜到发腻的声音，我才想起我是为了追求幸福而来的笼中，哪怕这种幸福低俗下流，可能已经过时。不，这不是幸福，我所想要的幸福不会建立在卖身之上，追求幸福的人应该拥有自己，不应该在笼中。 我的右脚在半空中猛蹬了一下，我从梦中醒来。我得离开，我真的得走了。我拉开浅蓝色的帘子，疯狂地拍打着笼子的金属栏杆；直到老鸨满脸不耐烦地走过来，慢条斯理地告诉我这会还是就寝时间，我不能走，否则吵到其他嫖客就不好了。我当机立断，转了一万日元给他，他似乎相当满意，立刻输入密码，解开了笼上的锁。 “醒的挺早啊，你要走了？”她也醒了，我看着她的那双眼睛，不知为何想起乔治·哈里森的那句“看着睡梦中的你，爱无所适从。” “是的，我仔细想过了，”我语无伦次地说，“不过我倒是想要与你说一句，似乎幸福无法通过卖身取得，我要离开了。抱歉，没能让你取悦我，我也没能取悦你。” 她停顿了一下，然后缓缓地说：“可是，‘出去’之后，难道你就不卖身了吗？” 我仿佛一只受惊的雄兔，连裤子都还没穿好就连滚带爬跑出了笼子。那时正是早高峰，我站在上早班的人们面前整理着衣裤，他们正刷着手机像丧尸一样缓步向前；她不知是出于礼节还是另有企图，反正向我招了招手。突然，一个小孩指着她发出尖笑，人们几乎同时放下手机看向她，很快，各种各样的笑声交融到了一起，谢天谢地，我同往常一样被无视了。我学着他们的样子笑着，融入了人流中，向着一条又一条从不属于我的死线奔跑。 氿月 2024/10/17","link":"/01/SmokeOnTheWater.html"},{"title":"明治十七·注释","text":"划过夜空的流星，受花香引诱而飞舞的蝴蝶，流向低处的河水，深邃黑暗的浓雾。 自然界发生的事情都有其各自的道理。人类为了证明自己能够说明这些道理进而捏造出种种理由。 映入眼帘的这一切，都将为人类所有……本来应该是如此的。 ——雾雨魔理沙，Grimoire of Marisa 注释 《西海岸，东海道》是最早完成的作品，尽管整个系列时间线最早的是设定在21世纪初的《致命玩笑》。文章得名于ZUN的专辑《卯酉东海道》，情节也受那张专辑的附带故事及其中角色启发（女主“雾枝莲子”和“常陆改用假名”等）。男主得名于克里斯蒂安·罗森科鲁兹（CRC），他是传说中蔷薇十字会的创立者；男主与罗森的经历有许多镜像之处，这点在《白鹭城》中得到了更多地展露。 《金阁寺的一块天花板》是《妄谈》和《阿卡迪亚的牧羊人》的精神续作，从篇幅和叙事方式而言都是最相像的。1950年前，金阁寺的最上层天花板据传说是一整块的楠木所制。但它在1950年的“金阁寺放火事件”中被完全烧毁了，1955年后重建的金阁寺，最上层的天花板使用了多张木板拼接的“镜天井”，故已经不能称为一整块木板制成了。以下是比较细节的几点致敬的介绍： 约翰和洋子：他们的关系致敬了披头士灵魂人物约翰·列侬和艺术家小野洋子的爱恋。文中引用的《Strawberry Fields Forever》主要由约翰·列侬创作，而贯穿全篇的《A Day in the Life》则是由他和保罗·麦卡特尼爵士分别创作了一部分曲，拼接而成的。 玉泉、鸠山：玉泉得名于浙江大学玉泉校区（并无任何关系，只是偶然联想到这个名字很酷），而鸠山之名则来自于ZUN早年作的一首曲子《飞翔在夜晚的鸠山》（ZUN毕业于东京电机大学鸠山校区）。 木棉翅膀的人：致敬西溪水文学社《文明与对话》中一篇关于达尔文对抗天主教会的文章的人物设定（我记不清了，大概就是如此吧）。 “骑士决斗”：致敬鲍勃·迪伦的名曲《沿着瞭望塔》的结尾段。 血红色与黑白灰：复用《御伽之国的鬼岛》第4.5章《三色的向死而生》的意象。 “空虚是性感”、“她其实早就死了”：致敬西溪水文学社《文明与对话》的作品《夏日审判》和我想不起名字的另一篇。 “怅然若失”：致敬平克·弗洛伊德乐队的名曲《Comfortably Numb》。 我讨厌沙子：致敬《星球大战前传三：西斯的复仇》中男主安纳金与女主帕德梅的著名对白。 靖国神社倒塌：纯属作者私货。 火焰与森林：致敬《永远讲不完的故事》中夜之森林与色彩沙漠的对立。 《行步于夜晚的白鹭城》： 以扫、犹大和以色列（雅各）都是犹太人的祖先，以扫和以色列是兄弟，犹大是以色列的儿子。 巴尔巴厘安人：Barbarians，懂得都懂。 61号公路：得名于鲍勃·迪伦的伟大专辑《重游61号公路》。 “执着于东拼西凑”：取自JUSF周存的歌曲《由》。 原始状态：即自然状态，在我看来，它是异化前的现代人的理想状态。 噤声的手势：回收《金阁寺的一块天花板》中的动作。同时与结尾的“莫噤声”呼应。 《东海道五十三次》：歌川广重的浮世绘作品，描绘了东海道的五十三个驿站各自不同的景色，一定程度上影响了文森特·梵高的油画创作。 狄奥尼索斯之酒：酒神是古希腊人欲望的具象化，酒神教人们种葡萄树、酿葡萄酒，然而却没有告诫人们狂饮的后果，并沉浸在酒后的狂欢与宣泄之中。这是人类对本性的追求，可以说酒神正是人类自身对天然本能向往的产物。 常陆、鹿岛神宫、莲台野，金阁寺，白鹭城，三条大桥：日本地名，都在东海道上。 《义和拳》：得名于同名已解散团体，在历史上发挥了重要作用。文章主要描述的是我对于10月5日国足客场0-7惨负日本的看法。 《彩》：得名于文章中的关键意象，即“彩礼——彩票——体彩”的轴心，归根结底，都是为个彩头，但是文章中对于色彩的描写是极度稀少的。 王彩艳：得名于铃木彩艳。虽然没有在文章中大量描写，不过她的造型参考了很多二次元女性角色。 肖邦的《谐谑曲》：即《降b小调第二谐谑曲》。 比目鱼：致敬日本虚拟主播佐久间眠和东雪莲的造型。 父亲和哥赌的那场比赛其实是2022年世界杯小组赛E组日本2比1逆转德国。那场比赛的许多名场面令我对其印象极度深刻。 “连红”等：赌球术语。 “尖叫”：致敬格兰特·莫里森的《动物侠》第四期结尾。 《脑中的鹿角》：脑中谐音“老中”。鹿角象征盘根错节，这个意象的使用相当偶然，似乎是因为那天我在看J联赛中一支叫鹿岛鹿角的球队的比赛。和《鹿乃子乃子虎视眈眈》没有关系，我觉得那部番也就一般。 赫特医生：Doctor Hurt，初次登场于《蝙蝠侠》第156期，他为蝙蝠侠执行了太空隔离实验，使他产生了幻觉。他有一段台词我认为相当的好：“One of man’s most primitive fears is loneliness! When a man is isolated too long, the mind plays strange tricks.” “指鹿为马”：致敬赵高指鹿为马，同时揶揄发布不少奇谈怪论的郭继承教授。 白马湖：杭州地名，附近常常举办漫展。 阿布思·邓布利多、阿库娅：前者是《哈利·波特》系列的一位经典角色，长期作为霍格沃茨魔法学校的校长和主角哈利的导师出现；后者出自日本轻小说《为美好的世界献上祝福》。 自设、性转、COSER：Cos圈术语。这里唐突地使用是因为之前看到过一条有趣的言论：“加个自设+性转这俩词，以后假发都不用带就可以玩Cosplay啦”。 杨永信：饱受争议的精神科医生和“全国戒网瘾专家”。其使用电击等手段强制治疗网瘾患者的行为，受到中国内外媒体和网民的广泛讨论与批评。值得一提的是，他是院长而不是院士。 《二十一世纪精神病人》：前卫摇滚乐队克里姆森国王的名曲。 弗兰肯斯坦：玛丽·雪莱小说《弗兰肯斯坦》中的一个科学家，他“发明”了一种新的生命。 “例外的正常”：致敬格兰特·莫里森在散文《午夜小丑》中对于小丑的描绘。 “弹钢琴”：致敬JUSF周存的歌曲《六日之失》。 《致命玩笑》：作品名致敬阿兰·摩尔的《蝙蝠侠：致命玩笑》。 阿卜杜勒·马利克：阿拉伯名，可意译为Servant of the King。 “曾有两个人窘于荒野之中……”，致敬《蝙蝠侠：致命玩笑》的第一句旁白。 文章引用的歌曲是鲍勃·迪伦的《沿着瞭望塔》。 《失落的桃花源》：取自约翰·弥尔顿的《失乐园》，桃花源则同时取自陶渊明的《桃花源记》和《桃花源诗》，以及暴雷的恒大桃花源系楼盘。 主角是《脑中的鹿角》里的那个用鹿角自杀的男孩。文章开始时离《脑中的鹿角》已经过去很多年了，主角本来已经半条腿踏入了中产阶级，却在恒大暴雷和母亲离世之后处于一个不尴不尬的位置，孤身一人，无牵无挂的他开始在城市间流浪，最终在流浪中又回到了自己的“旧宅”。其实这是一个相当伤感的故事。我试图引入我对于21世纪初的特殊感情来让这篇文章变得更加“中式梦核”。 雅努斯雕像：雅努斯是罗马的两面门神，代表着机会、机遇等。 门前的桃树：门前桃桑，为大凶。 “吉耶？凶耶？”取自《越绝书·卷十四·越绝德序外传记第十八》，原文为：“蠡因心知意，策问其事，卜省其辞，吉耶凶耶？”。 “007”：中式梦核的一部分（大雾），即“一周0点上班，0点下班，工作七天”——相当于0休息，一直工作。 《水上烟花》：文题致敬深紫乐队歌曲《Smoke On the Water》。烟花更多的隐喻烟尘女子，而水能够显现出一种镜像感，暗示“我”只不过是她的倒影。暗喻“我”与她是相似甚至全等的存在。文章有删减。 原父理论：拉康认为原父是“妓女”，作为一种抽象的实体，它有着最低的社会地位，最弱的道德。这样潜意识才会让人们远离成为原父的可能。简单来说，拉康认为资本主义社会的原父来源于一种创伤，即“每个人都在某一刻卖身了”，而对于这种创伤性事实的否认让潜意识开始锁定一个原父（例如妓女，乞丐之类的），然后开始通过与之对比来自我安慰。但是“妓女”这种经常被当做原父的客体其实是常常能够意识到自己的创伤，并可能去治愈的。但一般人不大可能。也就是说反而原父的主体性能够增强，一般人的主体性会减弱；久而久之，那些逃避创伤的人会完全地客体化。 佐玖菅眠：化用“佐久间眠”，即东雪莲。 “黑曜石里的蓝蝴蝶”：致敬西溪水文学社的《文明的对话》的第一篇《琴曲》。 《粒子力学的数学原理》：粒子力学是民科发明的一种伪科学，而书名本身取自于艾萨克·牛顿爵士天才的著作《自然哲学的数学原理》。 “电子竞妓”：化用“电子竞技”。 伊甸园：自然状态的象征，伪伊甸园代表的则是“童稚状态”。 死线：Deadline，又称DDL，即最后期限。","link":"/01/AnnotationsOnMeiji17.html"},{"title":"正直者之死","text":"Part 2 正直者之死 Mors JustorumDuel一个黑色的影子，背着青白色的阳光在满是泥泞的路上行着，两侧是黑岩砌成的山壁，将青灰色的天空截定。有时云雾缭绕，遮住两侧的枯枝败叶和树上满挂着的尸体，挡住他的双眼，于是他伏在老马上，飞驰着在法兰西的山间行进。 他的双唇正流着血，他用手抹去之后，定睛一看，却发现天地间似乎只剩下了自己的手上那淋漓的鲜血犹有颜色，其他的一切都是淡灰色的，叠加在一起，几乎显现出一种诡异的透明。他不知道这个方向能否把自己带到自己想要到达的地方，或许他只是想着一个简单的念头—— 也许对于现在的自己来说，生命只是“活着”，但这并非他原初的生存之道。从学生时代开始，他就总是想搞清楚一切，想要给灰色的乱糟糟的世界勾上线，撕开暧昧游离的灰色地带。他之前下定了决心，即使要面对的是死亡，他也要得知真相。 遥遥数里之外，约隐若现的街市的景象在浮现，夕阳还未至，青蓝色的光就从密林间透过来，散射于大雾中，好似一团团鬼火。而那街市又如同海市蜃楼，但也许它并不是光的折映，而是自己记忆折映在脑海里的影子，不知不觉中将他印象里这个异国小镇的模样刻成了印象。他看见在这了无生气的乡道上，现出一行血迹，用其特有的警示的残色，告知他死亡已然再次降临，他来的太晚了，伯爵是对的。 他走下战马，用另一只手试了试那血迹，几乎与自己唇中流出的鲜血是一般颜色。他再一次跨上老马，踏着血迹冲过迷雾的屏障，远远地又一次看到一个身影，那是他最不愿意在此刻看到的男人，洛林·安菲尔德站立在他的正前方。那个男人在昏暗的天空下显得那么苍白，金色的乱发清晰可见每一丝，他冰蓝色的双眼仍是那么清澈，吞食着四周的光。 日轮已绕到了二人身后，已经快要入夜了，小镇中惟余此二人，在小镇的广场上对立着，这让他回想起了曾在书上看到过的阴阳鱼。洛林已经摸向手枪了，他注意到那个白色口袋上绣着的红字。 “汉克，如果你是为这个而来的，”洛林注意到汉克看向了自己腰间的干粮袋，像在看一具尸体一样，“我是不会给你的。” “我并不是为这个来的，但是我会把它带回故乡。”汉克说，“若你不应允我，那便为之决斗吧。” “你怎么会回来，这不应该，这不可能发生。”洛林低下头，握住手枪，他想起其中还有三枚子弹，身上再没有多的了，“我该猜到你会回来的。”他的语气里的忧伤被他自己耗尽了，掩藏在其下的一股肃杀之气也逐渐显现出来。 于是二人不自觉地以背靠背，雾气散隐，周围石质的房屋显出一种苍老与疲惫，大地正咆哮着撕裂，他不禁想道，这样的情景在它们眼前发生过多少次了？ 汉克摸向手枪，他隐约记得还有两枚子弹，他并没有十足的把握拿下洛林，但他又必须要赢。二人湿润的发丝在前进时分离，两个踏出少年时代没多久的朋友在风声中，在一具尸体的见证下，迈出决斗的第一步。 第二步，第三步，第四步，远方传来像雨水穿林打叶与亚马逊战吼交织在一起的声音。但他们却只听到军靴压过沙石时，那种仅存在于记忆的如笔尖在书页上摩擦时产生的声音，洛林正像过去那样焦躁不安，零零碎碎地想，第五步，他要在第五步就开枪，不行——但他的求生欲望先过他的思维一步。只是为了活着——他提前转过身去，却惊讶地发现汉克的枪口正指向他拿着手枪的左手。 “怎——” 他不可思议地看到汉克早已转过身去，先一步扣下扳机；枪声代替了一切语言，一切都仿佛在那一刻起发散出光与热来，然后又瞬间化作刺刀般的冰冷，撕裂开洛林本就模糊不清的意识。洛林的眼神充满了惊奇与痛苦，他的左手涌出鲜血，他的右手伸向枪，被汉克一脚踢开。他抬起头，看见汉克那空洞的眼睛与枪口。 “所以你赢了。”汉克从洛林身上取下被鲜血染红的口袋，里面只有几块干瘪的硬面包，洛林并不再做多余的反抗，平静地躺在地上，看着这个老朋友将枪口对准自己的眉心。 “不……”话音未落，汉克扣动扳机，子弹穿过洛林的头颅。汉克黑色的枪口，洛林下意识伸出以抵挡子弹的左手和头颅上的弹孔连成一条线，空洞冒出白色的烟。 硝烟散去之时，洛林已经离开了这个世界。汉克记得，他刚才如耳语一般，在死前轻言了一句：“你曾是最追求公平的……” 自己曾经是最追求公平的，他说的一点也没错，可是自己却比他更先转过头去了，昔日的“正直者”，今日都到哪儿去了？一个在决斗中死于异国小镇的广场上，还有一个对过往自己恪守的原则背过身去。为什么在战场上，他们死于友人，而非死于敌人？ 想到此处，他丢下了打空了的手枪，战争已经结束了，起码他的战争已经结束了。他走向洛林的身后，一个长方体的空洞突兀地出现在小镇广场中间，里面是他所寻找的遗体，没有棺椁，也没有封土，就静静地存在于那地方，尸体的脸朝向天空。黑色的头发与泥与血融为一体，衣服湿透了，一样不知是雨是血。他还能会为了那些小事而烦恼吗？还能指示战友们行事吗？还有机会将他最后的悔悟践行吗？答案为否，死亡就是一切命运的结束，他看见雨水打在阿卡林的脸上，死亡时分的惊愕还在他的脸上有所保留，双眼被合拢，脑浆和血液从颅后的伤口中淌出，毛孔中逐渐放出脂肪，他的胸脯没有起伏，一只蛆从他的伤口中爬出来。 他将尸体搬起，放入在某间房子里找到的一个麻袋，逆着即将落下的夕日，向着即将浮现的星空，向东行去。战争结束了，他要像约定的那样，与友人一起回到故乡。对，故乡，一切在过去都是好的，是美丽的，中学时幻想中军旅的生活和首次穿上制服的心情像梦一样重新浮现在他的眼前，让他短暂地忘记血泊中的沐浴，尸体散发的恶臭和神魂的支离破碎。至少他是这么认为的。 Deed“我看着它发生，直到它成为故事，直到我的良知提醒我，一个人的心不该如此冷漠。但是那时已经太晚，逝去的生命无论如何也回不来。对此我只能惋惜，但或许一切皆是定数，或许我有自己的使命。于是我修葺玻璃的栈桥，正直者背着尸体从其上走过。若那场血潮再一次过早地到来，若祭坛已成为唯一的栖身之所，若夜晚的第一缕星光将你从噩梦中唤醒，我将与你在月的另一面再见。” “你？”读着这个诡异故事的汉克，感到自己在被看不见的存在注视着。为什么会是“我”与“他”再见？“我”与“他”几何时见过？他不安地转过头去，却看见窗外的洛林正向自己招手。 “洛林，参军的事情你和你爸商量的怎么样了？”汉克一边说着，一边漫不经心地望向远端，在视线的远端，他发现一朵快要凋亡的矢车菊，开在墙角。他略微感到了一丝惊异，自己怎么从来没有注意过这朵花的开放。可能主要的原因是墙后正好有一块，校领导专门开辟用作爱国主义教育的矢车菊花田。 “我爸？我爸铁定不会让我去，他为了不让我上前线，连柏林那儿八竿子打不着的亲戚都找过了。” “所以呢？” “不就一个签字吗？搞得好像我签不了一样。”洛林微微一笑。 第二天早上是假日，学校并不上课，虽然过不了多久，在工作日学校也不会上课了。老安菲尔德先生和他的妻子没有打搅洛林，他们以为他还在睡觉。但当他下楼吃早饭的时候，他已经全副披挂在身。老安菲尔德直接被气出了家门，而洛林的母亲只能抱着洛林哭泣，不停地重复“你为什么要走”、“一定要活着回来”之类的话，却都模糊地融进了泪里，听不清楚。洛林也只能象征性的“嗯”几下，不停看向天花板的左上角。 到了上午九点，征兵处的几辆卡车已经挤满了人，全都是年轻的小伙子。汉克在一辆车中找到了洛林，洛林让旁边的一个脸上长雀斑的男子腾开位置让他坐下，他的胡子剃得一干二净，凌乱的军裤上系着一个白色的布袋子，上面似乎有字，但他不知道这是什么意思。这时汉克才意识到自己和他见过，似乎是在学校里。他在记忆的杂物堆里翻检了很久，然后还是向他伸出了手，问道：“我们见过，对吧，你是——”他故意将音拖得比较长。 “阿卡林，阿卡林·拜尔林纳，好久不见。”年轻军人的语气里似乎带一点失望，但并不能简单解作旧同学未认出自己的不满。确切地说，阿卡林也没有认出汉克，但他实在不关心面前的这个男子是谁。 “我叫汉克·德桑托斯，我记得你也是刘易森高中的，好久没看见你了。”汉克伸出了自己的手，阿卡林没有接住，只是静静地看着他。 “我后来搬到勒沃库森了，我父亲在那里的药厂工作。我是记得见过你。”阿卡林慢条斯理地说道。 汉克忽地想起来了，那一天对他的意义太大了，他怎么可能忘掉呢？那是一个春日的清晨，一个红发的孩子转到了德语文学课。听别的同学说，好像是因为他在另一门课被同学欺凌了，所以来上了最不需要交流，最安静的德语文学课。但很不巧，老师突发奇想，安排了同学们在今天谈论自己的志向。老师本想的是人各有志，未料同学们的回应几乎都是关于如何赚大钱。老师感觉无聊，但他又不得不继续问下去，他又点了那个叫阿卡林的插班生回答。 “军人，我想当军人。”生怯的阿卡林用德语说，据回忆，他的德语其实很不错。但是他不敢多说，他害怕自己的爱尔兰口音露馅。 “参军吗？哪个国家的军？”老师打趣道，但阿卡林似乎并不能够理解德国人的幽默。他的脸已经涨得通红，拳头也紧捏起来。同学们也指着他笑，汉克没有笑，他只是忧郁地看着阿卡林；但阿卡林并没有回头看他。 “汉克的话，应该不用说了，我们都知道你想要成为一个作家。” “写作是我的爱好，但这不是我的志向。我想要成为一个正直者 (justorum)。” “正直者？什么样的正直者？”老师突然来了雅致，于是追问道。 “我要做一个能够明辨是非的人，一个人需要理解可能遭遇的一切，才能够在每一次被逼无奈时，做出最符合道德伦理，最正确的选择。这是不可能做到的，但这也是我眼中，唯一值得作为我志向的东西。” 洛林在课后找到了他，二人就这么相识了。他说他也向往着成为“正直者”，然后他们就畅聊着这个他一拍脑袋想出来的，不成形的概念，直到黄昏。虽然二人很快又把这个所谓的“志向”遗忘了，但也的确是它为他带来了人生中的第一个挚友。那个红发少年的影子也在他后来的人生中出现过几次，但又在某一刻消失了，此刻它又像鬼火一样显现出来。 “哦，是你，我记得你的爱尔兰口——”汉克回忆着，随口说了出来，他意识到自己失言时，阿卡林已经站了起来。 “你怎么敢这样污蔑我！我是一个日耳曼人，我的身上留着高贵的……普鲁士的血。”阿卡林非常愤怒地抓起了汉克的衣领，但他的军帽却不适时地掉了下来，汉克看清了他的确长着一头红发。阿卡林感到非常地尴尬，却没法在车上发泄自己的气愤；只得以最快的速度将军帽扣回去，内心不断地咒骂汉克。 下车之后，人们聚集到了各自的住所，然后教官们指挥他们参加训练。对于汉克和洛林来说，到这里为止，军旅生活和他们的想象并没有什么区别，枯燥和阴暗都是他们早已预知的，他们完全不怕吃苦。这段毫无生气的日子里，唯一值得一提的是阿卡林无论干什么事情，都是最积极的；尽管他长着一头容易滋生非议的红发。教官们没有任命他为队长，或赋予他任何荣誉，或许就是因为这一点；而他似乎也是因此在挤入各个小团体和社交圈时，受到了不小的歧视。纵然他万般努力，他也不得不退回只有他、汉克和洛林的狭小关系圈。 在他们入营一个月后的清晨，他们得知总教官决定发表一次演讲。倒也不是入营的时候他不想要这么干，主要还是因为第一批军员刚入营时，几乎连小校场的一角也站不满；虽然现在也好不到哪儿去，也最多只能站满一个小角而已。总教官站在高台上，他穿着一丝不苟的士官军装，浓密的头发，被梳向上方，显得十分板正挺直，小胡子修得略显诡异，你能感受到它的过长，它却完全不会触及到嘴唇。比起他的名字，“铁人”作为他的外号，更加流行；据说这是因为他在战场上他多次中弹，却没有一次受重伤，因此还能够在后方当教官。哪怕相隔数十米，人们都能看到“铁人”那永远不满意，永远充满愤恨和仇怨的眼神。 “各位将士们，为了在这次战争中为统一大业奉献力量，各位辛苦了！几个月以来，我们都在忍受着折磨。这个折磨在不断加剧，直到我们再也难以承受。我们的爱好和平，我们的忍耐被错误地看作软弱和怯懦！我要求你们将怀着一颗勇敢的心去参加战斗。你们的生命唯有一个目标，那就是成为民族而战，为它的复兴而战，为国王而战的超人！这场战争只有一个口号：忠诚于德意志民族！如果我们的意志足够坚强，没有什么艰难和痛苦可以使我们屈服，我们的愤怒，我们的仇恨，我们的普鲁士军团将横扫一切！现在我要求你们做出的牺牲并不比先辈们已经做出的牺牲更多，想想那两场战争，你们的父辈，祖父们参加的那两场！如果我们要用对敌人的仇恨建立一个紧密联系在一起的社会，那你们就要为之做好准备！在战场上，去折磨，用愤恨对法兰西的野种们进行围猎！如果你们有幸荣归故里的话，还要教会你们的后代，怎么去恨他们，怎么用对敌人的恨，荣耀我们伟大的皇帝！” 校场上充斥着欢呼，大地也为之震动，仿佛对于这些年轻人来说，没有什么东西是不可动摇的。总教官庄重地将右手的掌心翻向大地，然后向前直伸，高呼：“德意志民族万岁！” “德意志民族万岁！”所有人整齐划一地将右手向下翻，然后向前伸出。 “汉克，我不能理解，这一切为什么一定要和仇恨有关呢？”演讲后的几个小时，二人在走廊里悄悄讨论着。在冷静下来后，一切对于洛林仿佛都显得有些诡异起来。 “你难道不知道吗？你在来之前就知道了，在学校里就知道我们要恨他们了，他们是我们的敌人啊，还有比这更简单的吗？”虽然对于汉克来说，一切还是一样，甚至要更好了。他的目标更加明确了，荣耀离他比任何一个时刻都要更近。就在此时，二人看见了铁人正从走廊的另一头走过来。 “教官，你的演讲非常地精炼，但里面有一些话我不太能理解。”眼看总教官要从眼前走过去，洛林拽住了教官的袖子，快速而又紧张地说。 “安菲尔德，有屁快放。”透过语气，二人能感到教官觉得他们莫名其妙，并且他现在十分不耐烦。 “这是我心里所积蓄很久的一个问题了，许多许多年，自从我在小学的时候，这个问题就出现在我的心中了，爱国不是一种美德吗？为什么要通过憎恨来实现这种美德呢？我当然知道这是对的，但是为什么？”洛林急切地问。 铁人听见他的话，先是傻了眼，几乎愣住了，然后他几乎笑了出来，鼻翼都随着抑制不住的笑意扩张开来，他看向窗外，尝试咽了几口口水，等他转过身来的时候，他的脸上还是充满了笑容，可以说是一种嗤笑。 “我又不是学究，别问我这个。你去问俾斯麦，他也解释不通。无非就是：你爱什么，你就得恨一个差不多的东西。你爱我们的国，对吧；好，你去通过恨另外一个国来证明你爱这个国。在军营里，你要学会恨，你要学会折磨，你要相信你的敌人和你并非同一种生物。只有这样，你才能上战场。上了战场以后，枪不是最可怕的，最可怕的是人，当你被本能的同理心战胜的时候，你的死期也就到了。” 洛林的眼神依旧充满了茫然，铁人将他推向汉克，翻了翻白眼。 “这个道理对于你们这样的新兵蛋子来说，还是太复杂了，你上战场之后就知道你错的有多离谱了。趁这点时间——” “但是——” “好好训练吧，在训练营的日子不会太久了。”铁人拍了拍洛林的肩膀，大步地向前走去，二人犹能听见他掩不住的笑声。他们在训练营度过了最后的几天，努力地去忘掉思考，尝试让自己完全地化作战争机器。几天后，几辆运兵车到来，告诉他们前线需要大量支援，然后他毫无犹豫地把这些刚学会开枪没多久的“士兵们”送上了车。 汉克讨厌被关在幽闭空间中，对外面一无所知的感觉。他能听到炸弹的爆炸声，大量德语和法语的咒骂，惨叫——仿佛在叫魂。突然，随着车门打开，强烈的白光让他捂住了眼睛，他能听到有许多人，恶狠狠地让他们下车。他将手缓缓挪开，走出去，一枚炮弹爆炸在泥水中，烟火伴着硝烟，搅得泥浆飞溅。他终于意识到战场并非自己建功立业的地方了，自己的事业只剩下了一个，那便是生存，活下来，其他一切从那一刻起都仿佛不重要了。 Dirt“我的挚友，我深爱的朋友。” “死亡的厄运突然降临他，我为他哭泣了六天七夜。” “我不愿意埋葬他，直到蛆爬出他的鼻腔。” “那时才开始学会惧怕死亡的我，孑然一身，在荒原徘徊。” 军营中弥散着伤员们忧伤奇异的歌声，几乎难以描述，如同塞壬女妖。让听到他们歌声的人被成群地吸引过去，然后用无止境的忧郁和悲伤淹没来者，将他们溶入歌声，几个月前的汉克、洛林和阿卡林，肯定不会相信充斥着小伙子的军营，过不了多久就成了一个死气沉沉的地方。确实，起码这里不再充斥着小伙子了，运兵的车辆不断地来，但伤员和尸体永远比新兵蛋子多。他们刚来时本想找旅里的老兵好好讨教一番，却发现老兵本就稀少，实际上也都没打过仗，教枪法倒是能教会一点，想学些战术便完全是天方夜谭了。他们不知道什么时候会突然死于敌军的流弹之下，所以在闲暇的时间，三人总是呆在一起。 “狗操的，那个小孩比我还小一岁。现在他的肾已经只剩半块了，他连站都站不起来，军医让他别想些有的没的，好好等死，好好等死！”围在火堆旁，汉克大声地说，“就像是被活埋一样。他的家人会怎么想，他又会怎么想？一个人，孤零零的，死在法兰西，没有一个认识的人，也没有人愿意把他的尸体带回故乡。” “他会成为烈士的，战争英雄绝对不会被遗忘。”阿卡林冷淡地回答了一句，他想装得漠不关心，这样这个话题就可以快些过去。 “烈士又如何？生命只有一次，死了就是死了！谁关心他会不会成为烈士？”汉克又大声地回应道。 “你以前挺关心的，你还记得吗？在你的故事里，你做梦都想要你的主角是个英雄，最好得有一个悲剧的结尾，在死后，被装在水晶棺里，在一场大游行中被镇上的所有人敬仰。” “这不一样，你怎么能把真实和虚拟混为一谈呢？” “别找借口了！”阿卡林有些不满，“你不要以为我忘了你正要参军的时候，天天念叨着什么！我们都是怀着生则衣锦还乡，亡即马革裹尸的梦来的，不是吗？这场战争还远远没有结束，我的梦也就还没有停止。” “少说两句……”坐在一旁的洛林尝试着劝解。 “那我问你，如果我死在战场上，而你活着回去，你会觉得这很公平吗？”汉克没有理会洛林，他仍旧质问道。 “我会把你的遗体带回故乡，在矢车菊园安葬你；在学校演讲的时候，向孩子们提起你，跟他们说曾经有一个自诩‘正直者’的孩子，比起他们大不了多少，在战场上，为了祖国统一的大业，在黎明降临之前，悄然消逝——”他还记得，汉克有些惊讶，自己已经快要忘掉了曾经还标榜过自己是“正直者”，此刻竟然显得有点滑稽，可是却笑不出来，思绪流回到心中，竟然只剩苦涩吗？ “但这公平吗？”没有回答，没有回应，只有寂静，几乎像是对死者的哀悼。他们的潜意识中跳脱出了一个简单而统一的念头：战争，对任何人都不公平。他们在沉默中结束了晚餐，然后在火焰熄灭，宵烟散去后，很快地睡了过去。尽管不确定第二天还会不会再一次睁开双眼，良心也受着极大的折磨，这仍然是他们三人在踏上战场后，睡得最安稳的几夜之一。 洛林是受伤比较轻的，他只是左耳被打飞了一块。受伤后的洛林变得有些孤僻，完全失去了当年在学校练就的交际本领。他甚至不想要和任何不认识的人说话，甚至不愿意看他们一眼。他害怕这些鲜活的人在某一刻突然死去，所以他决定将他们看作尸体。他只与汉克说话，有时候甚至不搭理阿卡林。 不过瘟疫并非唯一的威胁，饥荒也随着战争降临了，没有人知道他们该如何度过这如同末日的冬天；太阳沉入天际线之下时，他们甚至像孩童一样畏惧它不会再次升起。没有食物，没有燃料，没有地图。年轻的军人们毫无怨言地被调配到各个模糊的方向，每一次活着回到营地的人却越来越少，带回来的食物、燃料也永远不够。士兵们由于饥荒，啃食着彼此的肉的传闻，也从某个不知名的角落渗透进来了。 汉克总是想着“不至于吧”之类的念头来打发自己，但他却无力控制自己的梦境；日复一日，他沦陷于一样的梦：发黄的枯骨累积成了连绵不绝的山脉，自己总是在里面醒来，他为了不被窒息，只能用最大的力气推开周围的尸骸。他能感受到自己的内脏在颤抖，有什么东西在他的身体里震颤，抵消着他的心跳。每一次呼吸仿佛都是最后一次，他甚至都不知道自己有什么理由去费尽力气推开这些尸体，完全有可能尸海以外已经没有人类了，抑或是普鲁士已经被法兰西占领了，自己或许已然无家可归。 他爬出来时，他看见太阳正流着血，那血迹蔓延到大地上，淹没了他们曾许诺誓死捍卫的华美宫殿和无数普鲁士的城市，法兰西的也难逃劫祸。他听见其他从死人堆里爬出来的将士们，都看着被淹没的巴黎大笑。他感到怪异，于是拼命尝试从尸山上下来，但他又不自觉地尝试辨认那鼻梁后隐匿的熟悉又陌生的脸。因此他踩空了好几次，但他并没有坠落。就在他涉入血海的那一瞬间，他感到了一种强烈的恶心，然后他用沾满尸液的双手接住了从喉咙中飞出的眼珠。他将那颗眼珠擦拭干净，却在瞳孔中看见自己的影像，是一具雪白的骷髅。他不可思议地看向自己的左手，依旧完整，但他再次睁开双眼时，其上已经有了咬痕。毫无知觉的他，每一次睁开双眼，自己的肉体就少一点，直到听不见血流潺潺，直到不再有眼可睁，他陷入比黑暗更幽闭的世界。 他如往常一样，从这样一个噩梦中醒来；不同往常的是，他竟然看见队友们还在熟睡，平常都是他们将他从噩梦中唤醒。“快醒醒！今天不是还有任务吗？”他将洛林和阿卡林摇醒。 “你他妈是弱智吗？金星还挂在天边呢！我们难得好好地睡一会，你硬要给我们叫起来。”阿卡林狠狠地肘了汉克一下，不过也没有过度责怪他的意思。三人整理了一下披挂，很快又出发了。 他们的任务只有一个，那就是搜集粮食；深入边境之后，甚至派出搜寻粮食的人也要尽量的少，这样才有可能不让敌军得知，普军的粮食已经严重不足。说实在的，这几乎已经是公开的秘密了，上峰可能只是想为了维持自己的面子，才下达这样的命令。他们眼睁睁地看着士兵们活活饿死，却无动于衷。 在大雪掩映的林中，他们看见一个小男孩正在拾着柴，看他那活蹦乱跳的样子，这里离他家应该也没多远。阿卡林示意另外两人一起跟上，但在看到他家之前，不要急于靠近或者劫持，否则万一他不给三人指路，这次行动就基本失败了。 “听着，我也不是刻意拿这个玩意打压你们之类的。但是我们需要一个领导者，是吧？我是这里军衔最高的，从现在开始由我指挥我觉得没有什么不妥。汉克，你有什么意见没有？——洛林，我知道你听我的。”阿卡林指着自己的军章说道。 “没有。”汉克很快地回答，他其实不在乎这个；但是从阿卡林对洛林的态度中，他感到一股不适，他有些担心忽视洛林的意见，会带来本可避免的争端。 “好，你们看到了吧。那就是他家，我们可以去和这个小朋友打个招呼了。”阿卡林指向了雪原上的一座看起来较老的木屋，男孩正向着那个方向慢悠悠地走去。 “先生，我们可以陪您回家吗？”男孩惊异地看向这个法语说得相当怪异的陌生人，然后一把左轮手枪抵住了他的脑袋。 “是谁在敲门，亲爱的？我敢打赌是皮埃尔。”法国男人从沙发上起身，走到门前，却发现门后站着的是自己的儿子，他的头正被身后的男人用枪指着。 “我们可以进来吗？谢谢。”汉克用法语说道，同时鞠了个躬，他又用德语对洛林说，“我就说学法语有用吧，你那会还笑我。”洛林难得的笑了笑，但汉克能感觉到，他的实际心绪似乎又不通过表情显现出来。让他看着拿枪指着别人，可能比他自己被枪指着还要紧张。 “让他们把粮食交出来。”阿卡林冷冷地说，然后晃了晃自己手里的左轮。 “我们来这里，并非是想谋取你们的性命，而只不过是想借你们的粮食一用，如果你们够贴心到把储藏室或粮仓的位置告诉我们的话，那我们就不会想要与诸君有更加激烈的冲突。”汉克用法语轻描淡写地说，这时厨房走出一名女人，踉踉跄跄地将他们领到了粮仓。 “你们这里的粮食怎么这么多？都快比我们一整个营地的还要多了。” “先生啊，这些都是我们用积蓄买下的，这地方每到冬天就容易下大雪，道路容易阻塞……不买这么多粮食的话，一旦粮食不足，或者爆发什么突发情况，我们就只能活活饿死了。在我的一生里，我还没有和普鲁士人有过什么冲突，如果说先生能够给予我们一些小小的体谅的话，我请求您留下一些，我们还能徒步到附近的市镇筹粮过冬。” “好的，好的。”汉克将一大部分搬出门后，正准备停下，却被阿卡林瞪了一眼。 “把粮食全部拿走。”他一字一顿地说。汉克怔了一下，然后立刻走回了粮仓。但洛林却在此时表达了抗议： “不要再拿了，你已经拿的够多了，你明明知道他们也是人，他们也要活着——” “他们是法兰西人，我们的敌人，他们越有机会活下来，我们活下来的机会就越少。你怎么不想想这些粮食要是落到法军手里，会对我们多么不利？安菲尔德，有的时候我真的搞不懂你，你有着那么细致的头脑，怎么会忽略如此简单的事实呢？” 洛林那血丝遍布的双眼带着焦急望向了汉克，但汉克默不作声，手却不知是否该放下手中的麻袋。 那个小男孩在极度紧张的情况下，突然笑出了声，他的父母都大惊失色。阿卡林蹲了下来，看向了他，问：“有什么可笑的？” “Scheiße.”小男孩字正腔圆地对着阿卡林说道，阿卡林也笑了。 “你德语不错嘛，那我们刚刚说话你都听的懂，对吧？”小男孩没有回应，只是默默地弯下腰捡起了地面上的什么东西，揉搓在手心里，笑容愈发难以控制。阿卡林的笑容凝固在了脸上。 “……”男孩轻声地说了些什么。话音未落，阿卡林扣下了扳机，没有一丝犹豫。男孩的脑浆和血液立刻炸裂在了木屋的墙上，笑容立刻转化成了一种未名的惊愕；他捏紧的手难以维持，逐渐摊开，里面是一根红色的头发。那对夫妇尖叫着跑出了房子，没有人去追他们，炉火正旺的温暖之宅中，唯余一片平静。 “他对你说了什么？”良久之后，汉克才打破了沉默，但他在说这句话时，嘴唇几乎没怎么动。 “我不知道，我听不懂英语。”阿卡林并没有看着他，而是盯着地上的尸体。 “我再问一遍！他对你说了什么？快给我一个理由！给我一个你杀了他的理由……”汉克将手中的枪敲向墙壁，却并没有发出他所预想的那种强烈的声响；恰恰相反，与他尝试表现出强势和愤怒的语言一样，它充斥着软弱与无力感。阿卡林没有回应，他甚至没有意愿回应，但此刻就连一个傻子也能看出来，他被那句话激怒了。 “我受够了，都滚吧，都他妈给老子滚吧！”洛林推开房门，径直跑进了雪原。汉克和阿卡林尝试跟住他的步伐，直到他向后开了一枪以为警示。二人也不再向前寻找他的踪迹，那个男人的泣泪声也随着夕阳的落下愈发渺茫，洛林·安菲尔德丢弃了原先视为珍宝和荣耀的军章，消失在了漫天飞雪中。汉克不禁想道，或许本就没有什么正直者，只不过是无需做出抉择的少年们，在安静的青春年华中自作多情、挥斥方遒；但到他们应当走出伊甸园的时候，言语却在现实面前退却软化了，说的激昂慷慨，却毫无意义。 Dim两个赶夜人骑在马上，在寒风中裹紧了衣裳。此地青白色的天空还未被硝烟污染，但启明星仍旧被掩于浮云之后。晨雾出现了，他们的嗅觉已经被完全地麻木，以至于对一股浓厚的铁锈味全然不觉。他们浑然不知，这条道路通向的是无人的村庄和肥沃的荒原。军队里已经有了战争即将结束的讯息，显然是法国无法支撑战争继续进行了。 “汉克，前面好像有个村子。”远远地，二人看见几座光秃秃的、没有炊烟的房屋。 “是吗？那我们在那儿歇一会吧。那儿有个人，我们先找他问路。”汉克说着，右手顺势摸向枪。 “别杀我！”一个疲惫不堪的人影出现在了视线的尽头，穿着破烂不堪的德军军装，口中说的也是德语，声音令二人无比熟悉。 他的嘴上全是血，牙尖也是，衣服上也全是血迹，但几乎看不出来他身上有什么伤口。全身上下唯一能看出伤势的地方，可能就是缺一大块肉、快要烂掉的左耳。洛林·安菲尔德，像个卡菲尔难民，拖着一个被血染红的大麻袋，惶恐地向两个骑手走了过来。 “洛林！”汉克几乎落了泪，走下马来，紧紧地抱住了洛林，“我无法用言语表达我多么想你，我还以为你死了。”他没有注意到的是，阿卡林也几乎落泪了，但他隐藏住了情感，只是下马驻足，却并没有拥抱。 三人行至一座空屋前，将马拴好，便要进屋烤火。奇怪的是，房间里却没有一点炭，连柴也没有，他们折腾了好一会，才烤起了火。被褥也很整洁，但就不像是有人生活过的地方。他们好多次想问这个村子里怎么除了他没有一个活人，但因为觉得不吉利而打消了念头。两人问了他数次他要不要回到部队，但每一次，他都非常果断地拒绝。 “阿卡林，你带了多少吃的？”洛林突然发问，但他看起来并没有那么饿。他们不知道他是怎么在荒野里觅食的，而且他走时本来也就没有带多少粮食。 “也只够我一个人吃，不过这既然是山区，附近应该可以打猎，毕竟还暖之后，飞禽走兽也都开始活跃了。”阿卡林将他的白色口袋从腰间解下，洛林看见里面只有不多的几块黑面包。 “话说这个袋子上面的绣着的到底是什么，你从来没有提起过。”汉克突然插了一句。 “是英语。”阿卡林终于松口了，“意思是：信者欢愉，疑者明智。” “过去我跟着我的母亲生活，在爱尔兰，直到她在我七岁时病逝。我的父亲是德国人，许多本地人因此歧视我，在我母亲走后，流言蜚语便更多了。因此我的父亲又带我回到了他的故乡，杜塞尔多夫，他又教育我，说德意志民族是世界上最伟大的民族，要让我把一生投入到建立德意志帝国的大业中去。但我又在刘易森中学被霸凌了许久，父亲又不得不去勒沃库森另找了一份工作，把我安排到勒沃库森读书。多年和化学品打交道的他，终究还是没能撑到我毕业。我放下了学业，全身心护理他的生活。有一天晚上，父亲把这个袋子交给了我。”他喃喃道。 “他跟我说，这是母亲送给他的，这是他手头唯二属于母亲的东西之一。那天晚上很凉，他咳得很厉害，我于是与他睡在一起。到下半夜之后，他突然不咳了，于是我安稳地睡到了第二天天亮，那时他已经没有了呼吸。我在无限的悲哀和躁郁中选择离开了勒沃库森，然后兜兜转转又回到了杜塞尔多夫，那时正好征兵，于是我几乎没有怎么犹豫就填完了征兵表格。我猜测这也是我父亲希望我去做的，然后我就在卡车上遇到了你们。”听着阿卡林的叙述，汉克又一次想起了自己那令人汗颜的错误。 “你们根本就不知道我在爱尔兰的七年是怎么过的，在普鲁士的十年又是怎么过的。我既不是这一边，也不是那一边。我曾不止一次尝试把我的红发染黑，但没有用。但我只有一个信念来支撑我走出这种疏离。那就是宏大的爱。”阿卡林抓起了自己的头发，拔下了数根，丢进了火里。 “对普鲁士王国的爱！对德意志民族的爱！这种爱永远不会消亡，我坚信这是我久病的良方，哪怕被多么严重地歧视，我也能够以为国家的发展和民族的统一做出贡献而自豪。这种自豪感是其他任何东西都给不了我的。在这种自豪感涌上心来的时候，我发现我竟然能憎恨所有非德意志的人，包括我的母亲，并且全身心地投入过去难以想象的最冷血的工作。如果不是你的离开，我会止不住地误入歧途，我错了，洛林。我不该干那件事的。” “……过去的事情已经过去了，我恳求你不要再谈论它。”洛林仿佛还被笼罩在阴影里，但又似乎并非只是因为那件事。 “所以究竟发生了什么，这个麻袋里的尸体又是谁？” “她的名字是克里斯汀，是当地一户人家的女儿。是她将昏倒在荒野中的我救醒，带到了这个村庄。我得到了村民们热情的接待，虽然我会说的法语不多，但是我一直说‘谢谢’，他们也听得懂。” “我与他们一起劳作，逐渐遗忘了自己是个普鲁士军人。我愿意，在这美丽的阿卡迪亚度过我的余生，我宁愿与世隔绝，也不愿意在耻辱中回到旧日的故乡。我不愿意被当作逃兵，更不愿意被当作战争英雄——我受够了战争。”他的眼睛，向着斜上方瞟着，饱含泪水。 “但是战争还是找上门来了。一支普鲁士军队在我安居的几周后就到了，他们对于一切活物格杀勿论，克里斯汀和所有的村民们一样，都被他们枪杀了。他们还把地里的庄稼全部焚烧殆尽，我因为这身军服，被他们饶了一命。但他们也对我不管不顾，把我丢在原地；我再一次感受到了难耐的无限饥饿，就像我晕倒在雪原时那样。” “然后，我，在意识近乎消散时，为了活下来，吃了死人的肉。这也是我不能与你们回去的一个原因，我已经不是人了，我现在是一个只为活着而活的怪物。我的生命已经没有了意义，将她埋葬之后，我就去了结自己的生命。”洛林说着，近乎要倒下。 “让我来帮你吧，你不必一个人承受这么多。”阿卡林扶住洛林即将倒下的身子。 “我——”汉克也想要帮忙，但阿卡林让他缄默。 “汉克，我欠他，你不欠他。”阿卡林说，“你先回到部队司职，告诉团长我要晚点回归部队。” “好，好的。”汉克犹疑地说；他犹疑的是洛林，他又一次刻意地回避了自己的实际感情，而又对自己没有表达哪怕一分一毫的挽留。但到底，他没有说出来，万一自己的猜测是错的呢？万一阿卡林真的向他认错，将他从食人的恐怖记忆中拯救出来呢？他愿意相信自己的挚友仍能被拯救的可能。 于是三人很快地吃过早午饭，天空放了晴，那天是个难得的暖天。洛林、阿卡林和汉克道别，汉克走后，因为二人都没有修陵的经验，他们商议了一下墓葬的细节，就拎着尸体上了路。 二人下马，阿卡林将尸袋背在了肩上，走在前面，洛林跟在后面；他们确实看见了一整块大型墓地。忽然，那麻袋破了个洞，露出了一只满是赤色勒痕的手；阿卡林看着它，突然生了犹疑，站在了原地不动。他回过头去看了洛林一眼，他的眼神冷得像坚冰。 “怎么了？”注意到阿卡林看着自己后，那块坚冰瞬间熔化了；洛林不安地问。 “没什么。”阿卡林继续背着尸袋缓慢地前进，直到子弹穿过他的脑颅；但为降临所做的献祭犹未完成，还差最后一条生命。 Destiny汉克勒住老马，在黑岩砌成的山壁间，望向后方，却没有人影，山间雾气渐起，甚至连脚下的路都开始不清不楚。他突然想起自己过去脑海中想象的战争，是分明的由线条割裂开的，善与恶的对抗，但现在自己又成了什么？他们不都曾是很正直的人吗？陷落究竟是从何时开始的？ “快出来吧，”汉克问道，“你是法兰西人吗？我身上没有你们想要的情报，若是你想要杀了我，那请便。” “你所说的，不是我来到这里的原因。至于我在这里的缘由，我无法解释，你也难以理解。我有许多的名字，克利斯蒂安、孟菲拉侯爵、骑士修宁，过去和未来于我而言只是两个地点，这些名字对我而言只是这些地点的坐标，我可以通过每个时代对我不同的称呼了解我到了什么时代。”一个身穿全副铠甲的武士，从山腰的一个洞穴走出来，“我在这个时代的名字是圣日耳曼伯爵。孩子，你的双眼对骗局视而不见，你的耳朵忽略了预兆来临时的飞沙走石，你的征途与真相背道而驰。所以我要在此警示你。” “真相？什么的真相？” “你看到了洛林的眼神，对吧。那种肃杀的眼神。你听见了阿卡林坠落时分的哀鸣，你听出了他故事里的谎言。你为什么没有回去？你不是自诩正直者吗？” “……”他只能以沉默回应，木叶潇潇而落；伯爵的身影时隐时现，他开始怀疑这一切是不是只是他自己的幻想。 “你需要帮助，但你说不出口，为什么？”伯爵的语气中充满了不解。 “你能帮得到我吗？你真的知道我想要什么吗？”汉克望向天空，语气逐渐从质问转向平静。 “不能，如果你还想要成为一个正直者的话。不过你根本不想要成为一个正直者，你唯一的欲求，就是给你自己那有缺陷的道德和情怀找补，现在机会来了。”圣日耳曼伯爵继续说道。 “圣日耳曼，我能再问你一个问题吗？” “这一切究竟只是我的幻想，还是说发生在现实之中？” “二者兼而有之。因为幻想也只不过是扭曲的现实，而现实也只不过是幻想成了真而已。就像踏上战场之后，你的噩梦化作现实，而现实也变为噩梦。在你曾经的文墨里战争可是轻描淡写的，但是当这一切成了真之后，你感觉怎么样？” “痛，很痛。”汉克用双手蔽住自己的双眼。 “这就对了，痛，便是‘真’这个字眼给你的悲剧加上的分量。这是你要学到的最后一点，这样当你看见安菲尔德的时候，你的痛苦就无法阻止你完成你的使命了。万物分崩离析，事物难以承继，我能感受到有一场大灾变要降临。我恳求你，记住当下的教训，在它二度降临之时，做我的先知。”当汉克再一次睁开双眼时，圣日耳曼已经完全没有了踪影，仿佛消散在了空气里，可能他从来没有存在过。汉克犹豫着调转马头，向着那座村庄行进。 然后二人相遇，空气沉寂了许久，直到那两声枪响。消瘦的像一个影子的战士，将两具昔日战友的尸体装入麻袋，跨上战马，逆着长庚星行去。 回忆着，他望向柴堆上的火焰，蔓延着要侵蚀一切的火焰，将他过去友人已经糜烂的尸身，转化成另一种不可辨认的东西。他想起《伊利亚特》的终章，特洛伊人们也是这样焚烧赫克托尔的尸体的，自己的心境却与他们不同。黎明重现天际，女神那玫瑰红的眼略显模糊，仿佛在落泪。 自己在写作时曾经看到过的那火焰还在燃烧，它在他的视野边界不断跳动，在失神的时刻总是会回到他眼前。如果没有它来提醒他，可能他就能够想象一个没有这场战争的世界，那里普鲁士和法国没有世仇，洛林没有成为杀人犯，阿卡林没有死。可是它的声音时时刻刻提醒着自己，洛林和阿卡林已经死了，是自己焚烧了他们的尸体，将他们掩埋的责任，依旧落在自己肩上。 回到小镇，他听到哭泣声，看见拖着残缺的肢体走在大街上的男人们，看见孩子们穿行在街道中，穿着破旧的大号军服，高擎着德意志民族的大旗！他们赢得了战争！但是他却没有胜者的感觉，他看不见过去曾在学校里看见过的人，看见了也是杵着拐杖的，或者缺耳少眼的，咒骂着行在大街上。他想起前几日自己路过另一个伤痕累累的小镇时，二十几岁的老兵们听见故乡为他们鸣起的二十一响礼炮，下意识地摸向枪时，那绝望的眼神。那种绝望比洛林死亡时所展露出的，还要再可怕几分，或许冥冥中有着什么比死亡更可怕的东西，正在接近他们。 他突然有些不敢回到那曾日思夜想的家了，他想到洛林的母亲在等洛林，当她看见自己的时候，自己应该说什么呢？那眼神会不会更加可怕？自己该说什么呢？难道说自己杀了他吗？他更不想面对旧日的熟人，和受了自己欺骗的父亲，他多么想要说一声“对不起”，要是那时自己听他的话没有上战场，可能结局就不是这样了，可能他就可以在家乡等到洛林·安菲尔德，德意志民族的战争英雄，满载功勋回到家乡；而或许阿卡林会在战场上战死，作为一名德意志的战士，声名被永久颂扬，如他一生所愿。但现实不是这样的，现实不是童话故事，更何况童话故事也不一定有完满的结局。 “但是当这一切成了真之后，你感觉怎么样？”脑海里伯爵的声音又一次出现，痛觉再次支配了他的大脑。 他的身上没有自己旧日的衣裳，他只有这一套军装，军旅生活重新定义了他。正如重新定义了许多人一样，那些人正杵着拐杖，穿着丧服，高呼着“胜利万岁”，“皇帝万岁”！他们行走在街头，因为除此之外，他们别无事情可做。这个世界愈发诡异了，人们没有期待，没有思维，只有存在于言语中的胜利，辅以无数坟冢之上的和平。他决定去与家人们告别，去另外一个城市，作为一个成年人开始新的生活。但在此之前，他还有最后一件事要去做。 在第二天的清晨，天还未亮，有人看见一个年轻的士兵骑马出了城，身后的小车上堆着三具棺材和三座墓碑。人们也没细想，毕竟经历了一场战争之后，埋葬尸体成了一件平平无奇的事。只要这些掘墓人不打搅他们的生活，他们也不会埋怨他们身上与狂欢相逆的不祥之兆。 “那时，大人们将扭曲的梦想卖给孩子，来让他们受困。如今，我们将梦想的尸骸卖给坟墓，好让自己脱身。” 汉克在青灰色的岩石上凿刻着，他想不到该在最后一座墓碑上刻下什么字。他其实早就死了，只不过还未被埋葬而已，如同每一具孤独地在人世间徘徊的尸体一样，他已经失去了行为的动机。 “正直者”吧，没有比这更合适的了。阿卡林·柏亚林纳，洛林·安菲尔德和“正直者”，三座坟冢被汉克安置在了郊外，后来每到春天，那片地上便开满了矢车菊，孩子们在那里嬉戏，他们似乎也并不忌讳这些坟墓，当他们懂得离开这块草坪时，战争已经遥远的如同幻想一般了。警觉的先知们并没有在迹象到来时保持缄默，但他们的语句也没有延缓他的降生，他们只能眼睁睁看着，大地在钢铁囚笼下的兽斗中再次破碎，天穹在野心家的呼唤下，给这动荡不安的时代降下了暴风雨。 四十余年后，花朵在被履带碾碎时所放出的最后的芳香，已经完全消弭了，经历战火的石碑也没有存在的痕迹了，或许尚存不愿化作春泥的灰烬，正在世界的某处，用自身的存在诉说着这个故事。 氿月 2024/12/21 冬至","link":"/01/MorsJustorum.html"},{"title":"佛州奇闻","text":"前几天，我在佛州旅居的一位朋友，给我写了一封邮件。邮件里讲述了一些他和当地中国留学生的校内生活。我为之惊诧无比，同时也因其之奇趣搞笑而前仰后合。我便向他发了更多邮件问询事情的具体状况，包括一些有趣的细节。作为一个中国人，我觉得这些事情的真实度应该颇高，毕竟太过于离谱的事情，我一向认为，是编不出来的。 我的那位朋友在佛罗里达的一所高中读书，校徽是JB，倘若有心去找，说不准能找到。据他所言，他“落入这不幸的处境”，主因是受了留学中介的骗。一件幸事是那里的中国人很多，不像鲁迅在仙台留学，像“胶菜”一样有特殊待遇。不幸的是，学校将中国学生的寝室门前，都用汉字标上了名字。有别有用心者，趁没人在的时候，将假香蕉放在他们的门口，或是丢进低层的阳台。本来据说有段时间扔的是真香蕉，想必是不想用昂贵的水果便宜了中国人；故才革新了手段。 说到他们的寝室，那就不得不提《瓦罗兰特》。与国人一样，他们也爱打瓦。据说男生寝室有为了与国内的朋友打瓦，通宵到早上七八点的，学都不去上。为了规避宿管查房，他们就拉上窗帘，躲在床垫和被子下面，等宿管查寝完毕，再爬出来睡觉。白天睡觉，晚上打瓦，用存着的高热量零食应付三餐；至于他们有没有身处学校的自知，我就不知道了。当然，这些人由于与社交生活过于脱节，所以也成不了什么气候，我的朋友对这群夜行生物也知之甚少。 他在对我的邮件里这么说：（本校的）中国学生基本上要么打瓦，要么就是个人物；女生则基本上都是人物。也确实如此，几件小事便足以印证。 两年前，一位时年十五岁的赵先生转学到了那所学校。他开学没多久就约上了一个初中部的女生，但是那个初中部的女生很快又在朋友圈曝光了他的一些黑料。在这之后，他与一位学姐在感恩节出行，由于控制不住下体，导致关系降至冰点。他又傍上了另外一位即将毕业的学姐，该学姐与前男友分手之后和赵先生进入了热恋，在火锅店发生了关系。 赵先生平生最自豪的两件事情，就是在国内向一位女生注射了梦想毁灭剂，却还能安然逃到美国；其次便是他多次购买壮阳药，而无人发现。这两件事据说他逢人就说。一年后，由于台风原因，姊妹校的一些学生来JB避险。他百忙之中抽出时间（他同时还有着数位女朋友），与姊妹校的学生发生了关系。后来宿舍大量的现金开始丢失，几乎没有人不怀疑赵先生。最后这些现金也没找到，倘若是赵先生偷的，大抵早就花完了。 在赵先生因酗酒被学校得知，勒令协议退学后，同学在他房间发现了大量赃物。事发当天赵先生在加拿大与现任女友吸食大麻，知情者透露女友小红书收藏了不少避孕药。回国后，赵先生也很快又找了一位女友，他的父母千里迢迢的从中国赴美为他收拾烂摊子。而他本人后来再也没有露面。 JB还有个书法社，说起来其实是越南学长建的，但后来被愈发增多的中国学生占有了。有很多人怀疑现任书法社社长是同性恋，甚至出于不可名状的原因，想要利用这个“丑闻”把他扳倒。需要说明的是，即使是在一所美高，中国留学生对同性恋的容忍程度也没有一点提高，这是我感到很幽默的地方。 社长和两位女生（李小姐和黄小姐）关系还行。有一天，他突然觉得自己维持不了和两个女生的关系，所以开始对两位小姐挑拨离间。两位小姐也不是傻子，很快把社长是男同性恋的事情告诉了一位陈先生。这位陈先生是中国留学生中的交际花，到处传播社长是男同的消息。社长不知道李、黄背刺了自己。患有严重抑郁症的他悲愤成疾。他唯一能做的事就是找宿舍老师，尝试让他管管消息的传播。但这是不可能的，即使宿管会管，他也完全听不懂中文。他便这样绝望地淡出了学校，没有人知道他是退学了，还是成为了又一个“瓦学弟”。 这位陈先生也不一般，据传是一位情场高手。他多次尝试睡了自己的两个男性朋友，最终导致三人反目成仇。他和李小姐曾有一段过往，在李小姐的男友出现之前，二人曾经在两个人目击之下，进厕所待了十来分钟，出来后筋疲力尽，一起躺在床上。男友出现之后，李小姐几乎成为了他的舔狗；他把她当炮友，但她却动了真感情，有趣的是陈先生和李小姐的关系则几乎相反。李小姐的男友也是个怪人，据传他只和名字开头有C的人做，比如Cameron, Cassie。 而李小姐不仅是一位多情女子，还是一位文学大师。她去和男友开房的时候，把细节都记了下来。她不止记了下来，甚至还把自己文采斐然的大作传阅。陈先生读到后，也免不了为她宣传一番。李小姐便拉着那两个曾经险遭毒手的男生，去找校长告状。但这些神人们罗织的罪名却令人哭笑不得——造黄谣。陈先生知道舆论环境已然不对，于是谋划提前回国，买了假章，说自己要回国办演唱会。他的拙劣把戏骗不过任何人，很快他就被扣了下来。但因为他的后台够硬，还没受到任何处罚。据说他现在已经回到了国内，连朋友圈里的女友都已经换了两个了。演唱会倒是没有消息，倘若有票我倒想去看看他，权当去马戏团了。 我向我的朋友表达了最诚挚的 condolences；并且表示倘若有更多这样的故事的话，务必要发给我。他也向我保证这些故事还有很多，并且肯定会发给我。我只能说，我有点可怜我的朋友，很显然这不是他应当身处的环境。不论如何，我衷心地希望他能早日离开，或在这鬼地方找到一些值得做的事情。 氿月 2025/6/18","link":"/01/ComedyInFlorida.html"}],"tags":[{"name":"写作","slug":"写作","link":"/tags/%E5%86%99%E4%BD%9C/"},{"name":"诗","slug":"诗","link":"/tags/%E8%AF%97/"},{"name":"正确的中肯的一针见血的","slug":"正确的中肯的一针见血的","link":"/tags/%E6%AD%A3%E7%A1%AE%E7%9A%84%E4%B8%AD%E8%82%AF%E7%9A%84%E4%B8%80%E9%92%88%E8%A7%81%E8%A1%80%E7%9A%84/"},{"name":"寂白之间","slug":"寂白之间","link":"/tags/%E5%AF%82%E7%99%BD%E4%B9%8B%E9%97%B4/"},{"name":"妄谈","slug":"妄谈","link":"/tags/%E5%A6%84%E8%B0%88/"},{"name":"明治十七","slug":"明治十七","link":"/tags/%E6%98%8E%E6%B2%BB%E5%8D%81%E4%B8%83/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"编程","slug":"编程","link":"/tags/%E7%BC%96%E7%A8%8B/"},{"name":"文学","slug":"文学","link":"/tags/%E6%96%87%E5%AD%A6/"},{"name":"随笔","slug":"随笔","link":"/tags/%E9%9A%8F%E7%AC%94/"},{"name":"无形学会","slug":"无形学会","link":"/tags/%E6%97%A0%E5%BD%A2%E5%AD%A6%E4%BC%9A/"},{"name":"访谈","slug":"访谈","link":"/tags/%E8%AE%BF%E8%B0%88/"},{"name":"日记八集","slug":"日记八集","link":"/tags/%E6%97%A5%E8%AE%B0%E5%85%AB%E9%9B%86/"},{"name":"关于我自己","slug":"关于我自己","link":"/tags/%E5%85%B3%E4%BA%8E%E6%88%91%E8%87%AA%E5%B7%B1/"},{"name":"无聊","slug":"无聊","link":"/tags/%E6%97%A0%E8%81%8A/"},{"name":"音乐","slug":"音乐","link":"/tags/%E9%9F%B3%E4%B9%90/"},{"name":"Minecraft","slug":"Minecraft","link":"/tags/Minecraft/"},{"name":"摄影","slug":"摄影","link":"/tags/%E6%91%84%E5%BD%B1/"},{"name":"游记","slug":"游记","link":"/tags/%E6%B8%B8%E8%AE%B0/"},{"name":"十三而立","slug":"十三而立","link":"/tags/%E5%8D%81%E4%B8%89%E8%80%8C%E7%AB%8B/"},{"name":"杂文","slug":"杂文","link":"/tags/%E6%9D%82%E6%96%87/"}],"categories":[],"pages":[{"title":"I&#39;m Sorry But 404 Not Found","text":"404 Not Found很抱歉，您访问的页面不存在 可能是输入地址有误或该地址已被删除","link":"/404.html"},{"title":"关于","text":"自我介绍氿月，男，17岁，真名陈伯林。 “Et in Arcadia, ego.” Current Co-Leader/President of Team OblivionOcean. 简史2019 年前, 结识土土。加入过某个名气不大的写作群(星落学堂)，大约过往的成员们都已经忘了吧。 2019 年开始搭建第一个博客，网址为 https://chuishen.cf/。那段时期刚刚开始使用 Hexo，那段时间我能想得起来的项目只有“Du”。 2020 - 2021 年退网，当时境况见《十三而立》。 2022 年重建博客，域名沿用至今。结识 Fgaoxing。加入了瞳星阁，这个组织现在已经停止运行。建立玄云海，职位为社长。开启《白银树之恋》系列(现载于 Legacy 站)，且并未完结。 2023 年开启《御伽之国的鬼岛》系列 (第一次被批评)，同年完结(现载于 Legacy 站)。同年开启《寂白之间》系列，上半卷已完结，下半卷正在更新，载于此站。进入杭州外国语学校就读高中。随团队一起获得VEX机器人亚洲公开赛二等奖。 2024 年将本站分为，Legacy，Memoria 以及本站三站，Memoria 是我与远冬的写作站点 (现已消弭)，Legacy 专门放点黑历史，主站更新部分文学性作品以及部分。开启《脚本哲学》系列和《妄谈》系列。于六月正式加入天鸡文学社，担任网站管理员之职。另外为战国日本服务器架设官方网站，为 TerraMC 服务器撰写备份脚本。六月份测试了英文站，尚未正式启用。 主要作品文字类见标签“写作”以及系列。 编程类(部分) SearchButton，一个 HTML 标签定义. Xelsior，原名 NewPad，主要创意来自于我。 Flask Captcha Generator，一个通过 Serverless 技术实现的在 Vercel 上可零成本运行的验证码。 WaterMello，一个自定义版《合成大西瓜》生成器+启动器。 DStroyer，一个清除苹果临时文件(如.DS_Store)的脚本。 HamudTranslator，还未完成，敬请期待。 另见 Lafcadia’s GitHub ChuishenX’s Github 荣誉 (2023 年后) UKMT/SMC 2023 金奖 2023 杭州市科技节机器人竞赛团体一等奖 (亚军) 2023-2024 赛季 VEX 机器人亚洲锦标赛团体二等奖 Minecraft let skinViewermcskin654 = new skinview3d.SkinViewer({ canvas: document.getElementById(\"mcskin654\"), width: 300, height: 400, skin: \"https://mineskin.eu/skin/JiaoWang\" }); skinViewermcskin654.autoRotate = true; skinViewermcskin654.animation = new skinview3d.WalkingAnimation(); 落花星雨 - 起床战争 300 星，ID: Ancester。 CiVEarth - OP Hypherath SMP - 服主，创始人。","link":"/about/index.html"},{"title":"","text":".search { position: relative; margin-top: 1em; margin-bottom: 1em; padding: 5px; padding-left: 0; border-radius: 4px; -webkit-border-radius: 4px; font-size: 0.9375rem; background: none; display: block; line-height: 1.6; } /* .search[type=baidu] { border-left: 4px solid #09aaff; } .search[type=baidu]::before { color: #09aaff; } .search[type=google] { border-left: 4px solid #29ff78; } .search[type=google]::before { color: #29ff78; } .search[type=sogou] { border-left: 4px solid #f87dff; } .search[type=sogou]::before { color: #f87dff; } .search[type=S360] { border-left: 4px solid #007c32; } .search[type=S360]::before { color: #007c32; } .search[type=bing] { border-left: 4px solid #fcb523; } .search[type=bing]::before { color: #fcb523; } .search[type=github] { border-left: 4px solid black; } .search[type=github]::before { color: black; } .search[type=yandex] { border-left: 4px solid rgb(255, 32, 99); } .search[type=yandex]::before { color: rgb(255, 32, 99); } */ .search::before { position: absolute; top: calc(50% - 24px * 0.5); left: 4px; width: 24px; height: 24px; text-align: center; font-weight: 600; line-height: 24px; vertical-align: middle; }","link":"/search.css"},{"title":"推荐网站","text":"推荐请求 &amp; 实例请在评论区留下以下信息： 名字(非必要): Lafcadia’s Blog 网站: https://chuishen.xyz/ 头图(非必要): https://cravatar.cn/avatar/57ff1222a81493a0e72782530e77b269?s=500 简介(非必要): Et in Arcadia, ego. 推荐网站 祈星海 循此苦旅，以达星辰。 ZhangJet 一个好人的日常记录。 Fgaoxing 一个少年的博客。 珂泽小站 某全沾工程师的技术笔记和划水日常。 低调小熊猫 读万卷书，行万里路，赚很多钱。 Lemon's Blog 人见人爱，花见花开，车见车爆胎。 写bug的代码人 没有比这再简陋的网站了。 那个码农 世人盛爱牡丹。 技术云 玄云海的同伴。 Casear的技术栈 如果你有机会到好望角，请在海边的石头上刻下我的故事👨‍💻。 XiaoWangのBlog 上进的运维工程师。 KEVIN'S BLOG Kevin的博客。 Camill 嵌入式、ROS、还有生活！ 张洪Heo 分享设计与科技生活。 天鸡文学社 隶属于余杭高级中学（临平中学），是全国百佳校园文学社，全国优秀中学生社团。 MysticStars 生在此侧，死在彼侧。我在此侧，不在彼侧。 LIMEUWU Puis-je prétendre à un miracle. 月落星沉 斯人如彩虹，遇上方知有。 Redish101 Blog 人文 科技 白日梦 呓语梦轩 用心享受生活。 纸鹿摸鱼处 纸鹿至麓不知路，支炉制露不止漉。 轻风记 风会记得一朵花的香。 雅余 茶余饭后，闲情雅致。 OfferNow 分享最新的面试技巧、题库和编程知识。 枫林·浅羽·云梦 枫浅羽，云浅语。","link":"/suggestion/index.html"},{"title":"系列","text":"明治十七收录了我 2024 年 6 月至 10 月的一些短篇文章。 西海岸，东海道 金阁寺的一块天花板 漫步于夜晚的白鹭城 义和拳 脑中的鹿角 彩 致命玩笑 失落的桃花源 水上烟花 寂白之间 ~ Invisible Kingdom of Nothingness一个主要致敬ZUN、格兰特·莫里森的作品的故事，仍在更新。 第一章 第二章 第三章 第四章 第五章 第六章 御伽之国的鬼岛 ～ Misbelief of Godless Souls一个主要致敬ZUN、格兰特·莫里森的作品的故事。标题neta自《东方萃梦想》角色伊吹萃香的角色曲《御伽之国的鬼岛 ～ Missing Power》。 仍在更新。由于不佳将被重写，旧版本详见 Legacy。 白银树之恋一个主要致敬ZUN、王小波的作品的故事。某种程度上包含了《御伽之国的鬼岛》系列。 仍在更新。由于不佳将被重写，旧版本详见 Legacy。 十三而立人生第一篇有类小说的东西，标题和部分语段Neta自王小波的《三十而立》。 正作 纪念篇 其他敬请期待《孤独之心》。","link":"/series/index.html"}]}